[{"Month No.": "1", "Month-Day(s)-Events": ["January 1 – The British Nimrod Expedition led by Ernest Shackleton sets sail from New Zealand on the Nimrod for Antarctica.", "January 3 – A total solar eclipse is visible in the Pacific Ocean, and is the 46th solar eclipse of Solar Saros 130.", "January 15 – Alpha Kappa Alpha Sorority is founded on the campus of Howard University, in Washington, D.C.", "January 24 – Robert Baden-Powell's Scouting for Boys begins publication in London. The book eventually sells over 100 million copies, and effectively begins the worldwide Boy Scout movement."]}, {"Month No.": "2", "Month-Day(s)-Events": ["February 1 – Lisbon Regicide: King Carlos I of Portugal and Prince Luis Filipe are shot dead in Lisbon.", "February 3 – Panathinaikos, a well known professional multi-sports club of Greece, is founded in Athens.", "February 12 – The first around-the-world car race, the 1908 New York to Paris Race, begins.", "February 18 – Japanese emigration to the United States is forbidden, under terms of the Gentlemen's Agreement of 1907."]}, {"Month No.": "3", "Month-Day(s)-Events": ["March – The Children's Encyclopædia begins publication in London.", "March 4\nThe Pretoria branch of the Transvaal University College, precursor to the University of Pretoria, is established.\nThe Collinwood school fire near Cleveland, Ohio kills 174.\nBank of Communications, as major financial service in China, founded in Beijing,.", "The Pretoria branch of the Transvaal University College, precursor to the University of Pretoria, is established.", "The Collinwood school fire near Cleveland, Ohio kills 174.", "Bank of Communications, as major financial service in China, founded in Beijing,.", "March 23 – American diplomat Durham Stevens, an employee of Japan's Ministry of Foreign Affairs, is assassinated in San Francisco by two Korean immigrants, unhappy with his recent support for the increasing Japanese presence in Korea.", "March 27 – The first Scout troop outside the U.K. is formed in Gibraltar.", "March 29 – French aviator Henri Farman makes the world's first flight with a passenger, Léon Delagrange."]}, {"Month No.": "4", "Month-Day(s)-Events": ["April 8 – H. H. Asquith of the Liberal Party takes office as Prime Minister of the United Kingdom, succeeding Sir Henry Campbell-Bannerman.", "April 20 – Sunshine rail disaster: A rear-end collision of two trains in Melbourne, Australia kills 44 people, and injures more than 400.", "April 21 – Frederick Cook claims to have reached the North Pole on this date."]}, {"Month No.": "5", "Month-Day(s)-Events": ["May 14 – October 31 – The Franco-British Exhibition (1908) is held in London.", "May 26 – At Masjed Soleyman in southwest Persia, the first major commercial oil discovery in the Middle East is made. The rights to the resource are quickly acquired by the United Kingdom."]}, {"Month No.": "6", "Month-Day(s)-Events": ["June 28 – An annular solar eclipse was visible from Central America, North America, Atlantic Ocean and Africa, and was the 33rd solar eclipse of Solar Saros 135.", "June 29 - Kohlerer-Bahn by Bleichert opens in Bolzano, South Tyrol, the first modern aerial enclosed cable car solely for passenger service.", "June 30 (June 17 OS) – The Tunguska event or \"Russian explosion\" near the Podkamennaya Tunguska River in Krasnoyarsk Krai, Siberia, Russian Empire, is believed to have been caused by the air burst of a large meteoroid or comet fragment, at an altitude of 5–10 kilometres (3–6 mi) above the Earth's surface."]}, {"Month No.": "7", "Month-Day(s)-Events": ["July 3 – Young Turk Revolution in the Ottoman Empire: Major Ahmed Niyazi, with 200 followers (Ottoman troops and civilians), begins an open revolution by defecting from the 3rd Army Corps in Macedonia, decamping into the hill country.", "July 6 – Robert Peary sets sail for the North Pole.", "July 8 – French aviator Léon Delagrange makes the world's first flight with a female passenger, his partner and fellow sculptor Thérèse Peltier.", "July 11 – 12 – The steamship Amalthea, housing 80 British strikebreakers in Malmö harbour, Sweden, is bombed by Anton Nilson; 1 is killed, 20 injured.", "July 13 – 25 – The 1908 Summer Olympics are held in London, originally scheduled to be in Rome, but changed due to the Mount Vesuvius eruption of 1906. (Figure skating events are held in London from October 28 – 29.)", "July 19 – Feyenoord, the first Dutch football club to win the UEFA Champions League, is founded at Rotterdam, Netherlands", "July 23 – Young Turk Revolution: The Committee of Union and Progress (CUP) issues a formal ultimatum to Sultan Abdul Hamid II, to restore the constitution of 1876 within the Ottoman Empire (it is restored the following day).", "July 24 – Italian Dorando Pietri wins the Olympic marathon (run from Windsor Castle to London) in one of the most dramatic arrivals in Olympic history, only to be disqualified soon afterwards for receiving assistance; victory is awarded to Irish-American Johnny Hayes.", "July 27 – 28 – The 1908 Hong Kong typhoon sinks the passenger steamer Ying King, causing 421 deaths."]}, {"Month No.": "8", "Month-Day(s)-Events": ["August 8\nWilbur Wright flies in France for the first time, demonstrating true controlled powered flight in Europe.\nThe Hoover Company of Canton, Ohio, acquires manufacturing rights to the upright portable vacuum cleaner just invented by James M. Spangler.", "Wilbur Wright flies in France for the first time, demonstrating true controlled powered flight in Europe.", "The Hoover Company of Canton, Ohio, acquires manufacturing rights to the upright portable vacuum cleaner just invented by James M. Spangler.", "August 17 – Émile Cohl makes the first fully animated film, Fantasmagorie.", "August 24 – After an intense power struggle, Sultan Abdelaziz of Morocco is deposed, and is succeeded by his brother Abd al-Hafid.", "August 28 – American Messenger Company, as predecessor of United Parcel Service founded in Washington State, United States.", "August 31 – The Great Storm of 1908 starts to pound the Bristol Channel, lasting into the morning of September 2."]}, {"Month No.": "9", "Month-Day(s)-Events": ["September 10 – The first Minas Geraes-class Dreadnought battleship for Brazil, Minas Geraes is launched at Armstrong Whitworth's yard on the River Tyne in England, catalysing the \"South American dreadnought race\".", "September 17 – At Fort Myer, Virginia, Thomas Selfridge becomes the first person to die in an airplane crash. The pilot, Orville Wright, is severely injured in the crash but recovers."]}, {"Month No.": "10", "Month-Day(s)-Events": ["October 1\nOfficial launch of Henry Ford's Ford Model T automobile, the first having left the Ford Piquette Avenue Plant in Detroit, Michigan, on September 27. The initial price is set at US$850.\nPenny Post is established between the United Kingdom and United States.", "Official launch of Henry Ford's Ford Model T automobile, the first having left the Ford Piquette Avenue Plant in Detroit, Michigan, on September 27. The initial price is set at US$850.", "Penny Post is established between the United Kingdom and United States.", "October 5\nBulgaria declares its independence from the Ottoman Empire; Ferdinand I of Bulgaria becomes Tsar.\nThe Melting Pot, a play by Israel Zangwill, opens in Washington, D.C.  The title quickly becomes a widely used symbol for assimilation of immigrants to the United States.", "Bulgaria declares its independence from the Ottoman Empire; Ferdinand I of Bulgaria becomes Tsar.", "The Melting Pot, a play by Israel Zangwill, opens in Washington, D.C.  The title quickly becomes a widely used symbol for assimilation of immigrants to the United States.", "October 6 – The Bosnian crisis begins, after the Austro-Hungarian Empire annexes Bosnia and Herzegovina from the Ottoman Empire.", "October 14 – The Chicago Cubs beat the Detroit Tigers in the 1908 World Series. The Cubs would not win another World Series for 108 years.", "October 29 – Olivetti, the well known typewriter and business equipments company, is founded in Italy."]}, {"Month No.": "11", "Month-Day(s)-Events": ["November 3 – 1908 United States presidential election: Republican candidate William Howard Taft defeats William Jennings Bryan, 321 electoral votes to 162.", "November 6 – Western bandits Butch Cassidy and the Sundance Kid are supposedly killed in Bolivia, after being surrounded by a large group of soldiers. There are many rumors to the contrary however, and their grave sites are unmarked.", "November 15 – King Leopold II of Belgium formally relinquishes his personal control of the Congo Free State (becoming Belgian Congo) to Belgium, following evidence collected by Roger Casement of maladministration.", "November 25\nThe Christian Science Monitor newspaper is first published, in the United States.\nA fire breaks out on SS Sardinia as it leaves Malta's Grand Harbour, resulting in the ship's grounding and the deaths of at least 118 people.", "The Christian Science Monitor newspaper is first published, in the United States.", "A fire breaks out on SS Sardinia as it leaves Malta's Grand Harbour, resulting in the ship's grounding and the deaths of at least 118 people."]}, {"Month No.": "12", "Month-Day(s)-Events": ["December 2 – Young Emperor Puyi ascends the Chinese throne at age 2.", "December 16 – Construction begins on the RMS Olympic, at the Harland and Wolff Shipyard in Belfast.", "December 23 – A hybrid solar eclipse is visible from Atlantic Ocean, and is the 23rd solar eclipse of Solar Saros 140.", "December 28 – The 7.1 Mw  Messina earthquake shakes Southern Italy with a maximum Mercalli intensity of XI (Extreme), killing between 75,000 and 200,000."]}, {"Month No.": "13", "Month-Day(s)-Events": ["According to NASA reports, 1908 was the coldest recorded year since 1880.", "A 40,000-year-old Neanderthal boy skeleton is found at Le Moustier in southwest France, by Otto Hauser.", "The Western University of Pennsylvania is renamed the University of Pittsburgh.", "The State Normal and Industrial School for Women, precursor to James Madison University, is founded in Harrisonburg, Virginia.", "The University of Omaha, precursor of the University of Nebraska Omaha is founded as a private non-sectarian college.", "Benjamin Franklin Institute of Technology in Boston, Massachusetts, is established under the terms of Franklin's will.", "Hitachi, an electromechanics company, is founded as a mining machine repair factory in Ibaraki Prefecture, Japan."]}]