[{"Month No.": "1", "Month-Day(s)-Events": ["January 13 – The first public radio broadcast takes place; live performances of the operas Cavalleria rusticana and Pagliacci are sent out over the airwaves, from the Metropolitan Opera House in New York City."]}, {"Month No.": "2", "Month-Day(s)-Events": ["February 20 – Boutros Ghali, the first native-born Prime Minister of Egypt, is assassinated in Cairo."]}, {"Month No.": "3", "Month-Day(s)-Events": ["March – Albanian revolt of 1910: An uprising against Ottoman rule breaks out in Albania.", "March 8 – In France, Raymonde de Laroche is awarded Pilot's license No. 36 by the Federation Aeronautique Internationale, becoming the first woman authorized to fly an airplane.", "March 10\nSlavery in China, which has existed since the Shang dynasty, is now made illegal.\nNazareth Baptist Church, an African-initiated church, is founded by Prophet Isaiah Shembe in South Africa.", "Slavery in China, which has existed since the Shang dynasty, is now made illegal.", "Nazareth Baptist Church, an African-initiated church, is founded by Prophet Isaiah Shembe in South Africa.", "March 17 – Progressive Republicans in the United States House of Representatives rebel against Speaker Joseph Gurney Cannon, removing him from the Rules Committee, and stripping him of his power to appoint committee chairmen.", "March 18 – The first filmed version of Mary Shelley's Frankenstein comes out. Considered to be the first horror movie, it stars actor Charles Ogle as the monster."]}, {"Month No.": "4", "Month-Day(s)-Events": ["April 5 – The Transandine Railway connecting Chile and Argentina is inaugurated.", "April 20 – Halley's Comet is visible from Earth (its next visit will be in 1986)."]}, {"Month No.": "5", "Month-Day(s)-Events": ["May 6 – George V becomes King of the United Kingdom of Great Britain and Ireland upon the death of his father, Edward VII.", "May 12 – The second National Association for the Advancement of Colored People meeting is held in New York City.", "May 18 – The Earth passes through the tail of Halley's Comet.", "May 31 – The Union of South Africa is created."]}, {"Month No.": "6", "Month-Day(s)-Events": ["June 3 – The Norwegian Antarctic Expedition, led by Roald Amundsen on the steamer Fram, departs from Christiania (modern-day Oslo) without fanfare, and no announcement until later in the year of Amundsen's intention to reach the South Pole.", "June 5 – The Nanyang industrial exposition (\"Nanking Exposition\"), an official world's fair, opens in Qing dynasty China.", "June 6 – The Holland Dakota Landbouw Compagnie is established.", "June 15 – The British Antarctic Expedition, led by Robert Falcon Scott on the whaler Terra Nova, departs from Cardiff for the South Pole.", "June 22 – DELAG Zeppelin dirigible Deutschland makes the first commercial passenger flight, from Friedrichshafen to Düsseldorf in Germany; the flight takes 9 hours.", "June 25 – The ballet The Firebird (L'Oiseau de feu), the first major work by Russian composer Igor Stravinsky, commissioned by Diaghilev's Ballets Russes, is premièred in Paris, bringing the composer international fame."]}, {"Month No.": "7", "Month-Day(s)-Events": ["July 4 – African-American boxer Jack Johnson defeats white American boxer James J. Jeffries in a heavyweight boxing match, sparking race riots across the United States.", "July 11 – Departure for France of Amenokal Moussa Ag Amastan as part of the Tuareg mission.", "July 22 – A wireless telegraph sent from the SS Montrose results in the identification, arrest and execution of murderer Dr. Hawley Crippen.", "July 24 – Ottoman forces capture the city of Shkodër to put down the Albanian Revolt of 1910."]}, {"Month No.": "8", "Month-Day(s)-Events": ["August – The International Commercial Bureau of the American Republics becomes the Pan-American Union.", "August 14 – A fire at the Brussels International 1910 world's fair destroys exhibitions of Britain and France.", "August 20 – The Great Fire of 1910 (\"Big Blowup\"), a wildfire that burns 4,700 square miles in the Inland Northwest of the United States, due to dry weather.", "August 22 – The Japan–Korea Treaty of 1910, by which the Empire of Japan formally annexes the Korean Empire, is signed (it becomes effectively void in 1945, which is formally recognised in 1965).", "August 28 – Montenegro is proclaimed an independent kingdom, under Nicholas I.", "August 29 – Emperor Sunjong of Korea abdicates and the country's monarchy is abolished."]}, {"Month No.": "9", "Month-Day(s)-Events": ["September 1\nThe Vatican introduces a compulsory oath against modernism (Sacrorum antistitum), to be taken by all priests upon ordination.\nSport Club Corinthians Paulista is founded in Brazil by railwaymen; its Association football team will be the first FIFA Club World Cup champions in 2000.", "The Vatican introduces a compulsory oath against modernism (Sacrorum antistitum), to be taken by all priests upon ordination.", "Sport Club Corinthians Paulista is founded in Brazil by railwaymen; its Association football team will be the first FIFA Club World Cup champions in 2000.", "September 16 – Centennial of the opening of the Mexican War of Independence with ceremonies overseen by Porfirio Díaz."]}, {"Month No.": "10", "Month-Day(s)-Events": ["October\nInfrared photographs are first published by Professor Robert Williams Wood, in the Royal Photographic Society's journal.\nApproximate date of origin of Manchurian plague, a form of pneumonic plague which by December is spreading through northeastern China, killing more than 40,000.", "Infrared photographs are first published by Professor Robert Williams Wood, in the Royal Photographic Society's journal.", "Approximate date of origin of Manchurian plague, a form of pneumonic plague which by December is spreading through northeastern China, killing more than 40,000.", "October 5 – 5 October 1910 revolution: The First Portuguese Republic is proclaimed in Lisbon; King Manuel II of Portugal flees to England.", "October 7 – Baudette fire of 1910, a wildfire that burns ca. 350,000 square miles in Minnesota and Ontario, including several towns.", "October 18 – The lake freighter SS William C. Moreland runs aground on a reef near the Keweenaw Peninsula in Lake Superior, leading to its loss.", "October 20 – The hull of White Star ocean liner RMS Olympic is launched, at the Harland and Wolff Shipyards in Belfast.", "October 23\nVajiravudh (Rama VI) is crowned King of Siam, after the death of his father, King Chulalongkorn (Rama V).\nThe Philadelphia Athletics defeat the Chicago Cubs, 7–2, to win the 1910 World Series in baseball in Game 5 (Jack Coombs has been the winning pitcher in three of the Athletics' four wins).", "Vajiravudh (Rama VI) is crowned King of Siam, after the death of his father, King Chulalongkorn (Rama V).", "The Philadelphia Athletics defeat the Chicago Cubs, 7–2, to win the 1910 World Series in baseball in Game 5 (Jack Coombs has been the winning pitcher in three of the Athletics' four wins)."]}, {"Month No.": "11", "Month-Day(s)-Events": ["November 7 – The first air flight for the purpose of delivering commercial freight takes place in the United States. The flight, made by Wright brothers pilot Philip Parmalee, is between Dayton and Columbus, Ohio.", "November 14 – In the first takeoff from a ship by a fixed-wing aircraft, Eugene Ely takes off from a temporary platform erected over the bow of the light cruiser USS Birmingham in Hampton Roads, Virginia.", "November 20 – The Mexican Revolution begins, when Francisco I. Madero proclaims the elections of 1910 null and void, and calls for an armed revolution at 6 p.m. against the illegitimate presidency/dictatorship of Porfirio Díaz.", "November 22 – Revolt of the Lash at Rio de Janeiro: Mutineers in the Brazilian Navy, led by João Cândido Felisberto, seize control of the new dreadnought battleship Minas Geraes, and other ships whose guns are aimed at the city, as the crews demand improvements in their conditions (which are conceded on November 26 by the Brazilian government).", "November 23 – Johan Alfred Ander becomes the last person to be executed in Sweden."]}, {"Month No.": "12", "Month-Day(s)-Events": ["December 3 – Modern neon lighting is first demonstrated by Georges Claude at the Paris Motor Show."]}, {"Month No.": "13", "Month-Day(s)-Events": ["The electric streetcars of Austria-Hungary, France, Germany and Great Britain are carrying 6.7 million riders per year.", "Henry Ford sells 10,000 automobiles."]}]