[{"Month No.": "1", "Month-Day(s)-Events": ["January 1 – A decade after federation, the Northern Territory and the Australian Capital Territory are added to the Commonwealth of Australia.", "January 3\n1911 Kebin earthquake: An earthquake of 7.7 moment magnitude strikes near Almaty in Russian Turkestan, killing 450 or more people.\nSiege of Sidney Street in London: Two Latvian anarchists die, after a seven-hour siege against a combined police and military force. Home Secretary Winston Churchill arrives to oversee events.", "1911 Kebin earthquake: An earthquake of 7.7 moment magnitude strikes near Almaty in Russian Turkestan, killing 450 or more people.", "Siege of Sidney Street in London: Two Latvian anarchists die, after a seven-hour siege against a combined police and military force. Home Secretary Winston Churchill arrives to oversee events.", "January 5 – Egypt's Zamalek SC is founded as a general sports and Association football club by Belgian lawyer George Merzbach as Qasr El Nile Club.", "January 14 – Roald Amundsen's South Pole expedition makes landfall, on the eastern edge of the Ross Ice Shelf.", "January 18 – Eugene B. Ely lands on the deck of the USS Pennsylvania stationed in San Francisco harbor, the first time an aircraft has landed on a ship.", "January 26 – The United States and Canada announce the successful negotiation of their first reciprocal trade agreement."]}, {"Month No.": "2", "Month-Day(s)-Events": ["February 5\nThe Missouri State Capitol building in Jefferson City, Missouri is destroyed by fire after a bolt of lightning strikes the dome.\nThe revolution in Haiti is suppressed after the leader, General Montreuil Guillaume, is captured by government troops and shot. General Millionard is executed two days later.", "The Missouri State Capitol building in Jefferson City, Missouri is destroyed by fire after a bolt of lightning strikes the dome.", "The revolution in Haiti is suppressed after the leader, General Montreuil Guillaume, is captured by government troops and shot. General Millionard is executed two days later.", "February 17 – The first \"quasi-official\" airmail flight occurs, when Fred Wiseman carries three letters between Petaluma and Santa Rosa, California.", "February 18\nThe first official air mail flight, second overall, takes place in British India from Allahabad to Naini when Henri Pequet carries 6,500 letters a distance of 13 km.\nA serious earthquake causes a landslide that creates Lake Sarez in modern-day Tajikistan.", "The first official air mail flight, second overall, takes place in British India from Allahabad to Naini when Henri Pequet carries 6,500 letters a distance of 13 km.", "A serious earthquake causes a landslide that creates Lake Sarez in modern-day Tajikistan."]}, {"Month No.": "3", "Month-Day(s)-Events": ["March 19 – International Women's Day is celebrated for the first time across Europe.", "March 25 – The Triangle Shirtwaist Factory fire in New York City kills 146 people.", "March 29 – The United States Army adopts a new service pistol, the M1911, designed by John Browning (it remains the U.S. service pistol for 74 years)."]}, {"Month No.": "4", "Month-Day(s)-Events": ["April 3 – Jean Sibelius conducts the première of his Symphony No. 4, in Helsinki.", "April 8 – Heike Kamerlingh Onnes discovers superconductivity; he presents his findings on April 28.", "April 13 – Mexican Revolution: Rebels take Agua Prieta on the Sonora–Arizona border; government troops take the town back April 17, when the rebel leader \"Red\" López gets drunk.", "April 18 – SS Lusitania, a 5,557-ton Portuguese passenger liner en route from Mozambique to Lisbon, strikes Bellows Rock just off Cape Point and sinks.", "April 19 – Mexican Revolution: Francisco I. Madero's troops besiege Ciudad Juárez, but General Juan J. Navarro refuses his surrender demand.", "April 22 – A passenger train from Port Alfred to Grahamstown, South Africa derails on the Blaauwkrantz Bridge, and plunges into the ravine 200 feet (61 metres) below, killing 31 and seriously injuring 23.", "April 26 – HŠK Građanski Zagreb (predecessor of GNK Dinamo Zagreb), a Croatian Association football club, is founded in Zagreb.", "April 27 – Huanghuagang Uprising: In China, rebels take five villages in an attempt to create a power base to fight Imperial rule; those who die are remembered as \"The 72 Martyrs\" (the event is also called the \"Second Guangzhou Uprising\" and the \"Yellow Flower Mound Revolt\")."]}, {"Month No.": "5", "Month-Day(s)-Events": ["May 8 – Mexican Revolution: Pancho Villa launches an attack against government troops in Ciudad Juárez without Madero's permission; the government troops surrender on May 10.", "May 13–15 – Mexican Revolution: Torreón massacre – Over 300 Chinese residents are massacred by the revolutionary forces of Francisco I. Madero, in the Mexican city of Torreón.", "May 15 –Standard Oil is dissolved by the Supreme Court of the United States into 34 separate oil companies including Exxon, Mobil, Chevron, Texaco, and others due to violation of the Sherman Anti-Trust Act", "May 17 – Mexican Revolution: Porfirio Díaz is convinced to resign, but does not do so yet.", "May 21 – Mexican Revolution: In Ciudad Juárez, a peace treaty is signed between Madero's rebels and government troops.", "May 24 – Mexican Revolution: Government troops fire at anti-Diaz demonstrators in Mexico City, killing about 200 (officials claim only 40).", "May 25 – Mexican Revolution: Porfirio Díaz signs his resignation and leaves for Veracruz; on May 31 he leaves for exile in France.", "May 30 – The very first Indianapolis 500 automobile race is held in the United States, won by Ray Harroun at an average speed of 74.59 miles per hour.", "May 31 – The hull of the RMS Titanic is launched in Belfast, on the same day RMS Olympic starts her sea trials."]}, {"Month No.": "6", "Month-Day(s)-Events": ["June 7 – Mexican Revolution: Francisco Madero arrives in Mexico City, just after the 1911 Michoacán earthquake.", "June 14 – RMS Olympic departs Southampton, England, for her maiden voyage, with a first call at Cherbourg, France.", "June 15 – RMS Olympic arrives in Queenstown, Ireland, to discharge and take up passengers.", "June 21 – RMS Olympic arrives in New York at the end of her maiden voyage. She proceeds to her quarantine station off Staten Island, which she leaves at 7:45 a.m., and is saluted on her way up New York Harbor by all kinds of craft as she steams to Pier 59 in the North River. With the assistance of twelve tugs, Olympic is safely moored at 10 a.m.", "June 22 – George V and Mary of Teck are crowned King and Queen of the United Kingdom and the British Dominions, at Westminster Abbey in London. Moored at Pier 59 of New York Harbor, RMS Olympic is decorated for the occasion.", "June 23 – Frank C. Mars starts the Mars Candy Factory in Tacoma, Washington, origin of Mars, Incorporated, the global confectionery and pet food brand.", "June 25 – The Polish Football Union (PFU), later absorbed into the Polish Football Association (Polish: Polski Związek Piłki Nożnej, PZPN), is founded.", "June 28\nRMS Olympic departs New York for her maiden eastbound voyage home to Southampton, England.\nThe Nakhla meteorite falls in the Abu Hummus region of Egypt, providing evidence of water on Mars.", "RMS Olympic departs New York for her maiden eastbound voyage home to Southampton, England.", "The Nakhla meteorite falls in the Abu Hummus region of Egypt, providing evidence of water on Mars.", "June – The Sixth Conference of the International Woman Suffrage Alliance is held in Stockholm, Sweden."]}, {"Month No.": "7", "Month-Day(s)-Events": ["July 1 – The presence of the German warship Panther in the Moroccan port of Agadir triggers the Agadir Crisis.", "July 4 – RMS Olympic, having crossed the Atlantic, discharges passengers and mails off Plymouth, England.", "July 5 – RMS Olympic arrives in Southampton, England, ending her maiden eastbound voyage from New York.", "July 24 – Hiram Bingham rediscovers Machu Picchu in Peru.", "July 28 – The Australasian Antarctic Expedition began as the SY Aurora departed London."]}, {"Month No.": "8", "Month-Day(s)-Events": ["August 17–20 – Britain's National Railway strike of 1911, its first national strike of railway workers; on August 19 it leads to the Llanelli riots in Wales which result in 6 deaths.", "August 21 – Leonardo da Vinci's Mona Lisa is stolen from the Louvre museum in Paris by Vincenzo Peruggia; the painting is returned in 1913.", "August 27 – CSKA Moscow, a professional multi-sports club in Russia, is officially founded."]}, {"Month No.": "9", "Month-Day(s)-Events": ["September 20 – RMS Olympic collides with HMS Hawke in The Solent, causing considerable damage to both ships.", "September 25 – French battleship Liberté explodes at anchor in Toulon, France, killing around 300 onboard and in the surrounding area.", "September 29 – Italy declares war on the Ottoman Empire."]}, {"Month No.": "10", "Month-Day(s)-Events": ["October 4 – China adopts \"Cup of Solid Gold\" as its first national anthem. However, it is never performed publicly and is replaced a few months later with a new composition.", "October 7 – Liberal leader Karl Staaff returns as Prime Minister of Sweden after a Riksdag election victory based on the promises of defense cuts and social reforms.", "October 10 – The Wuchang Uprising starts the Xinhai Revolution, that leads to the founding of the Republic of China.", "October 16 – Mexican Revolution: Felix Diaz, nephew of Porfirio Díaz, occupies the port of Veracruz, as a sign of rebellion against Madero.", "October 26 – In American baseball, the Philadelphia Athletics defeat the New York Giants, 13–2, to win the 1911 World Series in 6 games. The game is tied 1–1 after three innings, but with four runs in the fourth, and seven runs in the seventh, the A's demolish the Giants. The most unusual play of the game is an inside-the-park home run made by the A's Jack Barry, on a bunt."]}, {"Month No.": "11", "Month-Day(s)-Events": ["November 1 – The world's first combat aerial bombing mission takes place in Libya, during the Italo-Turkish War. Second Lieutenant Giulio Gavotti of Italy drops several small bombs.", "November 3 – Chevrolet officially enters the automobile market in the United States, in competition with the Ford Model T.", "November 4 – The Treaty of Berlin brings the Agadir Crisis to a close. This treaty leads Morocco to be split between France (as a protectorate) and Spain (as the colony of Spanish Sahara), with Germany forfeiting all claims to Morocco. In return, France gives Germany a portion of the French Congo (as Kamerun) and Germany cedes some of German Kamerun to France (as Chad).", "November 5 – Italy annexes Tripoli and Cyrenaica (confirmed by an act of the Italian Parliament on February 25, 1912).", "November 17 – Omega Psi Phi fraternity is founded on the campus of Howard University, in Washington, D.C."]}, {"Month No.": "12", "Month-Day(s)-Events": ["December 1 – Outer Mongolia, the forerunner of modern-day Mongolia, is declared independent from the Chinese Empire.", "December 2 – Australasian Antarctic Expedition sets sail from Hobart.", "December 9 – A mine explosion near Briceville, Tennessee kills 84 miners, despite rescue efforts led by the United States Bureau of Mines.", "December 12 – The Delhi Durbar is held to mark the coronation of George V and Queen Mary as Emperor and Empress of India, and the transfer of the capital of British India from Calcutta to Delhi.", "December 14 – Roald Amundsen's expedition reaches the South Pole.", "December 18 – The first exhibition by Der Blaue Reiter group of painters opens in Munich.", "December 18–28 – George V's 1911 hunting trip in Nepal.", "December 24 – Lackawanna Cut-Off railway line opens in New Jersey and Pennsylvania.", "December 29 – Sun Yat-sen is elected Provisional President of the Republic of China."]}, {"Month No.": "13", "Month-Day(s)-Events": ["The Encyclopædia Britannica Eleventh Edition is published under American management in England, by Cambridge University Press.", "New Zealand-born British physicist Ernest Rutherford deduces the existence of a compact atomic nucleus from experiments involving Rutherford scattering, proposing the Rutherford model of the atom.", "The first suffrage organisation in Romania, Liga Drepturile si Datoriile Femeii, is founded.", "The Air Intelligence branch of Russia's Airforce is created."]}]