[{"Month No.": "1", "Month-Day(s)-Events": ["January 9 – WWI – Battle of Rafa: The last substantial Ottoman Army garrison on the Sinai Peninsula is captured by the Egyptian Expeditionary Force's Desert Column.", "January 10 – Imperial Trans-Antarctic Expedition: Seven survivors of the Ross Sea party were rescued after being stranded for several months.", "January 11 – Unknown saboteurs set off the Kingsland Explosion at Kingsland (modern-day Lyndhurst, New Jersey), one of the events leading to United States involvement in WWI.", "January 16 – The Danish West Indies is sold to the United States for $25 million.", "January 22 – WWI: United States President Woodrow Wilson calls for \"peace without victory\" in Germany.", "January 25 – WWI: British armed merchantman SS Laurentic is sunk by mines off Lough Swilly (Ireland), with the loss of 354 of the 475 aboard.", "January 26 – The sea defences at the English village of Hallsands are breached, leading to all but one of the houses becoming uninhabitable.", "January 28 – The United States ends its search for Pancho Villa.", "January 30 – Pershing's troops in Mexico begin withdrawing back to the United States. They reach Columbus, New Mexico February 5."]}, {"Month No.": "2", "Month-Day(s)-Events": ["February 1 – WWI: Atlantic U-boat Campaign: Germany announces its U-boats will resume unrestricted submarine warfare, rescinding the 'Sussex Pledge'.", "February 3 – WWI: The United States severs diplomatic relations with Germany.", "February 13\nMata Hari is arrested in Paris for spying.\nWWI – Raid on Nekhl: Units of the Egyptian Expeditionary Force completely reoccupy the Egyptian Sinai Peninsula.", "Mata Hari is arrested in Paris for spying.", "WWI – Raid on Nekhl: Units of the Egyptian Expeditionary Force completely reoccupy the Egyptian Sinai Peninsula.", "February 21 – British troopship SS Mendi is accidentally rammed and sunk off the Isle of Wight, killing 646, mainly members of the South African Native Labour Corps.", "February 24 – WWI: Walter Hines Page, United States ambassador to the United Kingdom, is shown the intercepted Zimmermann Telegram, in which Germany offers to give the American Southwest back to Mexico, if Mexico will take sides with Germany, in case the United States declares war on Germany."]}, {"Month No.": "3", "Month-Day(s)-Events": ["March 1\nWWI: The U.S. government releases the text of the Zimmermann Telegram to the public.\nŌmuta, Japan, is founded by Hiroushi Miruku.", "WWI: The U.S. government releases the text of the Zimmermann Telegram to the public.", "Ōmuta, Japan, is founded by Hiroushi Miruku.", "March 2 – The enactment of the Jones Act grants Puerto Ricans United States citizenship.", "March 4\nWoodrow Wilson is sworn in for a second term, as President of the United States.\nJeannette Rankin of Montana becomes the first woman member of the United States House of Representatives.", "Woodrow Wilson is sworn in for a second term, as President of the United States.", "Jeannette Rankin of Montana becomes the first woman member of the United States House of Representatives.", "March 7 – \"Livery Stable Blues\", recorded with \"Dixie Jazz Band One Step\" on February 26, by the Original Dixieland Jass Band in the United States, becomes the first jazz recording commercially released. On August 17 the band records \"Tiger Rag\".", "March 8 – (N.S.) (February 23, O.S.) – The February Revolution begins in Russia: Women calling for bread in Petrograd start riots, which spontaneously spread throughout the city.", "March 10 – The Province of Batangas is formally founded, as one of the Philippines' first encomiendas.", "March 11 – Mexican Revolution: Venustiano Carranza is elected president of Mexico; the United States gives de jure recognition of his government.", "March 12 – The Russian Duma declares a Provisional Government. It was dissolved 4 months later.", "March 14 – WWI: The Republic of China terminates diplomatic relations with Germany.", "March 15 (N.S.) (March 2, O.S.) – Emperor Nicholas II of Russia abdicates his throne and his son's claims. This is considered to be the end of the Russian Empire, after 196 years.", "March 16 (N.S.) (March 3, O.S.) – Grand Duke Michael Alexandrovich of Russia refuses the throne, and power passes to the newly formed Provisional Government, under Prince Georgy Lvov.", "March 25 – The Georgian Orthodox Church restores the autocephaly, abolished by Imperial Russia in 1811.", "March 26 – WWI – First Battle of Gaza: British Egyptian Expeditionary Force troops virtually encircle the Gaza garrison, but are then ordered to withdraw, leaving the city to the Ottoman defenders.", "March 30 – Hjalmar Hammarskjöld steps down as Prime Minister of Sweden; he is replaced by right-wing businessman and politician Carl Swartz.", "March 31 – The United States takes possession of the Danish West Indies, which become the US Virgin Islands, after paying $25 million to Denmark."]}, {"Month No.": "4", "Month-Day(s)-Events": ["April – Imokawa Mukuzo Genkanban no Maki, the first anime, is released in Japan.", "April 2 – WWI: U.S. President Woodrow Wilson asks the United States Congress for a declaration of war on Germany.", "April 6 – WWI: The United States declares war on Germany.", "April 8 (N.S.) (March 26, O.S.) – In Petrograd, 40,000 ethnic Estonians demand national autonomy within Russia.", "April 9–May 16 – WWI: Battle of Arras – British Empire troops make a significant advance on the Western Front but are unable to achieve a breakthrough.", "April 9–12 – WWI: Canadian troops win the Battle of Vimy Ridge.", "April 10 – Eddystone explosion: an explosion at an ammunition plant near Chester, Pennsylvania, kills 139, mostly female workers.", "April 11 – WWI: Brazil severs diplomatic relations with Germany.", "April 12 (N.S.) (March 30 O.S.) – The Autonomous Governorate of Estonia is formed within Russia, from the Governorate of Estonia and the northern part of the Governorate of Livonia.", "April 16\n(N.S.) (April 3, O.S.) – Vladimir Lenin arrives at the Finland Station in Petrograd.\nWWI: The Nivelle Offensive commences.", "(N.S.) (April 3, O.S.) – Vladimir Lenin arrives at the Finland Station in Petrograd.", "WWI: The Nivelle Offensive commences."]}, {"Month No.": "5", "Month-Day(s)-Events": ["April 17\n(N.S.) (April 4, O.S.) – Vladimir Lenin's April Theses are published. They become very influential in the following July Days and Bolshevik Revolution.\nWWI: The Egyptian Expeditionary Force begins the Second Battle of Gaza. This unsuccessful frontal attack on strong Ottoman defences along with the first battle, results in 10,000 casualties, the dismissal of force commander General Archibald Murray, and the beginning of the Stalemate in Southern Palestine.\nThe Times and the Daily Mail (London newspapers both owned by Lord Northcliffe) print atrocity propaganda of the supposed existence of a German Corpse Factory processing dead soldiers' bodies.", "(N.S.) (April 4, O.S.) – Vladimir Lenin's April Theses are published. They become very influential in the following July Days and Bolshevik Revolution.", "WWI: The Egyptian Expeditionary Force begins the Second Battle of Gaza. This unsuccessful frontal attack on strong Ottoman defences along with the first battle, results in 10,000 casualties, the dismissal of force commander General Archibald Murray, and the beginning of the Stalemate in Southern Palestine.", "The Times and the Daily Mail (London newspapers both owned by Lord Northcliffe) print atrocity propaganda of the supposed existence of a German Corpse Factory processing dead soldiers' bodies.", "April 19 – WWI: Army transport SS Mongolia (1903) fires the United States' first shots in anger in the war when her gun crew drives off a German U-boat in the English Channel seven miles southeast of Beachy Head.", "April 26 – WWI: The Agreement of Saint-Jean-de-Maurienne, between France, Italy and the United Kingdom, to settle interests in the Middle East, is signed."]}, {"Month No.": "6", "Month-Day(s)-Events": ["May 3 – WWI: 1917 French Army mutinies begin.", "May 9 – WWI: The Nivelle Offensive is abandoned.", "May 13 – Nuncio Eugenio Pacelli, the future Pope Pius XII, is consecrated Archbishop by Pope Benedict XV.", "May 13–October 13 (at monthly intervals) – 10-year-old Lúcia Santos and her cousins Francisco and Jacinta Marto report experiencing a series of Marian apparitions near Fátima, Portugal, which become known as Our Lady of Fátima.", "May 15 – Robert Nivelle is replaced as Commander-in-Chief of the French Army, by Philippe Pétain.", "May 18 – WWI: The Selective Service Act passes the United States Congress, giving the President the power of conscription.", "May 21 – Over 300 acres (73 blocks) are destroyed in the Great Atlanta fire of 1917 in the United States.", "May 22\nThe Commissioned Officer Corps of the U.S. Coast and Geodetic Survey is established.\nEll Persons is lynched in Memphis, in connection with the rape and murder of 16-year-old Antoinette Rappal.", "The Commissioned Officer Corps of the U.S. Coast and Geodetic Survey is established.", "Ell Persons is lynched in Memphis, in connection with the rape and murder of 16-year-old Antoinette Rappal.", "May 23\nA month of civil violence in Milan, Italy ends, after the Italian army forcibly takes over the city from anarchists and anti-war revolutionaries; 50 people are killed and 800 arrested.\nWWI: During the Stalemate in Southern Palestine the Raid on the Beersheba to Hafir el Auja railway, by the British Desert Column, large sections of the railway line linking Beersheba to the main Ottoman desert base are destroyed.", "A month of civil violence in Milan, Italy ends, after the Italian army forcibly takes over the city from anarchists and anti-war revolutionaries; 50 people are killed and 800 arrested.", "WWI: During the Stalemate in Southern Palestine the Raid on the Beersheba to Hafir el Auja railway, by the British Desert Column, large sections of the railway line linking Beersheba to the main Ottoman desert base are destroyed.", "May 26 – A tornado strikes Mattoon, Illinois, causing devastation and killing 101 people.", "May 27 – WWI: 1917 French Army mutinies: Over 30,000 French troops refuse to go to the trenches at Missy-aux-Bois.", "May 27 – Pope Benedict XV promulgates the 1917 Code of Canon Law."]}, {"Month No.": "7", "Month-Day(s)-Events": ["June 1 – 1917 French Army mutinies: A French infantry regiment seizes Missy-aux-Bois, and declares an anti-war military government. Other French army troops soon apprehend them.", "June 4 – The first Pulitzer Prizes are awarded: Laura E. Richards, Maud Howe Elliott and Florence Hall receive the first Pulitzer for a biography, (for Julia Ward Howe). Jean Jules Jusserand receives the first Pulitzer for history, for his work With Americans of Past and Present Days. Herbert Bayard Swope receives the first Pulitzer for journalism, for his work for the New York World.", "June 5 – WWI: Conscription begins in the United States.", "June 7 – WWI: Battle of Messines opens with the British Army detonating 24 ammonal mines under the German lines, killing 10,000 in the deadliest deliberate non-nuclear man-made explosion in history.", "June 8 – Speculator Mine disaster: A fire at the Granite Mountain and Speculator ore mine, outside Butte, Montana, kills at least 168 workers.", "June 11 – King Constantine I of Greece abdicates for the first time, being succeeded by his son Alexander.", "June 13 – WWI: The first major German bombing raid on London by fixed-wing aircraft leaves 162 dead and 432 injured.", "June 15 – The United States enacts the Espionage Act."]}, {"Month No.": "8", "Month-Day(s)-Events": ["July – The first Cottingley Fairies photographs are taken in Yorkshire, England, apparently depicting fairies (a hoax not admitted by the child creators until 1981).", "July 1\nEast St. Louis riot: A labor dispute ignites a race riot in East St. Louis, Illinois, which leaves 250 dead.\nRussian General Brusilov begins the major Kerensky Offensive in Galicia, initially advancing towards Lemberg.", "East St. Louis riot: A labor dispute ignites a race riot in East St. Louis, Illinois, which leaves 250 dead.", "Russian General Brusilov begins the major Kerensky Offensive in Galicia, initially advancing towards Lemberg.", "July 2 – WWI: Greece joins the war on the side of the Allies.", "July 6 – WWI:\nBattle of Aqaba: Arabian troops, led by T. E. Lawrence, capture Aqaba from the Ottoman Empire.\nThe Conscription Crisis of 1917 in Canada leads to passage of the Military Service Act.", "Battle of Aqaba: Arabian troops, led by T. E. Lawrence, capture Aqaba from the Ottoman Empire.", "The Conscription Crisis of 1917 in Canada leads to passage of the Military Service Act.", "July 7 – The Lions Clubs International is formed in the United States.", "July 8–13 – WWI – First Battle of Ramadi: British troops fail to take Ramadi from the Ottoman Empire; a majority of British casualties are due to extreme heat.", "July 12 – Bisbee Deportation: The Phelps Dodge Corporation deports over 1,000 suspected IWW members from Bisbee, Arizona.", "July 16–July 17 – Russian troops mutiny, abandon the Austrian front, and retreat to Ukraine; hundreds are shot by their commanding officers during the retreat.", "July 16–July 18 – July Days: Serious clashes occur in Petrograd; Vladimir Lenin escapes to Finland; Leon Trotsky is arrested.", "July 17 – King George V of the United Kingdom issues a proclamation, stating that thenceforth the male line descendants of the British Royal Family will bear the surname Windsor, vice the Germanic bloodline of House of Saxe-Coburg and Gotha, which is an offshoot of the historic (800+ years) House of Wettin.", "July 20\nThe Parliament of Finland, with a Social Democratic majority, passes a \"Sovereignty Act\", declaring itself, as the representative of the Finnish people, sovereign over the Grand Principality of Finland. The Russian Provisional Government does not recognize the act, as it would have devolved Russian sovereignty over Finland, formerly exercised by the Russian Emperor as Grand Prince of Finland, and alter the relationship between Finland and Russia into a real union, with Russia solely responsible for the defence and foreign relations of an independent Finland.\n(July 7, O.S.) – Alexander Kerensky becomes premier of the Russian Provisional Government, replacing Prince Georgy Lvov.\nThe Russian Provisional Government enacts women's suffrage.\nThe Corfu Declaration, which enables the establishment of the post-war Kingdom of Yugoslavia, is signed by the Yugoslav Committee and the Kingdom of Serbia.", "The Parliament of Finland, with a Social Democratic majority, passes a \"Sovereignty Act\", declaring itself, as the representative of the Finnish people, sovereign over the Grand Principality of Finland. The Russian Provisional Government does not recognize the act, as it would have devolved Russian sovereignty over Finland, formerly exercised by the Russian Emperor as Grand Prince of Finland, and alter the relationship between Finland and Russia into a real union, with Russia solely responsible for the defence and foreign relations of an independent Finland.", "(July 7, O.S.) – Alexander Kerensky becomes premier of the Russian Provisional Government, replacing Prince Georgy Lvov.", "The Russian Provisional Government enacts women's suffrage.", "The Corfu Declaration, which enables the establishment of the post-war Kingdom of Yugoslavia, is signed by the Yugoslav Committee and the Kingdom of Serbia.", "July 20–July 28 – WWI: Austrian and German forces repulse the Russian advance into Galicia.", "July 25 – Sir William Thomas White introduces Canada's first income tax as a \"temporary\" measure (lowest bracket is 4% and highest is 25%).", "July 28 – The Silent Parade is organized by the NAACP in New York City, to protest the East St. Louis riot of July 2, as well as lynchings in Tennessee and Texas.", "July 30 – The Parliament of Finland is dissolved by the Russian Provisional Government. New elections are held in the autumn, resulting in a bourgeois majority.", "July 31 – WWI – Battle of Passchendaele (\"Third Battle of Ypres\"): Allied offensive operations commence in Flanders."]}, {"Month No.": "9", "Month-Day(s)-Events": ["August 2–August 3 – The Green Corn Rebellion, an uprising by several hundred farmers against the WWI draft, takes place in central Oklahoma.", "August 2 – Squadron Commander E.H. Dunning lands his aircraft on the ship HMS Furious in Scapa Flow, Orkney. He is killed 5 days later during another landing on the ship.", "August 3 – The New York Guard is founded.", "August 10 – A general strike begins in Spain; it is smashed after 3 days with 70 left dead, hundreds of wounded and 2,000 arrests.", "August 14 – The Republic of China declares war on Germany and Austria-Hungary.", "August 17 – One of English literature's important meetings takes place, when Wilfred Owen introduces himself to Siegfried Sassoon at the Craiglockhart War Hospital in Edinburgh.", "August 18 – The Great Thessaloniki Fire of 1917 in Greece destroys 32% of the city, leaving 70,000 individuals homeless.", "August 29 – WWI: The Military Service Act is passed in the House of Commons of Canada, giving the Government of Canada the right to conscript men into the army."]}, {"Month No.": "10", "Month-Day(s)-Events": ["September 14 (September 1 Old Style) – Russia is declared a republic by the Provisional Government.", "September 23 – Leon Trotsky is elected Chairman of the Petrograd Soviet.", "September 25 – The Mossovet (Moscow Soviet of People's Deputies) votes to side with the Bolsheviks.", "September 26–October 3 – WWI – Battle of Polygon Wood (part of the Battle of Passchendaele) near Ypres in Belgium: British and Australian troops capture positions from the Germans.", "September 28–29 – WWI – Second Battle of Ramadi: British troops take Ramadi from the Ottoman Empire."]}, {"Month No.": "11", "Month-Day(s)-Events": ["October 4 – WWI: Battle of Broodseinde near Ypres – British Imperial forces overpower the German 4th Army's defences.", "October 12 – WWI: First Battle of Passchendaele: – Allies fail to take a German defensive position, with the biggest loss of life in a single day for New Zealand, over 800 men and 45 officers are killed, roughly 1 in 1,000 of the nation's population at this time.", "October 12-19 – WWI: Operation Albion – German forces land on and capture the West Estonian archipelago.", "October 13 – The Miracle of the Sun is reported at Fátima, Portugal.", "October 19\nDallas Love Field Airport is opened in Texas.\nCarl Swartz leaves office as Prime Minister of Sweden, after dismal election results for the right-wing in the Riksdag elections in September. He is replaced by liberal leader and history professor Nils Edén.", "Dallas Love Field Airport is opened in Texas.", "Carl Swartz leaves office as Prime Minister of Sweden, after dismal election results for the right-wing in the Riksdag elections in September. He is replaced by liberal leader and history professor Nils Edén.", "October 23 – A Brazilian ship is destroyed by a German U-Boat, encouraging Brazil to enter World War I.", "October 24 – WWI: Battle of Caporetto opens between the Kingdom of Italy and the Central Powers near Kobarid in the Austrian Littoral. It is the first major engagement for junior German officer Erwin Rommel.", "October 26 – WWI: Brazil declares war against the Central Powers."]}, {"Month No.": "12", "Month-Day(s)-Events": ["October 27 – WWI: Battle of Buqqar Ridge – Ottoman forces attack British Desert Mounted Corps units garrisoning El-Buqqar Ridge, during the last days of the Stalemate in Southern Palestine.", "October 31 – WWI: Battle of Beersheba – The British XX Corps and Desert Mounted Corps (Egyptian Expeditionary Force) attack and capture Beersheba from Ottoman forces, ending the stalemate in Southern Palestine. The battle includes a rare (by this date) mounted charge, by Australian mounted infantry."]}, {"Month No.": "13", "Month-Day(s)-Events": ["November 1 – WWI:\nThe British XXI Corps of the Egyptian Expeditionary Force begins the Third Battle of Gaza.\nThe British Desert Mounted Corps begins the Battle of Tel el Khuweilfe, in the direction of Hebron and Jerusalem.", "The British XXI Corps of the Egyptian Expeditionary Force begins the Third Battle of Gaza.", "The British Desert Mounted Corps begins the Battle of Tel el Khuweilfe, in the direction of Hebron and Jerusalem.", "November 2 – Zionism: The British Foreign Secretary Arthur Balfour makes the Balfour Declaration, proclaiming British support for the \"establishment in Palestine of a national home for the Jewish people..., it being clearly understood that nothing shall be done which may prejudice the civil and religious rights of existing non-Jewish communities\".", "November 5 (N.S.) (October 23, O.S.) – Estonian and Russian Bolsheviks seize power in Tallinn, Autonomous Governorate of Estonia, two days before the October Revolution in Petrograd.", "November 6\nWWI – Second Battle of Passchendaele: After 3 months of fierce fighting, Canadian forces take Passchendaele in Belgium (the battle concludes on November 10).\nWWI: The Battle of Hareira and Sheria is launched by the British XX Corps and Desert Mounted Corps, against the central Ottoman defences protecting the Gaza to Beersheba Road.\nMilitants from Trotsky's committee join with trusty Bolshevik soldiers, to seize government buildings and pounce on members of the provisional government.", "WWI – Second Battle of Passchendaele: After 3 months of fierce fighting, Canadian forces take Passchendaele in Belgium (the battle concludes on November 10).", "WWI: The Battle of Hareira and Sheria is launched by the British XX Corps and Desert Mounted Corps, against the central Ottoman defences protecting the Gaza to Beersheba Road.", "Militants from Trotsky's committee join with trusty Bolshevik soldiers, to seize government buildings and pounce on members of the provisional government.", "November 7\n(N.S.) (October 25, O.S.) – October Revolution in Russia: The workers of the Petrograd Soviet in Russia, led by the Bolshevik Party and leader Vladimir Lenin, storm the Winter Palace and successfully destroy the Kerensky Provisional Government after less than eight months of rule. This immediately triggers the Russian Civil War.\nIran (which has provided weapons for Russia) refuses to support the Allied Forces after the October Revolution.\nWWI – Third Battle of Gaza: The British Army XXI Corps occupies Gaza, after the Ottoman garrison withdraws.\nWWI: The Battle of Hareira and Sheria continues, when the XX Corps and Desert Mounted Corps capture Hareira and Sheria, marking the end of the Ottoman Gaza to Beersheba line.\nWomen's Suffrage in the United States: Women win the right to vote in New York State.", "(N.S.) (October 25, O.S.) – October Revolution in Russia: The workers of the Petrograd Soviet in Russia, led by the Bolshevik Party and leader Vladimir Lenin, storm the Winter Palace and successfully destroy the Kerensky Provisional Government after less than eight months of rule. This immediately triggers the Russian Civil War.", "Iran (which has provided weapons for Russia) refuses to support the Allied Forces after the October Revolution.", "WWI – Third Battle of Gaza: The British Army XXI Corps occupies Gaza, after the Ottoman garrison withdraws.", "WWI: The Battle of Hareira and Sheria continues, when the XX Corps and Desert Mounted Corps capture Hareira and Sheria, marking the end of the Ottoman Gaza to Beersheba line.", "Women's Suffrage in the United States: Women win the right to vote in New York State.", "November 8\n(N.S.) (October 26, O.S.) – Following the October Revolution, Alexandra Kollontai is appointed People's Commissar for Social Welfare in the Council of People's Commissars of the Government of the Russian Soviet Federative Socialist Republic, the first woman cabinet minister in Europe.", "(N.S.) (October 26, O.S.) – Following the October Revolution, Alexandra Kollontai is appointed People's Commissar for Social Welfare in the Council of People's Commissars of the Government of the Russian Soviet Federative Socialist Republic, the first woman cabinet minister in Europe.", "November 13 – WWI:\nBattle of Mughar Ridge: The Egyptian Expeditionary Force attacks retreating Yildirim Army Group forces, resulting in the capture of 10,000 Ottoman prisoners, 100 guns and 50 miles (80 km) of Palestine territory.\nThe ANZAC Mounted Division (Desert Mounted Corps) successfully fights the Battle of Ayun Kara, in the aftermath of the Battle of Mughar Ridge against strong German rearguards.", "Battle of Mughar Ridge: The Egyptian Expeditionary Force attacks retreating Yildirim Army Group forces, resulting in the capture of 10,000 Ottoman prisoners, 100 guns and 50 miles (80 km) of Palestine territory.", "The ANZAC Mounted Division (Desert Mounted Corps) successfully fights the Battle of Ayun Kara, in the aftermath of the Battle of Mughar Ridge against strong German rearguards.", "November 15\n\"Night of Terror\" in the United States: Influential suffragettes from the Silent Sentinels are deliberately subjected to physical assaults by guards while imprisoned.\nThe Parliament of Finland passes another \"Sovereignty Act\", dissolving Russian sovereignty over Finland and effectively declaring Finland independent.\n(N.S.) (November 2, O.S.) – The Provincial Assembly of the Autonomous Governorate of Estonia declares itself the highest legal body in Estonia, in opposition to Bolsheviks.", "\"Night of Terror\" in the United States: Influential suffragettes from the Silent Sentinels are deliberately subjected to physical assaults by guards while imprisoned.", "The Parliament of Finland passes another \"Sovereignty Act\", dissolving Russian sovereignty over Finland and effectively declaring Finland independent.", "(N.S.) (November 2, O.S.) – The Provincial Assembly of the Autonomous Governorate of Estonia declares itself the highest legal body in Estonia, in opposition to Bolsheviks.", "November 16\nWWI: Battle of Ayun Kara: The ANZAC Mounted Division occupies Jaffa.\nGeorges Clemenceau becomes prime minister of France.", "WWI: Battle of Ayun Kara: The ANZAC Mounted Division occupies Jaffa.", "Georges Clemenceau becomes prime minister of France.", "November 17\nWWI: Action of 17 November 1917: United States Navy destroyers USS Fanning and USS Nicholson capture Imperial German Navy U-boat SM U-58 off the south-west coast of Ireland, the first combat action in which U.S. ships take a submarine (which is then scuttled).\nWWI: The Battle of Jerusalem (1917) begins, with the Egyptian Expeditionary Force launching attacks against Ottoman forces in the Judean Hills.\nThe People's Dispensary for Sick Animals is founded in the United Kingdom.", "WWI: Action of 17 November 1917: United States Navy destroyers USS Fanning and USS Nicholson capture Imperial German Navy U-boat SM U-58 off the south-west coast of Ireland, the first combat action in which U.S. ships take a submarine (which is then scuttled).", "WWI: The Battle of Jerusalem (1917) begins, with the Egyptian Expeditionary Force launching attacks against Ottoman forces in the Judean Hills.", "The People's Dispensary for Sick Animals is founded in the United Kingdom.", "November 19 – WWI: Battle of Caporetto ends with Austrian and German forces driving the Italian army to retreat 150 kilometres south to the Piave river. The Italians lose 13,000 killed, 30,000 wounded, around 270,000 taken prisoner (mostly willingly) and 50,000 deserted; the government of Paolo Boselli collapses on November 29.", "November 20\nWWI: Battle of Cambrai – British forces, using tanks, make early progress in an attack on German positions, but are soon beaten back.\nThe Ukraine is declared a republic.", "WWI: Battle of Cambrai – British forces, using tanks, make early progress in an attack on German positions, but are soon beaten back.", "The Ukraine is declared a republic.", "November 22 – In Montreal, Quebec, Canada, the National Hockey Association suspends operations.", "November 23 – The Bolsheviks release the full text of the previously secret Sykes–Picot Agreement of 1916 in Izvestia and Pravda; it is printed in the Manchester Guardian on November 26.", "November 24 – A bomb kills 9 members of the Milwaukee Police Department, the most deaths in a single event in U.S. police history (until the September 11 attacks in 2001).", "November 25 – WWI: Battle of Ngomano – German forces defeat a Portuguese army of about 1,200 at Negomano, on the border of modern-day Mozambique and Tanzania.", "November 26 – The National Hockey League is formed in Montreal, as a replacement for the recently disbanded National Hockey Association.", "November 28 – WWI: The Bolsheviks offer peace terms to the Germans."]}]