[{"Month No.": "1", "Month-Day(s)-Events": ["January 12 – Gopinath Saha shoots Ernest Day, whom he has mistaken for Sir Charles Tegart, the police commissioner of Calcutta, and is arrested soon after.", "January 20–30 – Kuomintang in China holds its first National Congress, initiating a policy of alliance with the Soviet Union and the Chinese Communist Party.", "January 21 – The Earl of Athlone is appointed Governor-General of the Union of South Africa, and High Commissioner for Southern Africa.", "January 22 – Ramsay MacDonald becomes the first Labour Prime Minister of the United Kingdom.", "January 25 – The first Winter Olympics, the 1924 Winter Olympics open in Chamonix, in the French Alps.", "January 26 – Petrograd (Saint Petersburg) is renamed Leningrad; it will revert to Saint Petersburg in 1991."]}, {"Month No.": "2", "Month-Day(s)-Events": ["February 1 – The United Kingdom recognizes the Soviet Union.", "February 5 – GMT: A radio time signal is broadcast for the first time, from the Royal Greenwich Observatory.", "February 9 – Canada's National Hockey League expands to the United States for the first time with the inclusion of the Boston Bruins.", "February 12 – Rhapsody in Blue, by George Gershwin, is first performed in New York City, at Aeolian Hall.", "February 14 – The Computing-Tabulating-Recording Company (CTR), based in the U.S. state of New York, is renamed International Business Machines (IBM).", "February 22\nTreaty of Rome: The Kingdom of Italy annexes the Free State of Fiume, and the Kingdom of Serbs, Croats and Slovenes absorbs Sušak.\nCalvin Coolidge becomes the first President of the United States to deliver a radio broadcast from the White House.", "Treaty of Rome: The Kingdom of Italy annexes the Free State of Fiume, and the Kingdom of Serbs, Croats and Slovenes absorbs Sušak.", "Calvin Coolidge becomes the first President of the United States to deliver a radio broadcast from the White House."]}, {"Month No.": "3", "Month-Day(s)-Events": ["March 3 – The 407-year-old Islamic caliphate is abolished when Caliph Abdülmecid II of the Ottoman Caliphate is deposed. The last remnant of the old regime gives way to the reformed Turkey of President Kemal Atatürk.", "March 6 – İsmet İnönü forms a new government in Turkey (2nd government).", "March 15 – Horacio Vásquez wins the Dominican Republic general election, becoming president, coinciding with the end of United States military occupation.", "March 25 – The Second Hellenic Republic is proclaimed in Greece.", "March 29 – In France, the Third Ministry of Raymond Poincaré begins."]}, {"Month No.": "4", "Month-Day(s)-Events": ["April 1\nAdolf Hitler is sentenced to 5 years in jail in Germany for his participation in the 1923 Beer Hall Putsch (he serves less than 9 months).\nThe first revenue flight for Belgium's Sabena Airlines takes place.", "Adolf Hitler is sentenced to 5 years in jail in Germany for his participation in the 1923 Beer Hall Putsch (he serves less than 9 months).", "The first revenue flight for Belgium's Sabena Airlines takes place.", "April 6 – Italian general election, 1924: Fascists win the elections in Italy with a two-thirds majority.", "April 13 – The Greek republic referendum favors formation of the Second Hellenic Republic.", "April 16 – American media company Metro-Goldwyn-Mayer (MGM) is founded in Los Angeles.", "April 23 – The British Empire Exhibition opens in London; it is the largest colonial exhibition, with 58 countries of the empire dramatically represented.", "April 27 – A group of Alawites kill several nuns in Syria; French troops march against them.", "April 28 – An explosion in a mine at the Wheeling Steel Corporation in Benwood, West Virginia kills 119 men."]}, {"Month No.": "5", "Month-Day(s)-Events": ["May 3 – The Aleph Zadik Aleph, the oldest Jewish youth fraternity, is founded in Omaha, Nebraska.", "May 4 – The 1924 Summer Olympics opening ceremonies are held in Paris, France.", "May 8 – Lithuania signs the Klaipėda Convention with the nations of the Conference of Ambassadors, taking the Klaipėda Region from East Prussia and making it into an autonomous region.", "May 10 – In the United States, J. Edgar Hoover is appointed head of the Federal Bureau of Investigation.", "May 11 – Mercedes-Benz is formed by the merging of companies owned by Gottlieb Daimler and Karl Benz.", "May 21 – University of Chicago students Richard Loeb and Nathan Leopold Jr. murder 14-year-old Bobby Franks in a thrill killing. The event will inspire the 1929 play Rope.", "May 24 – The Immigration Act of 1924 is signed into law in the United States, including the Asian Exclusion Act.", "May 26 – Harry Grindell Matthews attempts to demonstrate his \"death ray\" to the War Office in the United Kingdom.", "May 30 – Italian socialist leader Giacomo Matteotti speaks out against Fascism. A few days later he is kidnapped and murdered in Rome."]}, {"Month No.": "6", "Month-Day(s)-Events": ["June 2 – U.S. President Calvin Coolidge signs the Indian Citizenship Act into law, granting citizenship to all Native Americans born within the territorial limits of the United States.", "June 5 – Ernst Alexanderson sends the first facsimile across the Atlantic Ocean, which goes to his father in Sweden.", "June 7–16 – Rudolf Steiner delivers his Agriculture Course at Koberwitz beginning of the organic agriculture movement.", "June 8 – George Mallory and Andrew Irvine are last seen \"going strong for the top\" of Mount Everest by teammate Noel Odell at 12:50 P.M. The two mountaineers are never seen alive again.", "June 12 – Rondout Heist: Six men of the Egan's Rats gang rob a mail train in Rondout, Illinois; the robbery is later found to have been an inside job.", "June 13 – In Hungary, a devastating tornado, \"Wildkansas\", strikes, in 3 hours leaving a 500-1500m wide and 70 km long path of destruction from landfall at Bia to its end near Vác, completely destroying the village of Páty. 9 people are killed, 50 injured and many left homeless by one of the strongest tornadoes ever not only in Hungary but in Europe, estimated as F4.", "June 16 – Whampoa Military Academy is founded in China.", "June 23 – American airman Russell Maughan flies from New York to San Francisco in 21 hours and 48 minutes on a dawn-to-dusk flight in a Curtiss pursuit", "June 30 – J. B. M. Hertzog becomes the third Prime Minister of South Africa."]}, {"Month No.": "7", "Month-Day(s)-Events": ["July 9 – John W. Davis of West Virginia is nominated by the Democrats to oppose Calvin Coolidge in the presidential election.", "July 10 – Paavo Nurmi wins the 1,500 and 5,000 m runs within two hours at the Paris Olympics.", "July 12 – United States occupation of the Dominican Republic (1916–24) comes to an end. The constitutional government headed by General Horacio Vázquez, elected in the elections held in March, is established.", "July 19 – Napalpí massacre: Around 400 indigenous people of Toba ethnicity are massacred in Argentina."]}, {"Month No.": "8", "Month-Day(s)-Events": ["August 16 – The Dawes Plan is signed in Paris, temporarily resolving German reparations dispute.", "August 28 – August Uprising: Georgia rises against rule by the Soviet Union in an abortive rebellion, in which several thousands die."]}, {"Month No.": "9", "Month-Day(s)-Events": ["September 9\nThe Hanapepe massacre occurs on Kauai, Hawaii.\nThe 8-hour work day is introduced in Belgium.", "The Hanapepe massacre occurs on Kauai, Hawaii.", "The 8-hour work day is introduced in Belgium.", "September 9–11 – The Kohat riots break out in India.", "September 28 – U.S. Army pilots John Harding and Erik Nelson complete the first aerial circumnavigation of the globe. It has taken them 175 days and 74 stops before their return to Seattle."]}, {"Month No.": "10", "Month-Day(s)-Events": ["October – The skull of the Taung Child is discovered.", "October 2 – The Geneva Protocol is adopted by the League of Nations Assembly as a means to strengthen the League, but later fails to be ratified.", "October 6 – 1-RO begins regular radio broadcasting services in Italy.", "October 10\nVoting in federal elections becomes compulsory in Australia, after a private member's bill proposed by Tasmanian Nationalist senator Herbert Payne results in the passing of the Commonwealth Electoral (Compulsory Voting) Act 1924.\nThe Alpha Delta Gamma fraternity is founded at the Lake Shore Campus of Loyola University, Chicago.", "Voting in federal elections becomes compulsory in Australia, after a private member's bill proposed by Tasmanian Nationalist senator Herbert Payne results in the passing of the Commonwealth Electoral (Compulsory Voting) Act 1924.", "The Alpha Delta Gamma fraternity is founded at the Lake Shore Campus of Loyola University, Chicago.", "October 12–15 – Zeppelin LZ-126 makes a transatlantic delivery flight from Friedrichshafen, Germany, to Lakehurst, New Jersey.", "October 15 – The first Surrealist Manifesto is published, in which André Breton defines the movement as \"pure psychic automatism\".", "October 18 – Sweden's Prime Minister Ernst Trygger and his cabinet, is replaced by Hjalmar Branting and his third and last government.", "October 19 – Abdul Aziz declares himself protector of holy places in Mecca.", "October 22 – The Toastmasters Club is founded.", "October 24 – English footballer Dixie Dean scores a hat-trick for Tranmere Rovers F.C. to become the youngest ever player to score three goals for The Superwhites.", "October 25\nThe British press publishes the Zinoviev letter, released the previous day by the Foreign Office. This purports to be a directive from Grigory Zinoviev, head of the Communist International in Moscow, to the Communist Party of Great Britain.\nAuthorities of the British Raj in India arrest Subhas Chandra Bose and jail him for the next 21⁄2 years.\nOsaka Metal Industry, predecessor of Daikin, a global air conditioner brand, is founded in Japan.", "The British press publishes the Zinoviev letter, released the previous day by the Foreign Office. This purports to be a directive from Grigory Zinoviev, head of the Communist International in Moscow, to the Communist Party of Great Britain.", "Authorities of the British Raj in India arrest Subhas Chandra Bose and jail him for the next 21⁄2 years.", "Osaka Metal Industry, predecessor of Daikin, a global air conditioner brand, is founded in Japan.", "October 27 – The Uzbek SSR joins the Soviet Union."]}, {"Month No.": "11", "Month-Day(s)-Events": ["November – The last known sighting of a California grizzly bear is recorded, by Colonel John R. White at Sequoia National Park.", "November 4\nNellie Tayloe Ross of Wyoming is elected as the first woman governor in the United States.\n1924 United States presidential election: Republican Calvin Coolidge defeats Democrat John W. Davis and Progressive Robert M. La Follette Sr.", "Nellie Tayloe Ross of Wyoming is elected as the first woman governor in the United States.", "1924 United States presidential election: Republican Calvin Coolidge defeats Democrat John W. Davis and Progressive Robert M. La Follette Sr.", "November 10 – The Trial of the 149 begins in Estonia, eventually resulting in the conviction of 129 communists, including several members of the Riigikogu.", "November 21 – Ali Fethi Okyar forms a new government in Turkey (3rd government).", "November 26 – The Mongolian People's Republic is proclaimed."]}, {"Month No.": "12", "Month-Day(s)-Events": ["December 1\nThe Soviet-backed communist 1924 Estonian coup d'état attempt fails in Estonia.\nGeorge Gershwin's musical Lady Be Good (book by Guy Bolton and Fred Thompson, lyrics by Ira Gershwin, and including the number \"Fascinating Rhythm\") has its Broadway premiere in New York City.", "The Soviet-backed communist 1924 Estonian coup d'état attempt fails in Estonia.", "George Gershwin's musical Lady Be Good (book by Guy Bolton and Fred Thompson, lyrics by Ira Gershwin, and including the number \"Fascinating Rhythm\") has its Broadway premiere in New York City.", "December 19 – German serial killer Fritz Haarmann is sentenced to death for the murder and dismemberment of at least 24 young males in Hanover.", "December 20 – In Germany, Adolf Hitler is released from Landsberg Prison after serving nine months for his crucial role in the Beer Hall Putsch of 1923.", "December 24\n1924 Imperial Airways de Havilland DH.34 crash: An airliner crashes soon after takeoff from London's Croydon Airport killing all eight people aboard. This leads to the first public inquiry into a civil aviation accident ever held in the United Kingdom.\nAlbania becomes a republic.\nBabbs Switch fire: A flash fire at a Christmas celebration in a one-room schoolhouse in Babbs, Oklahoma, United States, kills 36 people, mostly small children.", "1924 Imperial Airways de Havilland DH.34 crash: An airliner crashes soon after takeoff from London's Croydon Airport killing all eight people aboard. This leads to the first public inquiry into a civil aviation accident ever held in the United Kingdom.", "Albania becomes a republic.", "Babbs Switch fire: A flash fire at a Christmas celebration in a one-room schoolhouse in Babbs, Oklahoma, United States, kills 36 people, mostly small children.", "December 30 – American astronomer Edwin Hubble announces that Andromeda, previously believed to be a nebula, is actually another galaxy, and that the Milky Way is only one of many such galaxies in the universe."]}, {"Month No.": "13", "Month-Day(s)-Events": ["Spring – Francophone explorer, spiritualist and former operatic soprano Alexandra David-Néel, disguised as a male pilgrim, makes a 2-month stay in the forbidden city of Lhasa, Tibet.", "Autumn – In the United States, the final raid of the Renegade period of the Apache Wars takes place, bringing the American Indian Wars to a close, after 315 years.", "The International Union of Official Organizations for Tourist Propaganda is established.", "Earl W. Bascom, rodeo cowboy and artist, designs and makes rodeo's first one-hand bareback rigging at Stirling, Alberta, Canada.", "Alice Vanderbilt Morris, a wealthy heiress, founds the International Auxiliary Language Association in New York."]}]