[{"Month No.": "1", "Month-Day(s)-Events": ["January 6\n6 January Dictatorship: King Alexander of the Serbs, Croats, and Slovenes suspends his country's constitution.\nAlbanian missionary sister Agnes Gonxha Bojaxhiu, later known as Mother Teresa, arrives in Calcutta from Ireland to begin her work in India.", "6 January Dictatorship: King Alexander of the Serbs, Croats, and Slovenes suspends his country's constitution.", "Albanian missionary sister Agnes Gonxha Bojaxhiu, later known as Mother Teresa, arrives in Calcutta from Ireland to begin her work in India.", "January 10 – The first appearance of Hergé's Belgian comic book hero Tintin, as Tintin in the Land of the Soviets (Les Aventures de Tintin, reporter..., au pays des Soviets), begins serialization in the children's newspaper supplement, Le Petit Vingtième.", "January 17 – The comic strip hero Popeye first appears in Thimble Theatre.", "January 17 – Kabul falls to Habibullāh Kalakāni's forces, beginning a 9-month period of Saqqawist rule in Afghanistan while the Afghan Civil War continues.", "January 29 – All Quiet on the Western Front (Im Westen nichts Neues), by Erich Maria Remarque, is published in book form."]}, {"Month No.": "2", "Month-Day(s)-Events": ["February 9 – \"Litvinov's Pact\" is signed in Moscow by the Soviet Union, Poland, Estonia, Romania and Latvia, who agree not to use force to settle disputes between themselves.", "February 11 – The Kingdom of Italy and the Holy See of the Catholic Church sign the Lateran Treaty, to establish the Vatican City as an independent sovereign enclave within Rome, resolving the \"Roman Question\".", "February 14 – \"Saint Valentine's Day Massacre\": Five gangsters (rivals of Al Capone), plus a civilian, are shot dead in Chicago.", "February 21 – In the first battle of the Warlord Rebellion in northeastern Shandong against the Nationalist government of China, a 24,000-strong rebel force led by Zhang Zongchang is defeated at Zhifu by 7,000 NRA troops.", "February 26 – Grand Teton National Park is established by the United States Congress."]}, {"Month No.": "3", "Month-Day(s)-Events": ["March 2 – The longest bridge in the world at this time, the San Francisco Bay Toll-Bridge, opens.", "March 3 – A revolt by Generals José Gonzalo Escobar and Jesús María Aguirre fails in Mexico.", "March 4\nHerbert Hoover is sworn in, as the 31st president of the United States.\nThe National Revolutionary Party (Partido Nacional Revolucionario) is established in Mexico, by ex-President Plutarco Elías Calles. Under a succession of names, it will hold power in the country continuously for the next 71 years.", "Herbert Hoover is sworn in, as the 31st president of the United States.", "The National Revolutionary Party (Partido Nacional Revolucionario) is established in Mexico, by ex-President Plutarco Elías Calles. Under a succession of names, it will hold power in the country continuously for the next 71 years.", "March 17 – Second of the Davos University Conferences opens in Switzerland; this includes the Cassirer–Heidegger debate in philosophy.", "March 28 – Japanese forces withdraw from Shandong province to their garrison in Tsingtao, bringing an end to the Jinan Incident.", "March 30 – Imperial Airways begins operating the first commercial flights between London and Karachi."]}, {"Month No.": "4", "Month-Day(s)-Events": ["April 3 – Persia signs the Litvinov Protocol."]}, {"Month No.": "5", "Month-Day(s)-Events": ["May 1 – The 7.2 Mw Kopet Dag earthquake shakes the Iran-Turkmenistan border region, with a maximum Mercalli intensity of IX (Violent), killing up to 3,800 and injuring 1,121.", "May 7 – \"The Battle Of Blood Alley\" is fought by a razor gang in Sydney, Australia.", "May 16 – The 1st Academy Awards are presented in a 15-minute ceremony at the Hollywood Roosevelt Hotel, honoring the best movies of 1927 and 1928, Wings (1927) winning Best Picture. Gerald Duffy (died 1928) receives the only Academy Award for Best Title Writing ever awarded (for his intertitles to the silent film The Private Life of Helen of Troy (1927)).", "May 31 – The United Kingdom general election again returns a hung parliament; the Liberals in Parliament determine which party will govern."]}, {"Month No.": "6", "Month-Day(s)-Events": ["June 1 – The 1st Conference of the Communist Parties of Latin America is held in Buenos Aires.", "June 3 – The Treaty of Lima settles a border dispute between Peru and Chile.", "June 7 – The Lateran Treaty, making Vatican City a sovereign state, is ratified.", "June 8 – Ramsay MacDonald forms the United Kingdom's second Labour government.", "June 21 – An agreement brokered by U.S. Ambassador Dwight Whitney Morrow helps end the Cristero War in Mexico.", "June 27 – The first public demonstration of color TV is held, by H. E. Ives and his colleagues at Bell Telephone Laboratories in New York. The first images are a bouquet of roses and an American flag. A mechanical system is used to transmit 50-line color television images between New York and Washington."]}, {"Month No.": "7", "Month-Day(s)-Events": ["July 24\nThe Kellogg–Briand Pact, renouncing war as an instrument of foreign policy, goes into effect (it was first signed in Paris on August 27, 1928, by most leading world powers).\nUnion Airways Pty. Ltd. is founded, to be nationalised as South African Airways, on 1 February 1934.", "The Kellogg–Briand Pact, renouncing war as an instrument of foreign policy, goes into effect (it was first signed in Paris on August 27, 1928, by most leading world powers).", "Union Airways Pty. Ltd. is founded, to be nationalised as South African Airways, on 1 February 1934.", "July 25 – Pope Pius XI emerges from the Apostolic Palace, and enters St. Peter's Square in a huge procession witnessed by about 250,000 persons, thus ending nearly 60 years of self-imposed status by the papacy as Prisoner in the Vatican.", "July 27\nThe Geneva Convention addresses the treatment of prisoners of war.\nThe Red Crescent is adopted as an additional emblem of the League of Red Cross Societies.", "The Geneva Convention addresses the treatment of prisoners of war.", "The Red Crescent is adopted as an additional emblem of the League of Red Cross Societies.", "July 29 - the French prime minister Raymond Poincaré resigns, and is succeeded by Aristide Briand."]}, {"Month No.": "8", "Month-Day(s)-Events": ["August 8–29 – German rigid airship LZ 127 Graf Zeppelin makes a circumnavigation of the Northern Hemisphere eastabout out of Lakehurst, New Jersey, including the first nonstop flight of any kind across the Pacific Ocean (Tokyo–Los Angeles).", "August 16 – The 1929 Palestine riots break out between Palestinians and Jews in Mandatory Palestine, and continue until the end of the month. In total, 133 Jews and 116 Palestinians are killed.", "August 20 – John Logie Baird's experimental 30-line television system is first transmitted, by the British Broadcasting Corporation.", "August 23–24 – The 1929 Hebron massacre: 65–68 Jews are killed by Palestinians and the remaining Jews are forced to leave Hebron.", "August 29\nThe 1929 Safed massacre: 18–20 Jews are killed in Safed by Palestinian Arabs.\nThe SS San Juan collides with the oil tanker S.C.T. Dodd off the California coast, causing the San Juan to sink in 3 minutes, killing 77 people.", "The 1929 Safed massacre: 18–20 Jews are killed in Safed by Palestinian Arabs.", "The SS San Juan collides with the oil tanker S.C.T. Dodd off the California coast, causing the San Juan to sink in 3 minutes, killing 77 people.", "August 31 – The Young Plan, which sets the total World War I reparations owed by Germany at US$26,350,000,000 to be paid over a period of 58½ years, is finalized."]}, {"Month No.": "9", "Month-Day(s)-Events": ["September 3 – The Dow Jones Industrial Average peaks at 381.17, a height it would not reach again until November 1954.", "September 5 – Aristide Briand presents his plan for the United States of Europe.", "September 7 – The steamship SS Kuru sank in Lake Näsijärvi near Tampere, Finland, leading to 138 people drowning.", "September 17 – A coup ousts Augustinas Voldemaras from his Prime Minister position in Lithuania; he is replaced by the brother-in-law of President Antanas Smetona, Juozas Tūbelis.", "September 30 – Fritz von Opel pilots the first rocket-powered aircraft, the Opel RAK.1, in front of a large crowd in Frankfurt am Main."]}, {"Month No.": "10", "Month-Day(s)-Events": ["October 3 – The country officially known as the Kingdom of Serbs, Croats and Slovenes changes its name to Kingdom of Yugoslavia.", "October 6 – Serie A, the top-class professional football league of Italy, replaces the Divisione Nazionale.", "October 12 – 1929 Australian federal election: The Labor Party, led by James Scullin, defeats the Nationalist/Country Coalition Government, led by Prime Minister Stanley Bruce. Scullin will be sworn in on October 22. Notably, this is the first occasion in Australian political history where a sitting Prime Minister loses his own seat (the second being John Howard in 2007).", "October 13 – Afghan Civil War ends.", "October 18 – On appeal from the Supreme Court of Canada  on behalf of \"The Famous Five\" Canadian women in the landmark case of Edwards v. Canada (Attorney General), the Judicial Committee of the Privy Council in the United Kingdom announces that women are \"persons\" under the British North America Acts, and thus eligible for appointment to the Senate of Canada.", "October 22 – The government of Aristide Briand falls in France.", "October 24–29 – Wall Street Crash of 1929: Three multi-digit percentage drops wipe out more than $30 billion from the New York Stock Exchange (10 times greater than the annual budget of the federal government).", "October 25 – Former U.S. Interior Secretary Albert B. Fall is convicted of bribery for his role in the Teapot Dome scandal, becoming the first Presidential cabinet member to go to prison for actions in office."]}, {"Month No.": "11", "Month-Day(s)-Events": ["November – Vladimir Zworykin takes out the first patent for color television.", "November 1\nAn annual solar eclipse is seen over the Atlantic Ocean and Africa.\nConscription in Australia ends.", "An annual solar eclipse is seen over the Atlantic Ocean and Africa.", "Conscription in Australia ends.", "November 7 – In New York City, the Museum of Modern Art (MoMA) opens to the public. The first exhibition Cézanne, Gauguin, van Gogh and Seurat (November 7 – December 7) is seen by 47.000 visitors; the curator is Alfred H. Barr.", "November 15 – Atlantic, a film about the sinking of the RMS Titanic, is released in the U.K., the first British sound-on-film movie and, in its simultaneously-shot German-language version, the first to be released in Germany.", "November 18 – The 1929 Grand Banks earthquake occurs.", "November 29 – Bernt Balchen, U.S. Admiral Richard Byrd, Captain Ashley McKinley and Harold June become the first to fly over the South Pole."]}, {"Month No.": "12", "Month-Day(s)-Events": ["December – New York toy salesman Edwin S. Lowe popularizes Bingo after coming across the game of \"Beano\" in Atlanta, Georgia. After someone accidentally yells \"bingo\" instead of \"beano\" with a group of friends in Brooklyn, New York, he begins production of the game, going on to develop more than 6,000 card combinations under the E. S. Lowe company, as the popularity of the game grows to become a national pastime.", "December 27 – Soviet General Secretary Joseph Stalin orders the \"liquidation of the kulaks as a class\".", "December 28 – \"Black Saturday\" in Samoa: New Zealand colonial police kill 11 unarmed demonstrators, an event which leads the Mau movement to demand independence for Samoa.", "December 29 – The All India Congress in Lahore demands Indian independence."]}, {"Month No.": "13", "Month-Day(s)-Events": ["January 1\nHaruo Nakajima, Japanese actor (d. 2017)\nLatif-ur-Rehman, Indian field hockey player (d. 1987)", "Haruo Nakajima, Japanese actor (d. 2017)", "Latif-ur-Rehman, Indian field hockey player (d. 1987)", "January 2 – Tellervo Koivisto, Finnish politician and First Lady of Finland", "January 3\nSergio Leone, Italian director (d. 1989)\nGordon Moore, American computing entrepreneur", "Sergio Leone, Italian director (d. 1989)", "Gordon Moore, American computing entrepreneur", "January 4 – Günter Schabowski, official of the Socialist Unity Party of Germany (d. 2015)", "January 5 – Alexandre Jany, French swimmer and water polo player (d. 2001)", "January 7 – Terry Moore, American actress", "January 8 – Saeed Jaffrey, Indian-born actor (d. 2015)", "January 9 – Brian Friel, Irish dramatist (d. 2015)", "January 11\nNureddin al-Atassi, Syrian philatelist, 54th Prime Minister of Syria and 17th President of Syria (d. 1992)\nWanda Wiłkomirska, Polish violinist and teacher (d. 2018)", "Nureddin al-Atassi, Syrian philatelist, 54th Prime Minister of Syria and 17th President of Syria (d. 1992)", "Wanda Wiłkomirska, Polish violinist and teacher (d. 2018)", "January 12\nIrena Homola-Skąpska, Polish historian (d. 2017)\nAlasdair MacIntyre, Scottish philosopher\nJaakko Hintikka, Finnish philosopher, logician (d. 2015)", "Irena Homola-Skąpska, Polish historian (d. 2017)", "Alasdair MacIntyre, Scottish philosopher", "Jaakko Hintikka, Finnish philosopher, logician (d. 2015)", "January 15 – Martin Luther King Jr., African-American civil rights leader, Nobel laureate (d. 1968)", "January 17\nTan Boon Teik, Attorney-General of Singapore (d. 2012)\nJacques Plante, Canadian hockey player (d. 1986)", "Tan Boon Teik, Attorney-General of Singapore (d. 2012)", "Jacques Plante, Canadian hockey player (d. 1986)", "January 19\nEdmundo Abaya, Filipino Catholic archbishop (d. 2018)\nCarl-Ebbe Andersen, Danish rower (d. 2009)", "Edmundo Abaya, Filipino Catholic archbishop (d. 2018)", "Carl-Ebbe Andersen, Danish rower (d. 2009)", "January 20\nJimmy Cobb, American jazz drummer (d. 2020)\nMasaharu Kawakatsu, Japanese zoologist", "Jimmy Cobb, American jazz drummer (d. 2020)", "Masaharu Kawakatsu, Japanese zoologist", "January 23\nPatriarch Filaret, former Patriarch of the Ukrainian Orthodox Church – Kiev Patriarchate\nJohn Charles Polanyi, Canadian chemist, Nobel laureate", "Patriarch Filaret, former Patriarch of the Ukrainian Orthodox Church – Kiev Patriarchate", "John Charles Polanyi, Canadian chemist, Nobel laureate", "January 25 – Benny Golson, American jazz musician", "January 26\nJules Feiffer, American cartoonist and author\nSumiteru Taniguchi, Japanese anti-nuclear weapons activist (d. 2017)", "Jules Feiffer, American cartoonist and author", "Sumiteru Taniguchi, Japanese anti-nuclear weapons activist (d. 2017)", "January 27\nMohamed Al-Fayed, Egyptian business magnate\nHans Berliner, American chess player, writer and professor (d. 2017)\nBarbara York Main, Australian arachnologist and adjunct professor (d. 2019)\nRichard Ottinger, American politician", "Mohamed Al-Fayed, Egyptian business magnate", "Hans Berliner, American chess player, writer and professor (d. 2017)", "Barbara York Main, Australian arachnologist and adjunct professor (d. 2019)", "Richard Ottinger, American politician", "January 28\nAcker Bilk, English jazz clarinetist (d. 2014)\nEdith M. Flanigen, American chemist\nAli Mirzaei, Iranian weightlifter (d. 2020)\nClaes Oldenburg, Swedish-born American sculptor (Clothespin) (d. 2022)", "Acker Bilk, English jazz clarinetist (d. 2014)", "Edith M. Flanigen, American chemist", "Ali Mirzaei, Iranian weightlifter (d. 2020)", "Claes Oldenburg, Swedish-born American sculptor (Clothespin) (d. 2022)", "January 30\nIsamu Akasaki, Japanese physicist and Nobel laureate (d. 2021)\nJacqueline van Maarsen, Dutch writer", "Isamu Akasaki, Japanese physicist and Nobel laureate (d. 2021)", "Jacqueline van Maarsen, Dutch writer", "January 31\nRudolf Mössbauer, German physicist and Nobel laureate (d. 2011)\nJean Simmons, English-American actress (d. 2010)", "Rudolf Mössbauer, German physicist and Nobel laureate (d. 2011)", "Jean Simmons, English-American actress (d. 2010)"]}]