[{"Month No.": "1", "Month-Day(s)-Events": ["January 15 – The Moon moves into its nearest point to Earth, called perigee, at the same time as its fullest phase of the Lunar Cycle. This is the closest moon distance at 356,397 km (221,455 mi) in recent history, and the next one will be on January 1, 2257, at 356,371 km (221,439 mi).", "January 26 – The Indian National Congress declares this date as Independence Day, or as the day for Poorna Swaraj (Complete Independence).", "January 28 – The first patent for a field-effect transistor is granted in the United States, to Julius Edgar Lilienfeld.", "January 30 – Pavel Molchanov launches a radiosonde from Slutsk in the Soviet Union."]}, {"Month No.": "2", "Month-Day(s)-Events": ["February 10 – The Việt Nam Quốc Dân Đảng launch the Yên Bái mutiny in the hope of ending French colonial rule in Vietnam.", "February 18 – While studying photographs taken in January, Clyde Tombaugh confirms the existence of Pluto, a celestial body considered a planet until redefined as a dwarf planet in 2006."]}, {"Month No.": "3", "Month-Day(s)-Events": ["March 2\nMahatma Gandhi informs the British Viceroy of India that civil disobedience will begin the following week.\nAndré Tardieu begins his second term as Prime Minister of France.", "Mahatma Gandhi informs the British Viceroy of India that civil disobedience will begin the following week.", "André Tardieu begins his second term as Prime Minister of France.", "March 6\nInternational Unemployment Day is observed in countries throughout the world.\nThe first frozen foods of Clarence Birdseye go on sale in Springfield, Massachusetts.", "International Unemployment Day is observed in countries throughout the world.", "The first frozen foods of Clarence Birdseye go on sale in Springfield, Massachusetts.", "March 12 – Mahatma Gandhi sets off on a 200-mile protest march towards the sea with 78 followers, to protest against the British monopoly on salt; more will join them during the Salt March that ends on April 5.", "March 28 – The government of Turkey requests the international community to adopt Istanbul and Ankara, as the official names for Constantinople and Angora. The U.S. State Department adopts the \"Istanbul\" form in May.", "March 29 – Heinrich Brüning is appointed Chancellor of Germany.", "March 31 – The Motion Picture Production Code (\"Hays Code\") is instituted in the United States, imposing strict guidelines on the treatment of sex, crime, religion and violence in films for the next 40 years."]}, {"Month No.": "4", "Month-Day(s)-Events": ["April 6\nIn an act of civil disobedience, Mahatma Gandhi breaks the salt laws of British India by making salt by the sea at the end of the Salt March.\nThe International Left Opposition (ILO) is founded in Paris, France.", "In an act of civil disobedience, Mahatma Gandhi breaks the salt laws of British India by making salt by the sea at the end of the Salt March.", "The International Left Opposition (ILO) is founded in Paris, France.", "April 17 – Neoprene is invented by DuPont.", "April 18\nThe Chittagong Rebellion begins in India, with the Chittagong armoury raid.\nBBC Radio from London uniquely reports \"Good evening. Today is Good Friday. There is no news.\"", "The Chittagong Rebellion begins in India, with the Chittagong armoury raid.", "BBC Radio from London uniquely reports \"Good evening. Today is Good Friday. There is no news.\"", "April 21\nA fire in the Ohio Penitentiary in Columbus, United States kills 320 people.\nThe Turkestan–Siberia Railway is completed.", "A fire in the Ohio Penitentiary in Columbus, United States kills 320 people.", "The Turkestan–Siberia Railway is completed.", "April 22 – The United Kingdom, Japan and the United States sign the London Naval Treaty to regulate submarine warfare and limit naval shipbuilding."]}, {"Month No.": "5", "Month-Day(s)-Events": ["May 5 – Mahatma Gandhi is re-arrested.", "May 6 – The 7.1 Mw  Salmas earthquake shakes northwestern Iran and southeastern Turkey, with a maximum Mercalli intensity of IX (Violent); up to 3,000 people are killed.", "May 10 – The National Pan-Hellenic Council is founded in Washington, D.C.", "May 15 – Nurse Ellen Church becomes the world's first flight attendant, working on a Boeing Air Transport trimotor.", "May 16 – Rafael Leónidas Trujillo is elected president of the Dominican Republic.", "May 17 – French Prime Minister André Tardieu decides to withdraw the remaining French troops from the Rhineland (they depart by June 30).", "May 24 – Amy Johnson lands in Darwin, Australia, becoming the first woman to fly solo from England to Australia (she left on May 5 for the 11,000 mile flight).", "May 30 – Canadian adventurer William \"Red\" Hill, Sr. makes a five-hour journey, down the Niagara Gorge rapids."]}, {"Month No.": "6", "Month-Day(s)-Events": ["June 7 – Carl Gustaf Ekman becomes Prime Minister of Sweden, for the second and final time.", "June 14 – The Bureau of Narcotics is established under the United States Department of the Treasury, replacing the Narcotics Division of the Prohibition Unit.", "June 17 – President Herbert Hoover signs the Smoot–Hawley Tariff Act into law, implementing protectionist trade policies in the United States."]}, {"Month No.": "7", "Month-Day(s)-Events": ["July 4 – The dedication of George Washington's sculpted head is held at Mount Rushmore, South Dakota.", "July 5 – The Seventh Lambeth Conference of Anglican bishops opens. This conference approves the use of birth control in limited circumstances, a move away from the Christian views on contraception expressed by the Sixth Conference a decade earlier.", "July 7\nThe Lapua Movement marches in Helsinki, Finland.\nBuilding of the Boulder Dam (later known as the Hoover Dam) is started on the Colorado River, in the United States.", "The Lapua Movement marches in Helsinki, Finland.", "Building of the Boulder Dam (later known as the Hoover Dam) is started on the Colorado River, in the United States.", "July 11 – Australian cricketer Donald Bradman scores a world record 309 runs in one day, on his way to the highest individual Test innings of 334, during a Test match against England.", "July 13 – The first FIFA World Cup starts: Lucien Laurent scores the first goal, for France against Mexico.", "July 19 – Georges Simenon's detective character Inspector Jules Maigret makes his first appearance in print under Simenon's own name, when the novel Pietr-le-Letton (known in English as The Strange Case of Peter the Lett) begins serialization in a French weekly magazine. Simenon will eventually write 75 novels (as well as 28 short stories) featuring the pipe-smoking Paris detective.", "July 25 – Laurence Olivier marries actress Jill Esmond.", "July 28 – R. B. Bennett defeats William Lyon Mackenzie King in federal elections, and becomes the Prime Minister of Canada.", "July 29 – British airship R100 sets out for a successful 78-hour passage to Canada.", "July 30\nUruguay beats Argentina 4–2, to win the first Association football FIFA World Cup final at Estadio Centenario, in Montevideo.\nNew York station W2XBS is put in charge of NBC broadcast engineers.", "Uruguay beats Argentina 4–2, to win the first Association football FIFA World Cup final at Estadio Centenario, in Montevideo.", "New York station W2XBS is put in charge of NBC broadcast engineers.", "July 31 – The radio drama The Shadow airs for the first time in the United States.", "July – The First Eastern Women's Congress takes place in Damascus in Syria."]}, {"Month No.": "8", "Month-Day(s)-Events": ["August – The volcanic island of Anak Krakatau begins to form permanently in the Sunda Strait.", "August 7 – R. B. Bennett takes office as the eleventh Prime Minister of Canada.", "August 12 – Turkish troops move into Persia, to fight Kurdish insurgents.", "August 16 – The first British Empire Games open in Hamilton, Ontario, Canada.", "August 27 – A military junta takes over in Peru."]}, {"Month No.": "9", "Month-Day(s)-Events": ["September 3 – A huge hurricane in the Caribbean demolishes most of the city of Santo Domingo, in the Dominican Republic.", "September 6 – 1930 Argentine coup d'état: José Félix Uriburu carries out a military coup, overthrowing Hipólito Yrigoyen, President of Argentina.", "September 8 – Scotch Tape, invented by Richard Gurley Drew, is sold by the 3M company in the United States for the first time.", "September 12 – England cricketer Wilfred Rhodes plays the final match in his international career, by taking 5 for 95 for H. D. G. Leveson Gower's XI, against the Australians. At the age of 52, he also becomes the oldest man to play in a Test match.", "September 14 – German federal election, 1930: National Socialists win 107 seats in the German Parliament, the Reichstag (18.3% of all the votes), making them the second largest party.", "September 17 – The Kurdish Ararat rebellion is suppressed by the Turks.", "September 20 – The Eastern Catholic Rite Syro-Malankara Catholic Church is formed.", "September 27 – İsmet İnönü forms a new government in Turkey (6th government)."]}, {"Month No.": "10", "Month-Day(s)-Events": ["October – The Indochinese Communist Party is formed.", "October 1 – British rule of Weihaiwei ends, as it is returned to China.", "October 3 – The German Socialist Labour Party in Poland – Left is founded, following a split in the DSAP in Łódź.", "October 5 – British airship R101 crashes in France en route to India, on its maiden long-range flight, resulting in the loss of 48 lives.", "October 14 – Ståhlberg kidnapping: The former and first President of Finland, K. J. Ståhlberg, and his wife, Ester Ståhlberg, are kidnapped from their home by members of the far-right Lapua Movement.", "October 20 – A British White Paper demands restrictions on Jewish immigration into Mandatory Palestine.", "October 24 – Brazilian Revolution of 1930: Getúlio Vargas overthrows Washington Luís.", "October 27 – Ratifications are exchanged in London on the first London Naval Treaty signed in April, modifying the Washington Naval Treaty of 1925. Its arms limitation provisions go into effect immediately, hence putting more limits on the expensive naval arms race between its five signatories (the United Kingdom, the United States, the Japanese Empire, France, and Italy.)"]}, {"Month No.": "11", "Month-Day(s)-Events": ["November 2 – Haile Selassie is crowned emperor of Ethiopia.", "November 3 – Getúlio Vargas becomes president of Brazil.", "November 25\nAn earthquake in the Izu Peninsula of Japan kills 223 people, and destroys 650 buildings.\nCecil George Paine, a pathologist at the Sheffield Royal Infirmary in England, achieves the first recorded cure (of an eye infection) using penicillin.", "An earthquake in the Izu Peninsula of Japan kills 223 people, and destroys 650 buildings.", "Cecil George Paine, a pathologist at the Sheffield Royal Infirmary in England, achieves the first recorded cure (of an eye infection) using penicillin."]}, {"Month No.": "12", "Month-Day(s)-Events": ["December – All adult Turkish women are given the right to vote in elections.", "December 19 – Mount Merapi volcano in central Java, Indonesia, erupts, destroying numerous villages and killing 1,300 people.", "December 24 – In London, inventor Harry Grindell Matthews demonstrates his device to project pictures on clouds.", "December 29 – Sir Muhammad Iqbal's presidential address in Allahabad introduces the two-nation theory, outlining a vision for the creation of Pakistan.", "December 31 – The Papal encyclical Casti connubii, issued by Pope Pius XI, stresses the sanctity of marriage, prohibits Roman Catholics from using any form of artificial birth control, and reaffirms the Catholic prohibition on abortion."]}, {"Month No.": "13", "Month-Day(s)-Events": ["Bernhard Schmidt invents the Schmidt camera."]}]