[{"Month No.": "1", "Month-Day(s)-Events": ["January 1 – Anastasio Somoza García becomes President of Nicaragua.", "January 5 – Water levels begin to rise in the Ohio River in the United States, leading to the Ohio River flood of 1937, which continues into February, leaving 1 million people homeless and 385 people dead.", "January 15 – Spanish Civil War: Second Battle of the Corunna Road ends inconclusively.", "January 20 – Second inauguration of Franklin D. Roosevelt: Franklin D. Roosevelt is sworn in for a second term as President of the United States. This is the first time that the United States presidential inauguration occurs on this date; the change is due to the ratification in 1933 of the Twentieth Amendment to the United States Constitution.", "January 23 – Moscow Trials: Trial of the Anti-Soviet Trotskyist Center – In the Soviet Union 17 leading Communists go on trial, accused of participating in a plot led by Leon Trotsky to overthrow Joseph Stalin's regime, and assassinate its leaders."]}, {"Month No.": "2", "Month-Day(s)-Events": ["February 8 – Spanish Civil War: Falangist troops take Málaga.", "February 8 – February 27 – Spanish Civil War – Battle of Jarama: Nationalist and Republican troops fight to a stalemate.", "February 16 – Wallace H. Carothers receives a patent for nylon in the United States.", "February 19\nAirliner VH-UHH (Stinson) goes down over Lamington National Park, bound for Sydney, killing 5 people.\nYekatit 12: During a public ceremony at the Viceregal Palace (the former Imperial residence) in Addis Ababa, Ethiopia, two Eritrean nationalists attempt to kill viceroy Rodolfo Graziani with a number of grenades. Italian security guards fire into the crowd of Ethiopian onlookers. Authorities exact further reprisals, which include indiscriminately slaughtering native Ethiopians over the next 3 days, detaining thousands of Ethiopians at Danan and slaughtering almost 300 monks at the Debre Libanos Monastery.\nThe flag of the Netherlands is officially adopted.", "Airliner VH-UHH (Stinson) goes down over Lamington National Park, bound for Sydney, killing 5 people.", "Yekatit 12: During a public ceremony at the Viceregal Palace (the former Imperial residence) in Addis Ababa, Ethiopia, two Eritrean nationalists attempt to kill viceroy Rodolfo Graziani with a number of grenades. Italian security guards fire into the crowd of Ethiopian onlookers. Authorities exact further reprisals, which include indiscriminately slaughtering native Ethiopians over the next 3 days, detaining thousands of Ethiopians at Danan and slaughtering almost 300 monks at the Debre Libanos Monastery.", "The flag of the Netherlands is officially adopted.", "February 20 – Roberto Ortiz is elected president of Argentina.", "February 21 – The League of Nations Non-Intervention Committee prohibits foreign nationals from fighting in the Spanish Civil War.", "February 25 – Hergé's Tintin adventure The Broken Ear (L'Oreille cassée) concludes serialization in the Belgian weekly newspaper supplement Le Petit Vingtième, and soon afterwards is published as a book in black and white."]}, {"Month No.": "3", "Month-Day(s)-Events": ["March 10 (dated March 14 (Passion Sunday)) – The encyclical Mit brennender Sorge (\"With burning concern\") of Pope Pius XI is published in Germany in the German language. Largely the work of Cardinals von Faulhaber and Pacelli, it condemns breaches of the 1933 Reichskonkordat agreement signed between the Nazi government and the Catholic Church, and criticises Nazism's views on race and other matters incompatible with Catholicism.", "March 18 – New London School explosion: In the worst school disaster in American history in terms of lives lost, the New London School in New London, Texas, suffers a catastrophic natural gas explosion, killing in excess of 295 students and teachers. Mother Frances Hospital opens in Tyler, Texas, a day ahead of schedule, in response to the explosion.", "March 19 – The encyclical Divini Redemptoris of Pope Pius XI, critical of communism, is published.", "March 21 – Ponce massacre: A police squad, acting under orders from Governor of Puerto Rico Blanton Winship, opens fire on peaceful demonstrators protesting at the arrest of Puerto Rican Nationalist Party leader Pedro Albizu Campos, killing 17 people and injuring over 200."]}, {"Month No.": "4", "Month-Day(s)-Events": ["April 1\nAden becomes a British crown colony.\nThe Bombing of Jaén is carried out in Spain, by the Condor Legion of the Nazi German Luftwaffe.", "Aden becomes a British crown colony.", "The Bombing of Jaén is carried out in Spain, by the Condor Legion of the Nazi German Luftwaffe.", "April 9 – The Kamikaze arrives at Croydon Airport in London; it is the first Japanese-built aircraft to fly to Europe.", "April 12 – Frank Whittle ground-tests the world's first jet engine designed to power an aircraft, at Rugby, England.", "April 20 – A fire in an elementary school in Kilingi-Nõmme, Estonia, kills 17 students and injures 50.", "April 26 – Spanish Civil War: The Bombing of Guernica is carried out in Spain, by the Condor Legion of the Nazi German Luftwaffe, in support of the Francoists. Three-quarters of the town is destroyed and hundreds killed."]}, {"Month No.": "5", "Month-Day(s)-Events": ["May 6 – Hindenburg disaster: In the United States, the German airship Hindenburg bursts into flame when mooring to a mast in Lakehurst, New Jersey. Of the 36 passengers and 61 crew on board, 13 passengers and 22 crew die, as well as one member of the ground crew.", "May 7 – Spanish Civil War: The German Condor Legion Fighter Group, equipped with Heinkel He 51 biplanes, arrives in Spain to assist Francisco Franco's forces.", "May 8 – Wydad Athletic Club (WAC)(Arabic: نادي الوداد الرياضي; Berber: Wydad Dar al-Beida; commonly: Wydad al ouma) is established in Casablanca, Morocco; it will be best known for its Casablanca Association football team.", "May 12 – The King George VI and Queen Elizabeth are crowned King and Queen of the United Kingdom and the British Dominions, and Emperor and Empress of India at Westminster Abbey, London.", "May 21\nA Soviet station becomes the first scientific research settlement to operate on the drift ice of the Arctic Ocean.\nAs one of the reprisals for the attempted assassination of Italian viceroy Rodolfo Graziani, a detachment of Italian troops massacres the entire community of Debre Libanos, killing 297 monks and 23 laymen.", "A Soviet station becomes the first scientific research settlement to operate on the drift ice of the Arctic Ocean.", "As one of the reprisals for the attempted assassination of Italian viceroy Rodolfo Graziani, a detachment of Italian troops massacres the entire community of Debre Libanos, killing 297 monks and 23 laymen.", "May 28\nNeville Chamberlain becomes Prime Minister of the United Kingdom, following the retirement of Stanley Baldwin.", "Neville Chamberlain becomes Prime Minister of the United Kingdom, following the retirement of Stanley Baldwin.", "May 30\nSpanish Civil War: Spanish ship Ciudad de Barcelona is torpedoed.\nMemorial Day massacre of 1937: The Chicago Police Department shoot and kill 10 unarmed demonstrators in Chicago.", "Spanish Civil War: Spanish ship Ciudad de Barcelona is torpedoed.", "Memorial Day massacre of 1937: The Chicago Police Department shoot and kill 10 unarmed demonstrators in Chicago."]}, {"Month No.": "6", "Month-Day(s)-Events": ["June – Picasso completes his painting Guernica.", "June – July – The Dáil Éireann debates and passes the new  draft Constitution of Ireland, which is then submitted for public approval by plebiscite.", "June 3 – Wallis Simpson marries the Duke of Windsor, the former Edward VIII, in France.", "June 8\nThe Dáil Éireann passes the Executive Authority (Consequential Provisions) Act, 1937, which abolishes the office of Governor-General of the Irish Free State,  retrospectively dated to December 1936.\nThe first total solar eclipse to exceed 7 minutes of totality, in over 800 years, is visible in the Pacific and Peru.", "The Dáil Éireann passes the Executive Authority (Consequential Provisions) Act, 1937, which abolishes the office of Governor-General of the Irish Free State,  retrospectively dated to December 1936.", "The first total solar eclipse to exceed 7 minutes of totality, in over 800 years, is visible in the Pacific and Peru.", "June 21 – The coalition government of Léon Blum resigns in France."]}, {"Month No.": "7", "Month-Day(s)-Events": ["July 1\nThe Gestapo arrests pastor Martin Niemöller in Germany.\nIn a referendum the people of the Irish Free State accept the new Constitution by 685,105 votes to 527,945.", "The Gestapo arrests pastor Martin Niemöller in Germany.", "In a referendum the people of the Irish Free State accept the new Constitution by 685,105 votes to 527,945.", "July 2 – Amelia Earhart and navigator Fred Noonan disappear after taking off from New Guinea, during Earhart's attempt to become the first woman to fly around the world.", "July 7\nIn the Marco Polo Bridge Incident, Japanese and Chinese forces exchange fire near Beijing, beginning the Second Sino-Japanese War.\nThe Peel Commission proposes partition of the British Mandate of Palestine into separate Arab and Jewish states.", "In the Marco Polo Bridge Incident, Japanese and Chinese forces exchange fire near Beijing, beginning the Second Sino-Japanese War.", "The Peel Commission proposes partition of the British Mandate of Palestine into separate Arab and Jewish states.", "July 9 – 1937 Fox vault fire: The silent film archives of Fox Film Corporation are destroyed", "July 20 – The Geibeltbad Pirna is opened in Dresden, Germany.", "July 21 – Éamon de Valera is elected President of the Executive Council (prime minister) of the Irish Free State, by the Dáil (parliament).", "July 22 – New Deal: The United States Senate votes down President Franklin D. Roosevelt's proposal to add more justices to the Supreme Court of the United States.", "July 25–31 – Sino-Japanese War: Battle of Beiping–Tianjin, a series of actions fought around Beiping and Tianjin, result in Japanese victory.", "July 29 – Tungchow Mutiny: Units of the East Hopei Army mutiny and kill Japanese troops and civilians in Tongzhou.", "July 31 – NKVD Operative Order 00447 \"Об операции по репрессированию бывших кулаков, уголовников и других антисоветских элементов\" (\"The operation for repression of former kulaks, criminals and other anti-Soviet elements\") is approved by the Politburo of the Soviet Union, initially as a 4-month plan for 75,950 people to be executed and an additional 193,000 to be sent to the Gulag."]}, {"Month No.": "8", "Month-Day(s)-Events": ["August 2 – The Marijuana Tax Act in the United States is a significant bill on the path that will lead to the criminalization of cannabis. It was introduced to the U.S. Congress by Commissioner of the Federal Bureau of Narcotics, Harry Anslinger.", "August 5 – The Soviet Union commences one of the largest campaigns of the Great Purge, to \"eliminate anti-Soviet elements\". Within the following year, at least 724,000 people are killed on order of the troikas, directed by Joseph Stalin. This is an offensive that targets social classes (such as the kulaks), ethnic or racial backgrounds which are seen as non-Russian, and Stalin's personal opponents from the Communist Party and their sympathizers.", "August 6 – Spanish Civil War: Falangist artillery bombards Madrid.", "August 8 – Japan occupies Beijing.", "August 9 – The Polish Operation of the NKVD (1937–38) is signed by Nikolai Yezhov, as a continuation of the Great Purge.", "August 13 – Second Sino-Japanese War: The Battle of Shanghai opens.", "August 26 – Second Sino-Japanese War: Japanese aircraft attack the car carrying the ambassador of Great Britain, during a raid on Shanghai."]}, {"Month No.": "9", "Month-Day(s)-Events": ["September 2 – The Great Hong Kong Typhoon kills an estimated 11,000 persons.", "September 5 – Spanish Civil War: The city of Llanes falls to the Falangists.", "September 7 – CBS broadcasts a two-and-a-half hour memorial concert nationwide on radio in memory of George Gershwin, live from the Hollywood Bowl. Many celebrities appear, including Oscar Levant, Fred Astaire, Otto Klemperer, Lily Pons and members of the original cast of Porgy and Bess. The concert is recorded and released complete years later in what is excellent sound for its time, on CD. The Los Angeles Philharmonic is the featured orchestra.", "September 10 – Nine nations meet in the Nyon Conference, led by the United Kingdom and France, to address international piracy in the Mediterranean.", "September 17 – Abraham Lincoln's head is dedicated at Mount Rushmore.", "September 19 – Swiss professional ice hockey club HC Ambrì-Piotta is founded.", "September 21 – George Allen & Unwin, Ltd. of London publishes the first edition of J. R. R. Tolkien's The Hobbit.", "September 25 – Second Sino-Japanese War - Battle of Pingxingguan: The Communist Chinese Eighth Route Army defeats the Japanese.", "September 27 – The last Bali tiger dies.", "September 30 – Austrian born actress of Jewish descent, Hedy Lamarr arrives in New York City to flee from her possessive husband Friedrich Mandl who made arms agreements with the Nazis, and to begin her Hollywood career."]}, {"Month No.": "10", "Month-Day(s)-Events": ["October 1\nThe Marihuana Tax Act becomes law in the United States.", "The Marihuana Tax Act becomes law in the United States.", "October 2–8 – Parsley Massacre: Under the orders of President Rafael Trujillo, Dominican troops kill thousands of Haitians living in the Dominican Republic.", "October 3 – Second Sino-Japanese War: Japanese troops advance toward Nanking, capital of the Republic of China.", "October 5 – Roosevelt gives his famous Quarantine Speech in Chicago.", "October 9 – Jimmie Angel lands his plane on top of Devil's Mountain; however, the plane gets damaged, and he has to trek through the rainforest for help.", "October 11 – Duke and Duchess of Windsor's 1937 tour of Germany: The Duke and Duchess of Windsor arrive in Berlin to begin a 12-day tour of Nazi Germany, meeting Adolf Hitler on the 22nd.", "October 13 – Germany, in a note to Brussels, guarantees the inviolability and integrity of Belgium, so long as the latter abstains from military action against Germany.", "October 15 – Ernest Hemingway's novel To Have and Have Not is first published, in the United States.", "October 18–October 21 – Spanish Civil War: The whole Spanish northern seaboard falls into the Falangists' hands; Republican forces in Gijón, Spain, set fire to petrol reserves, prior to retreating before the advancing Falangists.", "October 23 – 1937 Australian federal election: Joseph Lyons' UAP/Country Coalition Government is re-elected with a slightly increased majority, defeating the Labor Party led by John Curtin.", "October 25 – Celâl Bayar forms the new (ninth) government of Turkey."]}, {"Month No.": "11", "Month-Day(s)-Events": ["November 5 – World War II: In the Reich Chancellery, Adolf Hitler holds a secret meeting and states his plans for acquiring \"living space\" for the German people (recorded in the Hossbach Memorandum).", "November 6 – Italy joins the Anti-Comintern Pact.", "November 9 – Second Sino-Japanese War: Japanese troops take Shanghai.", "November 10 – Brazilian president Getúlio Vargas announces the Estado Novo (\"New State\"), thence becoming dictator of Brazil until 1945.", "November 11 – The Kogushi Sulfur Mine collapse, in western Gunma, Japan, kills at least 245 people."]}, {"Month No.": "12", "Month-Day(s)-Events": ["December 1 – Second Sino-Japanese War: The Battle of Nanking begins.", "December 4 – The Dandy comic is first published in Scotland; it continued until 2012 as a physical publication, then online until 2013.", "December 11 – Italy withdraws from the League of Nations.", "December 12\nUSS Panay incident: Japanese bombers sink the American gunboat USS Panay.\nMae West makes a risqué guest appearance on NBC's Chase and Sanborn Hour, which eventually results in her being banned from radio.", "USS Panay incident: Japanese bombers sink the American gunboat USS Panay.", "Mae West makes a risqué guest appearance on NBC's Chase and Sanborn Hour, which eventually results in her being banned from radio.", "December 13 – Second Sino-Japanese War: The Battle of Nanking ends with the Japanese occupying the city. In the Nanking Massacre which follows, Japanese soldiers kill over 300,000 Chinese in 3 months. A few days previously, the Nationalist government of China had moved its capital to the southwestern city Chungking (Chongqing).", "December 16 – The original production of the musical Me and My Girl opens at the Victoria Palace Theatre, in London's West End. A later revival will win an award.", "December 21 – Walt Disney's Snow White and the Seven Dwarfs, the world's first feature-length animated film, premieres at the Carthay Circle Theatre in Los Angeles.", "December 25 – At the age of 70, conductor Arturo Toscanini conducts the NBC Symphony Orchestra on radio for the first time, beginning his successful 17-year tenure with that orchestra. This first concert consists of music by Vivaldi (at a time when he is seldom played), Mozart, and Brahms. Millions tune in to listen, including U.S. President Franklin Delano Roosevelt.", "December 29 – The new Constitution of Ireland (Bunreacht na hÉireann) comes into force. The Irish Free State becomes \"Ireland\", and Éamon de Valera becomes the first Taoiseach (prime minister) of the new state. A Presidential Commission (made up the Chief Justice, the Speaker of Dáil Éireann, and the President of the High Court) assumes the powers of the new presidency, pending the popular election of the first President of Ireland in June 1938. The new constitution prohibits divorce."]}, {"Month No.": "13", "Month-Day(s)-Events": ["Switzerland begins construction of its Border Line defences.", "The Vibora Luviminda sugar plantation trade unions strike on Maui island, Hawaii.", "Italian psychiatrist Amarro Fiamberti is the first to document a transorbital approach to the brain, which becomes the basis for the controversial medical procedure of transorbital lobotomy.", "Soviet industry produces about four times as much as it had in 1928.", "The Allen Organ Company, builder of church, home and theatre organs, is founded in Macungie, Pennsylvania."]}]