[{"Month No.": "1", "Month-Day(s)-Events": ["January 26 – Black Saturday in Egypt: Rioters burn Cairo's central business district, targeting British and upper-class Egyptian businesses.", "February 6\nPrincess Elizabeth, Duchess of Edinburgh, becomes monarch of the United Kingdom of Great Britain and Northern Ireland and the British Dominions: Canada, Australia, New Zealand, South Africa, Pakistan and Ceylon. The princess, who is on a visit to Kenya when she hears of the death of her father, King George VI, aged 56, takes the regnal name Elizabeth II.\nIn the United States, a mechanical heart is used for the first time in a human patient.", "Princess Elizabeth, Duchess of Edinburgh, becomes monarch of the United Kingdom of Great Britain and Northern Ireland and the British Dominions: Canada, Australia, New Zealand, South Africa, Pakistan and Ceylon. The princess, who is on a visit to Kenya when she hears of the death of her father, King George VI, aged 56, takes the regnal name Elizabeth II.", "In the United States, a mechanical heart is used for the first time in a human patient.", "February 14 – February 25 –  The Winter Olympics are held in Oslo, Norway.", "February 15 – The State Funeral of King George VI of the United Kingdom of Great Britain and Northern Ireland and the British Dominions and the last Emperor of India, takes place. George VI's coffin is brought in procession through London to Paddington Station where a royal train brought the King to Windsor, where his funeral and burial took place at St. George's Chapel at Windsor Castle.", "February 18 – Greece and Turkey join the North Atlantic Treaty Organization.", "February 21 – In Dhaka, East Pakistan (present-day Bangladesh) police open fire on a procession of students, killing 4 people and starting a country-wide protest, which leads to the recognition of Bengali as one of the national languages of Pakistan. The day is later declared \"International Mother Language Day\" by UNESCO.", "February 25 – The Parícutin active volcano in Michoacán, west central Mexico, ceases its discontinuous eruption after spewing forth a gigaton of lava, and burying San Juan Parangaricutiro.", "February 26 – Vincent Massey is sworn in, becoming the first Canadian-born Governor General of Canada."]}, {"Month No.": "2", "Month-Day(s)-Events": ["March 10 – General Fulgencio Batista re-takes power in Cuba in a coup.", "March 15 – 16 – 73 inches (1,870 mm) of rain falls in Cilaos, Réunion, the most rainfall in one day up to that time.", "March 20 – The United States Senate ratifies a peace treaty with Japan.", "March 21\nThe last two executions in the Netherlands take place.\nDr. Kwame Nkrumah is elected Prime Minister of the Gold Coast.\nTornadoes ravage the lower Mississippi River Valley, leaving 208 dead, through March 22.", "The last two executions in the Netherlands take place.", "Dr. Kwame Nkrumah is elected Prime Minister of the Gold Coast.", "Tornadoes ravage the lower Mississippi River Valley, leaving 208 dead, through March 22.", "March 22 – Wernher von Braun publishes the first in his series of articles titled Man Will Conquer Space Soon!, including ideas for crewed flights to Mars and the Moon.", "March 27\nKonrad Adenauer survives an assassination attempt.\nA legislative Assembly election is held in Coorg.", "Konrad Adenauer survives an assassination attempt.", "A legislative Assembly election is held in Coorg.", "April 4\nIn the Hague Tribunal, Israel demands reparations worth $3 billion from Germany.\nWest Ice accidents: During a severe storm in the West Ice, east of Greenland, 78 seal hunters on 5 Norwegian seal hunting vessels vanish without a trace.", "In the Hague Tribunal, Israel demands reparations worth $3 billion from Germany.", "West Ice accidents: During a severe storm in the West Ice, east of Greenland, 78 seal hunters on 5 Norwegian seal hunting vessels vanish without a trace.", "April 7 – The American Research Bureau reports that the I Love Lucy episode \"The Marriage License\" was the first TV show in history to be seen in around 10,000,000 homes, the evening the episode aired.", "April 8 – Youngstown Sheet & Tube Co. v. Sawyer: The U.S. Supreme Court limits the power of the President to seize private business, after President Harry S. Truman nationalizes all steel mills in the United States, just before the 1952 steel strike begins.", "April 9\nHugo Ballivián's government is overthrown by the Bolivian National Revolution, which starts a period of agrarian reform, universal suffrage and the nationalization of tin mines.\nSanta Teresa Church tragedy : 50 people were trampled to death in the Basilica of St. Teresa, Caracas, Venezuela, after someone shouted \"Fire!\". 40 people were arrested in connection with the crush.", "Hugo Ballivián's government is overthrown by the Bolivian National Revolution, which starts a period of agrarian reform, universal suffrage and the nationalization of tin mines.", "Santa Teresa Church tragedy : 50 people were trampled to death in the Basilica of St. Teresa, Caracas, Venezuela, after someone shouted \"Fire!\". 40 people were arrested in connection with the crush.", "April 11\nBattle of Nanri Island: The Republic of China seizes the island from the People's Republic of China.\nBolivian National Revolution: Rebels take over Palacio Quemado.", "Battle of Nanri Island: The Republic of China seizes the island from the People's Republic of China.", "Bolivian National Revolution: Rebels take over Palacio Quemado.", "April 18\nBolivia National Revolution: A universal vote enables indigenous peoples and women to vote, nationalizes mines and enacts agrarian reform.\nWest Germany and Japan form diplomatic relations.", "Bolivia National Revolution: A universal vote enables indigenous peoples and women to vote, nationalizes mines and enacts agrarian reform.", "West Germany and Japan form diplomatic relations.", "April 26 – United States Navy aircraft carrier Wasp collides with destroyer Hobson while on exercises in the Atlantic Ocean, killing 175 men.", "April 28 – The Treaty of San Francisco goes into effect, formally ending the war between Japan and the Allies, and simultaneously ending the occupation of the four main Japanese islands by the Supreme Commander for the Allied Powers."]}, {"Month No.": "3", "Month-Day(s)-Events": ["May 1 – East Germany threatens to form its own army.", "May 3 – U.S. lieutenant colonels Joseph O. Fletcher and William P. Benedict land a plane at the geographic North Pole.", "May 6 – Farouk of Egypt has himself announced as a descendant of the Islamic prophet, Muhammad.", "May 13 – Pandit Nehru forms his first government in India.", "May 15 – Diplomatic relations are established between Israel and Japan at the level of legations.", "May 18 – Ann Davison becomes the first woman to single-handedly sail the Atlantic Ocean.", "June 1\nThe Roman Catholic Church bans the books of André Gide.\nNavigation opens on the Volga–Don Canal, connecting the Caspian Sea basin with that of the Black Sea.", "The Roman Catholic Church bans the books of André Gide.", "Navigation opens on the Volga–Don Canal, connecting the Caspian Sea basin with that of the Black Sea.", "June 10 - 1952 San Juan earthquake. A magnitude 6.8 earthquake kills 5 people on Argentina's San Juan Province.", "June 13 – \"Catalina affair\": Soviet MiG-15 fighter planes shoot down a Swedish military Douglas C-47 Skytrain, carrying out signals intelligence gathering operations over the Baltic Sea, killing all 8 crew; three days later they shoot down a Catalina flying boat, searching for possible survivors.", "June 14 – Myxomatosis is introduced to Europe, on the French estate of Dr. Paul-Félix Armand-Delille.", "June 15 – Anne Frank's The Diary of a Young Girl is published in English-language translation.", "June 19 – The Special Forces (United States Army) are created.", "June 26 – The Pan-Malayan Labour Party is founded in Malaya, as a union of statewide labour parties.", "June 27 – Decree 900 in Guatemala orders the redistribution of uncultivated land.", "June 28 – The First Miss Universe pageant is held. Armi Kuusela from Finland wins the title of Miss Universe 1952."]}, {"Month No.": "4", "Month-Day(s)-Events": ["July 13 – East Germany announces the formation of its National People's Army.", "July 19 – August 3 – The 1952 Summer Olympics are held in Helsinki, Finland.", "July 21 – The 7.3 Mw Kern County earthquake strikes California's southern Central Valley with a maximum Mercalli intensity of XI (Extreme), killing 12 and injuring hundreds.", "July 23\nThe European Coal and Steel Community is established.\nGeneral Mohammed Naguib leads The Free Officers (formed by Gamal Abdel Nasser – the real power behind the coup) in the overthrow of King Farouk of Egypt.", "The European Coal and Steel Community is established.", "General Mohammed Naguib leads The Free Officers (formed by Gamal Abdel Nasser – the real power behind the coup) in the overthrow of King Farouk of Egypt.", "July 26 – King Farouk of Egypt abdicates in favour of Fuad II.\nMaria Eva Duarte De Peron known as \"Evita\" Argentina's first lady dies Of cancer.the Argentine government's declaration of national mourning causes all business, entertainment, leisure, and work to a standstill.", "Maria Eva Duarte De Peron known as \"Evita\" Argentina's first lady dies Of cancer.the Argentine government's declaration of national mourning causes all business, entertainment, leisure, and work to a standstill.", "August 5 – The Treaty of Taipei between Japan and the Republic of China goes into effect, to officially end the Second Sino-Japanese War.", "August 11 – The Jordanian Parliament forces King Talal of Jordan to abdicate due to mental illness; he is succeeded by his son King Hussein.", "August 12 – Night of the Murdered Poets: 13 Soviet Jewish poets are executed.", "August 13 – Japan joins the IMF.", "August 14 – West Germany joins the IMF and the World Bank.", "August 16 – Lynmouth, North Devon, England is devastated by floods; 34 die.", "August 18: A 7.5 earthquake shakes the Tibet region leaving a balance of 54 fatalities.", "August 22 – The most damaging aftershock of the 1952 Kern County earthquake sequence strikes with a moment magnitude of 5.8, and a maximum Mercalli intensity of VIII (Severe). This event damages several hundred buildings in Bakersfield, California, with total additional losses of $10 million, with two associated deaths and some injuries.", "August 26 – A British passenger jet makes a return crossing of the Atlantic Ocean in the same day.", "August 27 – Reparation negotiations between West Germany and Israel end in Luxembourg: Germany will pay 3 billion Deutsche Marks.", "August 29 – Composer John Cage's 4′33″, during which the performer does not play, premieres in Woodstock, New York.", "August 30 – The last Finnish war reparations are sent to the Soviet Union.", "August 31 – The Grenzlandring racetrack closes in Wegberg, Germany."]}, {"Month No.": "5", "Month-Day(s)-Events": ["September 2 – Dr. C. Walton Lillehei and Dr. F. John Lewis perform the first open-heart surgery, at the University of Minnesota.", "September 6 – The CBC in Montreal, Quebec, goes on air launching television in Canada.", "September 10 – The European Parliamentary Assembly (from March 1962, the European Parliament) opens.", "September 15 – The United Nations cedes Eritrea to Ethiopia.", "September 18 – The Soviet Union vetoes Japan's application for membership in the United Nations.", "September 30 – The Revised Standard Version of the Bible is published.", "October 14 – The United Nations begins work in the new United Nations building in New York City, designed by Le Corbusier and Oscar Niemeyer.", "October 17 – 17 October affair: Indonesian troops led by General Nasution surround the presidential palace, seeking the dismissal of the People's Representative Council; Sukarno avoids confrontation.", "October 19 – Alain Bombard begins to sail from the Canary Islands to Barbados in 65 days; he reaches them December 23.", "October 20 – Martial law is declared in Kenya, in the face of the Mau Mau uprising."]}, {"Month No.": "6", "Month-Day(s)-Events": ["November 1 – Nuclear testing and Operation Ivy: The United States successfully detonates the first hydrogen bomb, codenamed \"Mike\", at Eniwetok Atoll in the Marshall Islands in the central Pacific Ocean, with a yield of 10.4 megatons."]}, {"Month No.": "7", "Month-Day(s)-Events": ["November 4\nThe 9.0 Mw Severo-Kurilsk earthquake hits the Kamchatka Peninsula of the Soviet Union with a maximum Mercalli intensity of XI (Extreme). A tsunami took the lives of more than 2,300 people.\n1952 United States presidential election: Republican General Dwight D. Eisenhower defeats Democratic Governor of Illinois Adlai Stevenson (correctly predicted by the UNIVAC computer).\nPace-Finletter MOU 1952: A Memorandum of understanding is signed between \"...Air Force Secretary Finletter and Army Secretary Pace that established a fixed wing weight limit  of five thousand pounds empty, but weight restrictions on helicopters were eliminated...\"", "The 9.0 Mw Severo-Kurilsk earthquake hits the Kamchatka Peninsula of the Soviet Union with a maximum Mercalli intensity of XI (Extreme). A tsunami took the lives of more than 2,300 people.", "1952 United States presidential election: Republican General Dwight D. Eisenhower defeats Democratic Governor of Illinois Adlai Stevenson (correctly predicted by the UNIVAC computer).", "Pace-Finletter MOU 1952: A Memorandum of understanding is signed between \"...Air Force Secretary Finletter and Army Secretary Pace that established a fixed wing weight limit  of five thousand pounds empty, but weight restrictions on helicopters were eliminated...\"", "November 18 – Jomo Kenyatta is arrested in Kenya, for an alleged connection to the Mau Mau Uprising.", "November 20\nThe first official passenger flight over the North Pole is made, from Los Angeles to Copenhagen.\nThe first successful sex reassignment surgery is performed in Copenhagen, making George Jorgensen Jr. become Christine Jorgensen.", "The first official passenger flight over the North Pole is made, from Los Angeles to Copenhagen.", "The first successful sex reassignment surgery is performed in Copenhagen, making George Jorgensen Jr. become Christine Jorgensen.", "November 29 – Korean War: U.S. President-elect Dwight D. Eisenhower fulfills a political campaign promise, by traveling to Korea to find out what can be done to end the conflict.", "December 1 – Adolfo Ruiz Cortines takes office as President of Mexico.", "December 10 – Albert Schweitzer is given the 1952 Nobel Peace Prize.", "December 14 – The first successful surgical separation of Siamese twins is conducted in Mount Sinai Hospital, Cleveland, Ohio.", "December 20 – The crash of a U.S. Air Force C-124 Globemaster at Moses Lake, WA kills 86 servicemen.", "December 25 – One West German soldier is killed in a shooting incident in West Berlin.", "December 26 – Joseph Ivor Linton, the first Israeli Minister Plenipotentiary in Japan, presents his credentials to the Emperor of Japan."]}, {"Month No.": "8", "Month-Day(s)-Events": ["The Nordic Council agrees to the unrestricted transport of people, goods and services throughout the Nordic Countries.", "Supramar launches the first commercial high-speed craft, a hydrofoil.", "During the Mau Mau Uprising, the poisonous latex of the African milk bush is used to kill cattle, in an incident of Biological warfare."]}, {"Month No.": "9", "Month-Day(s)-Events": ["January 1 – Hamad bin Khalifa Al Thani, Emir of Qatar", "January 2 – Elvira Saadi, Soviet gymnast", "January 3\nEsperanza Aguirre, Spanish politician\nJim Ross, American wrestling announcer", "Esperanza Aguirre, Spanish politician", "Jim Ross, American wrestling announcer", "January 7 – Sammo Hung, Hong Kong martial arts superstar, producer and director", "January 9 – Marek Belka, 11th Prime Minister of Poland", "January 9 - Lee Montgomery, American speed shop owner,", "January 12 – Walter Mosley, American author", "January 14 – Călin Popescu-Tăriceanu, 60th Prime Minister of Romania", "January 15\nBoris Blank, Swiss musician\nMuhammad Wakkas, Bangladeshi teacher and parliamentarian", "Boris Blank, Swiss musician", "Muhammad Wakkas, Bangladeshi teacher and parliamentarian", "January 17 – Ryuichi Sakamoto, Japanese musician, composer, producer, and actor (Yellow Magic Orchestra)", "January 21 – Marco Camenisch, Swiss environmental activist", "January 24 – Raymond Domenech, French football player, manager", "January 25\nSara Mandiano, French singer, songwriter\nPeter Tatchell, Australian-born British human rights activist", "Sara Mandiano, French singer, songwriter", "Peter Tatchell, Australian-born British human rights activist", "January 27\nBrian Gottfried, American tennis player\nAsma Jahangir, Pakistani human rights activist, lawyer (d. 2018)", "Brian Gottfried, American tennis player", "Asma Jahangir, Pakistani human rights activist, lawyer (d. 2018)", "January 29 – Klaus-Peter Hanisch, German footballer (d. 2009)", "January 30 – Valery Khalilov, Russian military band conductor (d. 2016)"]}, {"Month No.": "10", "Month-Day(s)-Events": ["February 2 – Park Geun-hye, President of South Korea", "February 4\nAbdalá Bucaram, 38th President of Ecuador\nJenny Shipley, Prime Minister of New Zealand", "Abdalá Bucaram, 38th President of Ecuador", "Jenny Shipley, Prime Minister of New Zealand", "February 7 – John Hickenlooper, American politician, 42nd Governor of Colorado", "February 8 – Nora Miao, Hong Kong actress", "February 10 – Lee Hsien Loong, 3rd Prime Minister of Singapore", "February 12 – Simon MacCorkindale, English actor (d. 2010)", "February 14 – Sushma Swaraj, Indian politician (d. 2019)", "February 15\nNikolai Sorokin, Soviet, Russian actor, theatre director (d. 2013)\nTomislav Nikolić, 4th President of Serbia", "Nikolai Sorokin, Soviet, Russian actor, theatre director (d. 2013)", "Tomislav Nikolić, 4th President of Serbia", "February 16 – James Ingram, African-American R&B musician (d. 2019)", "February 17 – Javier Urruticoechea, Spanish footballer (d. 2001)", "February 19\nGary Seear, New Zealand rugby union player (d. 2018)\nAmy Tan, American novelist (The Joy Luck Club)", "Gary Seear, New Zealand rugby union player (d. 2018)", "Amy Tan, American novelist (The Joy Luck Club)", "February 21\nVitaly Churkin, Russian diplomat (d. 2017)\nElisha Obed, Bahamian boxer (d. 2018)", "Vitaly Churkin, Russian diplomat (d. 2017)", "Elisha Obed, Bahamian boxer (d. 2018)", "February 22\nWilliam Frist, U.S. Senator, heart surgeon\nSaufatu Sopoanga, 8th Prime Minister of Tuvalu (d. 2020)", "William Frist, U.S. Senator, heart surgeon", "Saufatu Sopoanga, 8th Prime Minister of Tuvalu (d. 2020)", "February 25 – Joey Dunlop, Northern Irish motorcycle racer (d. 2000)"]}, {"Month No.": "11", "Month-Day(s)-Events": ["March 2 – Laraine Newman, American comedian (Saturday Night Live)", "March 4\nScott Hicks, Australian film director\nUmberto Tozzi, Italian singer", "Scott Hicks, Australian film director", "Umberto Tozzi, Italian singer", "March 7 – Viv Richards, West Indian cricketer", "March 10 – Morgan Tsvangirai, Zimbabwean politician, 2nd Prime Minister of Zimbabwe (d. 2018)", "March 11 – Douglas Adams, English author (The Hitchhiker's Guide to the Galaxy) (d. 2001)", "March 13\nÁgnes Rapai, Hungarian writer\nWolfgang Rihm, German composer", "Ágnes Rapai, Hungarian writer", "Wolfgang Rihm, German composer", "March 15 – Howard Devoto, British singer", "March 16 – Alice Hoffman, American novelist", "March 17 – Perla, Paraguayan-Brazilian singer", "March 19 – Harvey Weinstein, American film producer", "March 23\nKim Stanley Robinson, American author\nRex Tillerson, United States Secretary of State\nVillano III, Mexican professional wrestler (d. 2018)", "Kim Stanley Robinson, American author", "Rex Tillerson, United States Secretary of State", "Villano III, Mexican professional wrestler (d. 2018)", "March 24 – Reinhard Genzel, German astrophysicist, Nobel Prize recipient", "March 25\nJung Chang, Chinese-born author, historian\nAntanas Mockus, Colombian mathematician, politician", "Jung Chang, Chinese-born author, historian", "Antanas Mockus, Colombian mathematician, politician", "March 26 – Didier Pironi, French racing driver (d. 1987)", "March 27 – Maria Schneider, French actress (d. 2011)", "March 28 – Keith Ashfield, Canadian politician (d. 2018)", "March 29 – Teofilo Stevenson, Cuban boxer (d. 2012)", "March 30 – Peter Knights, Australian footballer, coach", "March 31 – Dermot Morgan, Irish actor and comedian (d. 1998)"]}, {"Month No.": "12", "Month-Day(s)-Events": ["April 1\nAnnette O'Toole, American actress\nBernard Stiegler, French philosopher (d. 2020)", "Annette O'Toole, American actress", "Bernard Stiegler, French philosopher (d. 2020)", "April 2 – Lennart Fagerlund, Swedish cyclist", "April 4\nRosemarie Ackermann, German athlete\nGary Moore, Northern Irish musician (d. 2011)\nKaren Magnussen, Canadian figure skater", "Rosemarie Ackermann, German athlete", "Gary Moore, Northern Irish musician (d. 2011)", "Karen Magnussen, Canadian figure skater", "April 6 – Marilu Henner, American actress (Taxi) and writer", "April 7 – Nichita Danilov, Romanian writer", "April 10 – Steven Seagal, American actor", "April 11 – Qamar Zaman, Pakistani squash player", "April 16 – Billy West, American voice actor", "April 17\nJoe Alaskey, American voice actor (d. 2016)\nŽeljko Ražnatović, Serbian mobster, paramilitary leader (d. 2000)", "Joe Alaskey, American voice actor (d. 2016)", "Željko Ražnatović, Serbian mobster, paramilitary leader (d. 2000)", "April 19 – Alexis Arguello, Nicaraguan boxer, politician (d. 2009)", "April 21 – Cheryl Gillan, British politician (d. 2021)", "April 23 – Jean-Dominique Bauby, French journalist and author (d. 1997)", "April 24 – Jean-Paul Gaultier, French Haute couture, Prêt-à-Porter fashion designer", "April 25\nKetil Bjørnstad, Norwegian pianist\nVladislav Tretiak, Russian ice hockey player", "Ketil Bjørnstad, Norwegian pianist", "Vladislav Tretiak, Russian ice hockey player", "April 27 – George Gervin, American basketball player", "April 28 – Mary McDonnell, American actress"]}, {"Month No.": "13", "Month-Day(s)-Events": ["May 1 – Mike Thornton, British politician", "May 2 – Christine Baranski, American actress", "May 3\nLeonid Khachiyan, Russian-born mathematician\nAllan Wells, Scottish athlete", "Leonid Khachiyan, Russian-born mathematician", "Allan Wells, Scottish athlete", "May 4 – Michael Barrymore, British comedian, TV presenter", "May 6 – Michael O'Hare, American actor (d. 2012)", "May 10\nRoland Kaiser, German singer\nManuel Mora Morales, Spanish director, writer", "Roland Kaiser, German singer", "Manuel Mora Morales, Spanish director, writer", "May 11\nShohreh Aghdashloo, Iranian actress\nFrances Fisher, British-born American actress\nRenaud, French composer", "Shohreh Aghdashloo, Iranian actress", "Frances Fisher, British-born American actress", "Renaud, French composer", "May 12 – Christopher Gaze, British voice actor", "May 13 – John Kasich, Governor of Ohio", "May 14\nRobert Zemeckis, American film director (Back to the Future)\nDavid Byrne, Scottish singer-songwriter (Talking Heads)", "Robert Zemeckis, American film director (Back to the Future)", "David Byrne, Scottish singer-songwriter (Talking Heads)", "May 15 – Chazz Palminteri, American actor", "May 18 – George Strait, American country musician", "May 19 – Bert van Marwijk, Dutch football manager", "May 20 – Roger Milla, Cameroonian footballer", "May 21 – Mr. T, African-American actor (The A-Team)", "May 23 – Anne-Marie David, French singer, Eurovision Song Contest 1973 winner", "May 24 – Sybil Danning, Austrian actress"]}]