[{"Month No.": "1", "Month-Day(s)-Events": ["January 1 – Kurt Waldheim becomes Secretary-General of the United Nations.", "January 4 - The first scientific hand-held calculator (HP-35) is introduced (price $395).", "January 7 – Iberia Airlines Flight 602 crashes into a 462-meter peak on the island of Ibiza; 104 are killed.", "January 9 – The RMS Queen Elizabeth is destroyed by fire in Hong Kong harbor.", "January 10 – Independence leader Sheikh Mujibur Rahman returns to Bangladesh after spending over nine months in prison in Pakistan.", "January 11 – Sheikh Mujibur Rahman declares a new constitutional government in Bangladesh, with himself as president.", "January 12 – In a 10-hour siege, a cell of 4 left-wing insurgents hold off a task force of 2500 army soldiers and police agents in Santo Domingo, Dominican Republic: eight members of the security forces and the entire insurgent cell are killed in the course of the siege.", "January 13 – In Ghana Prime Minister of Ghana Kofi Abrefa Busia is overthrown in a military coup by Colonel Ignatius Kutu Acheampong.", "January 14 – Queen Margrethe II of Denmark succeeds her father, King Frederick IX, on the throne of Denmark, the first Queen of Denmark since 1412 and the first Danish monarch not named Frederick or Christian since 1513.", "January 18 – Members of the Mukti Bahini lay down their arms to the government of the newly independent Bangladesh, 33 days after winning the war against the occupying Pakistan Army.", "January 19 – The Libertarian enclave Minerva on a platform in the South Pacific, sponsored by the Phoenix Foundation, declares independence. Soon neighboring Tonga annexes the area and dismantles the platform.", "January 20 – President Zulfikar Ali Bhutto announces that Pakistan will immediately begin a nuclear weapons program.", "January 21\nA New Delhi bootlegger sells wood alcohol to a wedding party; 100 people die.\nTripura, part of the former independent Twipra Kingdom, becomes a full state of India.", "A New Delhi bootlegger sells wood alcohol to a wedding party; 100 people die.", "Tripura, part of the former independent Twipra Kingdom, becomes a full state of India.", "January 24 – Japanese soldier Shoichi Yokoi is discovered in Guam; he had spent 28 years in the jungle, having failed to surrender after World War II.", "January 26\nYugoslavian air stewardess Vesna Vulović is the only survivor when her plane crashes in Czechoslovakia. She survives after falling 10,160 meters (33,330 feet) in the tail section of the aircraft.\nThe Aboriginal Tent Embassy is set up on the lawn of Parliament House in Canberra.", "Yugoslavian air stewardess Vesna Vulović is the only survivor when her plane crashes in Czechoslovakia. She survives after falling 10,160 meters (33,330 feet) in the tail section of the aircraft.", "The Aboriginal Tent Embassy is set up on the lawn of Parliament House in Canberra.", "January 30\nBloody Sunday: The British Army kills 14 unarmed nationalist civil rights marchers in Derry, Northern Ireland.\nPakistan withdraws from the Commonwealth of Nations.", "Bloody Sunday: The British Army kills 14 unarmed nationalist civil rights marchers in Derry, Northern Ireland.", "Pakistan withdraws from the Commonwealth of Nations.", "January 31 – King Birendra succeeds his father as King of Nepal."]}, {"Month No.": "2", "Month-Day(s)-Events": ["February 2\nA bomb explodes at the British Yacht Club in West Berlin, killing Irwin Beelitz, a German boat builder. The German militant group 2 June Movement claims responsibility, announcing its support of the Provisional Irish Republican Army.\nAnti-British riots take place throughout Ireland. The British Embassy in Dublin is burned to the ground, as are several British-owned businesses.", "A bomb explodes at the British Yacht Club in West Berlin, killing Irwin Beelitz, a German boat builder. The German militant group 2 June Movement claims responsibility, announcing its support of the Provisional Irish Republican Army.", "Anti-British riots take place throughout Ireland. The British Embassy in Dublin is burned to the ground, as are several British-owned businesses.", "February 3–13 – The 1972 Winter Olympics are held in Sapporo, Japan.", "February 4 – Mariner 9 sends pictures as it orbits Mars.", "February 15 – President of Ecuador José María Velasco Ibarra is deposed for the fourth time.", "February 17 – Volkswagen Beetle sales exceed those of the Ford Model T when the 15,007,034th Beetle is produced.", "February 19 – Asama-Sansō incident: Five United Red Army members break into a lodge below Mount Asama, taking the wife of the lodge keeper hostage.", "February 21 – The Soviet unmanned spaceship Luna 20 lands on the Moon.", "February 21 – February 28 – U.S. President Richard M. Nixon makes an unprecedented 8-day visit to the People's Republic of China and meets with Mao Zedong.", "February 22\nAldershot Bombing: An Official IRA bomb kills seven people in Aldershot, UK.\nLufthansa Flight 649 is hijacked and taken to Aden. Passengers are released the following day after a ransom of 5 million US dollars is agreed.", "Aldershot Bombing: An Official IRA bomb kills seven people in Aldershot, UK.", "Lufthansa Flight 649 is hijacked and taken to Aden. Passengers are released the following day after a ransom of 5 million US dollars is agreed.", "February 23 – US activist Angela Davis is released from jail. Rodger McAfee, a farmer from Caruthers, California, helps her make bail.", "February 26 – Luna 20 comes back to Earth with 55 grams (1.94 oz) of lunar soil.", "February 28 – The Asama-Sanso incident ends in a standoff between 5 members of the Japanese United Red Army and the authorities, in which two policemen are killed and 12 injured."]}, {"Month No.": "3", "Month-Day(s)-Events": ["March 1 – Juan María Bordaberry is sworn in as President of Uruguay amid accusations of electoral fraud.", "March 2\nThe Club of Rome presents the research results leading to its report The Limits to Growth, published later in the month.\nThe Pioneer 10 spacecraft is launched from Cape Kennedy, to be the first man-made spacecraft to leave the solar system.\nJean-Bédel Bokassa becomes President of the Central African Republic.", "The Club of Rome presents the research results leading to its report The Limits to Growth, published later in the month.", "The Pioneer 10 spacecraft is launched from Cape Kennedy, to be the first man-made spacecraft to leave the solar system.", "Jean-Bédel Bokassa becomes President of the Central African Republic.", "March 4\nLibya and the Soviet Union sign a cooperation treaty.\nThe Organisation of the Islamic Conference Charter is signed (effective February 28, 1973).", "Libya and the Soviet Union sign a cooperation treaty.", "The Organisation of the Islamic Conference Charter is signed (effective February 28, 1973).", "March 5 – Greek composer Mikis Theodorakis leaves the Greek Communist Party.", "March 19 – India and Bangladesh sign the Indo-Bangladeshi Treaty of Friendship, Cooperation and Peace.", "March 22\nThe 92nd U.S. Congress votes to send the proposed Equal Rights Amendment to the states for ratification.\nEisenstadt v. Baird: The Supreme Court of the U.S. rules that unmarried people have the right to access contraception on the same basis as married couples", "The 92nd U.S. Congress votes to send the proposed Equal Rights Amendment to the states for ratification.", "Eisenstadt v. Baird: The Supreme Court of the U.S. rules that unmarried people have the right to access contraception on the same basis as married couples", "March 25 – Après toi sung by Vicky Leandros (music by Klaus Munro & Mario Panas, lyric by Klaus Munro & Yves Dessca) wins the Eurovision Song Contest 1972 for Luxembourg.", "March 26 – An avalanche on Mount Fuji kills 19 climbers.", "March 27 – The First Sudanese Civil War ends.", "March 30 – Vietnam War: The Easter Offensive begins after North Vietnamese forces cross into the Demilitarized Zone (DMZ) of South Vietnam"]}, {"Month No.": "4", "Month-Day(s)-Events": ["April 10\nThe U.S. and the Soviet Union join some 70 nations in signing the Biological Weapons Convention, an agreement to ban biological warfare.\nTombs containing bamboo slips, among them Sun Tzu's Art of War and Sun Bin's lost military treatise, are accidentally discovered by construction workers in Shandong.\nThe 6.7 Mw  Qir earthquake shakes southern Iran with a maximum Mercalli intensity of IX (Violent), killing 5,374 people in the province of Fars.\nThe 44th Annual Academy Awards are held at the Dorothy Chandler Pavilion in Los Angeles.", "The U.S. and the Soviet Union join some 70 nations in signing the Biological Weapons Convention, an agreement to ban biological warfare.", "Tombs containing bamboo slips, among them Sun Tzu's Art of War and Sun Bin's lost military treatise, are accidentally discovered by construction workers in Shandong.", "The 6.7 Mw  Qir earthquake shakes southern Iran with a maximum Mercalli intensity of IX (Violent), killing 5,374 people in the province of Fars.", "The 44th Annual Academy Awards are held at the Dorothy Chandler Pavilion in Los Angeles.", "April 13 – The Universal Postal Union decides to recognize the People's Republic of China as the only legitimate Chinese representative, effectively expelling the Republic of China administering Taiwan.", "April 16\nApollo 16 (John Young, Ken Mattingly, Charlie Duke) is launched. During the mission, the astronauts, driving the Lunar Roving Vehicle, achieve a lunar rover speed record of 18 km/h.\nVietnam War – Nguyen Hue Offensive: Prompted by the North Vietnamese offensive, the United States resumes bombing of Hanoi and Haiphong.", "Apollo 16 (John Young, Ken Mattingly, Charlie Duke) is launched. During the mission, the astronauts, driving the Lunar Roving Vehicle, achieve a lunar rover speed record of 18 km/h.", "Vietnam War – Nguyen Hue Offensive: Prompted by the North Vietnamese offensive, the United States resumes bombing of Hanoi and Haiphong.", "April 26 – The Lockheed L-1011 TriStar enters service with Eastern Airlines.", "April 27\nThe Burundian Genocide against the Hutu begins; more than 500,000 Hutus die.\nA no-confidence vote against German Chancellor Willy Brandt fails under obscure circumstances.", "The Burundian Genocide against the Hutu begins; more than 500,000 Hutus die.", "A no-confidence vote against German Chancellor Willy Brandt fails under obscure circumstances.", "April 29 – The fourth anniversary of the Broadway musical Hair is celebrated with a free concert at a Central Park bandshell, followed by dinner at the Four Seasons. There, 13 Black Panther protesters and the show's co-author, Jim Rado, are arrested for disturbing the peace and for using marijuana."]}, {"Month No.": "5", "Month-Day(s)-Events": ["May 2 – Fire at the Sunshine Mine, a silver mine in Idaho, kills 91.", "May 5 – An Alitalia DC-8 crashes west of Palermo, Sicily; 115 die.", "May 7 – General elections are held in Italy.", "May 10 – Operation Linebacker and Operation Custom Tailor begin with large-scale bombing operations against North Vietnam by tactical fighter aircraft.", "May 13 – A fire in a nightclub atop the Sennichi department store in Osaka, Japan, kills 115.", "May 21 – In St. Peter's Basilica (Vatican City), Laszlo Toth attacks Michelangelo's Pietà statue with a geologist's hammer, shouting that he is Jesus Christ.", "May 22\nThe Dominion of Ceylon becomes the republic of Sri Lanka under prime minister Sirimavo Bandaranaike, when its new constitution is ratified.\nFerit Melen forms the new (interim) government of Turkey (35th government)", "The Dominion of Ceylon becomes the republic of Sri Lanka under prime minister Sirimavo Bandaranaike, when its new constitution is ratified.", "Ferit Melen forms the new (interim) government of Turkey (35th government)", "May 23 – The Tamil United Front (later known as Tamil United Liberation Front), a pro-Tamil organization, is founded in Sri Lanka.", "May 26\nRichard Nixon and Leonid Brezhnev sign the SALT I treaty in Moscow, as well as the Anti-Ballistic Missile Treaty and other agreements.\nWillandra National Park is established in Australia.", "Richard Nixon and Leonid Brezhnev sign the SALT I treaty in Moscow, as well as the Anti-Ballistic Missile Treaty and other agreements.", "Willandra National Park is established in Australia.", "May 27 – Mark Donohue wins the Indianapolis 500 in a Penske Racing McLaren–Offenhauser.", "May 30 – Lod Airport massacre: Three Japanese Red Army members operating on behalf of the Popular Front for the Liberation of Palestine – External Operations kill 26 and injure 80 people at Lod Airport, Israel."]}, {"Month No.": "6", "Month-Day(s)-Events": ["June – Iraq nationalizes the Iraq Petroleum Company.", "June 3 – Sally Priesand becomes the first American woman (and the second known woman anywhere) to be ordained as a rabbi within Judaism.", "June 5–16 – The United Nations Conference on the Human Environment is held in Stockholm, Sweden", "June 8\nSeven men and three women hijack a plane from Czechoslovakia to West Germany.\nVietnam War: Associated Press photographer Nick Ut takes his Pulitzer Prize-winning photograph of a naked nine-year-old Phan Thi Kim Phuc running down a road after being burned by napalm.", "Seven men and three women hijack a plane from Czechoslovakia to West Germany.", "Vietnam War: Associated Press photographer Nick Ut takes his Pulitzer Prize-winning photograph of a naked nine-year-old Phan Thi Kim Phuc running down a road after being burned by napalm.", "June 9 – The Black Hills flood kills 238 in South Dakota.", "June 11 – Henri Pescarolo (France) and co-driver former World Drivers' Champion Graham Hill (Britain) win the 24 Hours of Le Mans in the Equipe Matra MS670.", "June 14–23 – Hurricane Agnes kills 117 on the U.S. East Coast.", "June 14 – Japan Airlines Flight 471 crashes outside New Delhi airport, killing 82 of 87 occupants.", "June 16 – 108 die as two passenger trains hit the debris of a collapsed railway tunnel near Soissons, France.", "June 17\nWatergate scandal: Five White House operatives are arrested for burgling the offices of the Democratic National Committee.\nChilean president Salvador Allende forms a new government.", "Watergate scandal: Five White House operatives are arrested for burgling the offices of the Democratic National Committee.", "Chilean president Salvador Allende forms a new government.", "June 18\nStaines air disaster: 118 die when a Trident 1 jet airliner crashes two minutes after takeoff from London Heathrow Airport.\nWest Germany beats the Soviet Union 3–0 to win Euro 72.\nHong Kong's worst flooding and landslides in recorded history with 653.2 millimetres (25.72 in) of rainfall in the previous three days. 67 people die due to building collapses in Mid-levels districts landslide and building collapses, with a further 83 due to flooding-related fatalities. It is the second worst fatality due to building collapses, and the worst flooding in Hong Kong's recorded history.", "Staines air disaster: 118 die when a Trident 1 jet airliner crashes two minutes after takeoff from London Heathrow Airport.", "West Germany beats the Soviet Union 3–0 to win Euro 72.", "Hong Kong's worst flooding and landslides in recorded history with 653.2 millimetres (25.72 in) of rainfall in the previous three days. 67 people die due to building collapses in Mid-levels districts landslide and building collapses, with a further 83 due to flooding-related fatalities. It is the second worst fatality due to building collapses, and the worst flooding in Hong Kong's recorded history.", "June 23\nWatergate scandal: U.S. President Richard M. Nixon and White House chief of staff H. R. Haldeman are taped talking about using the C.I.A. to obstruct the F.B.I.'s investigation into the Watergate break-ins.\nThe United Kingdom Chancellor of the Exchequer, Anthony Barber, announces a decision for the pound sterling to move to a floating exchange rate. Although intended to be temporary, this remains permanent. Foreign exchange controls are applied to most members of the sterling area.", "Watergate scandal: U.S. President Richard M. Nixon and White House chief of staff H. R. Haldeman are taped talking about using the C.I.A. to obstruct the F.B.I.'s investigation into the Watergate break-ins.", "The United Kingdom Chancellor of the Exchequer, Anthony Barber, announces a decision for the pound sterling to move to a floating exchange rate. Although intended to be temporary, this remains permanent. Foreign exchange controls are applied to most members of the sterling area.", "June 30 – The International Time Bureau adds the first leap second (23:59:60) to Coordinated Universal Time (UTC) at the end of the month."]}, {"Month No.": "7", "Month-Day(s)-Events": ["July 1 – The Canadian ketch Vega, flying the Greenpeace III banner, collides with the French naval minesweeper La Paimpolaise while in international waters, to protest French nuclear weapon tests in the South Pacific.", "July 2 – Following Pakistan's surrender to India in the Indo-Pakistani War of 1971, both nations sign the historic Simla Agreement, agreeing to settle their disputes bilaterally.", "July 4 – The first Rainbow Gathering is held in Colorado.", "July 10 – India's news agency reports that at least 24 people have been killed in separate incidents, in the Chandka Forest in India, by elephants crazed by heat and drought.", "July 11\nThe long anticipated chess match between world champion Boris Spassky of the Soviet Union, and United States champion Bobby Fischer, began in Iceland at Reykjavík.\nCurtis Mayfield releases the soundtrack to the 1972 film, Super Fly.", "The long anticipated chess match between world champion Boris Spassky of the Soviet Union, and United States champion Bobby Fischer, began in Iceland at Reykjavík.", "Curtis Mayfield releases the soundtrack to the 1972 film, Super Fly.", "July 10–14 – The Democratic National Convention meets in Miami Beach. Senator George McGovern, who backs the immediate and complete withdrawal of U.S. troops from South Vietnam, is nominated for president. He names fellow Senator Thomas Eagleton as his running mate.", "July 18 – Anwar Sadat expels 20,000 Soviet advisors from Egypt.", "July 21\nBloody Friday: 22 bombs planted by the Provisional IRA explode in Belfast, Northern Ireland; nine people are killed and 130 seriously injured.\nA collision between two trains near Seville, Spain, kills 76 people.", "Bloody Friday: 22 bombs planted by the Provisional IRA explode in Belfast, Northern Ireland; nine people are killed and 130 seriously injured.", "A collision between two trains near Seville, Spain, kills 76 people.", "July 23 – The United States launches Landsat 1, the first Earth-resources satellite.", "July 24 – King Jigme Singye Wangchuck succeeds his father Jigme Dorji Wangchuck as king of Bhutan.", "July 25 – U.S. health officials admit that African-Americans were used as guinea pigs in the Tuskegee Study of Untreated Syphilis in the Negro Male.", "July 27 – The McDonnell Douglas F-15 Eagle makes its first flight.", "July 31 – The Troubles, Northern Ireland:\nOperation Motorman 4:00 AM: The British Army begins to regain control of the \"no-go areas\" established by Irish republican paramilitaries in Belfast, Derry (\"Free Derry\") and Newry.\nClaudy bombing (\"Bloody Monday\"), 10:00 AM: Three car bombs in Claudy, County Londonderry, kill nine. It becomes public knowledge only in 2010 that a local Catholic priest was an IRA officer believed to be involved in the bombings but his role was covered up by the authorities.", "Operation Motorman 4:00 AM: The British Army begins to regain control of the \"no-go areas\" established by Irish republican paramilitaries in Belfast, Derry (\"Free Derry\") and Newry.", "Claudy bombing (\"Bloody Monday\"), 10:00 AM: Three car bombs in Claudy, County Londonderry, kill nine. It becomes public knowledge only in 2010 that a local Catholic priest was an IRA officer believed to be involved in the bombings but his role was covered up by the authorities."]}, {"Month No.": "8", "Month-Day(s)-Events": ["August 4\nExpulsion of Asians from Uganda: Dictator Idi Amin declares that Uganda will expel 50,000 Asians with British passports to Britain within 3 months.\nA huge solar flare (one of the largest ever recorded) knocks out cable lines in the U.S. It begins with the appearance of sunspots on August 2; an August 4 flare kicks off high levels of activity until August 10.", "Expulsion of Asians from Uganda: Dictator Idi Amin declares that Uganda will expel 50,000 Asians with British passports to Britain within 3 months.", "A huge solar flare (one of the largest ever recorded) knocks out cable lines in the U.S. It begins with the appearance of sunspots on August 2; an August 4 flare kicks off high levels of activity until August 10.", "August 10 – A brilliant, daytime meteor is seen in the western U.S. and Canada as an Apollo asteroid skips off the Earth's atmosphere.", "August 12 – Oil tankers Oswego-Guardian and Texanita collide near Stilbaai, South Africa.", "August 14 – An East German Ilyushin airliner crashes near East Berlin; all 156 on board perish.", "August 16 – As part of a coup attempt, members of the Royal Moroccan Air Force fire upon, but fail to bring down, Hassan II of Morocco's plane while he is traveling back to Rabat.", "August 19 – The first daytime episode of the second incarnation of the American game show The Price Is Right is taped at CBS Television City, to be aired on September 4.", "August 21 – The Republican National Convention in Miami Beach, Florida renominates U.S. President Richard Nixon and Vice President Spiro Agnew for a second term.", "August 22\nRhodesia is expelled by the International Olympic Committee for its racist policies.\nIn the Almirante Zar Naval Base, Argentina, 16 detainees are executed by firing squad in the Trelew massacre.", "Rhodesia is expelled by the International Olympic Committee for its racist policies.", "In the Almirante Zar Naval Base, Argentina, 16 detainees are executed by firing squad in the Trelew massacre.", "August 26–September 10 – The 1972 Summer Olympics are held in Munich, West Germany."]}, {"Month No.": "9", "Month-Day(s)-Events": ["September 1\nBobby Fischer defeats Boris Spassky in a chess match in Reykjavík, Iceland, becoming the first American world chess champion.\nThe Second Cod War begins between the United Kingdom and Iceland.", "Bobby Fischer defeats Boris Spassky in a chess match in Reykjavík, Iceland, becoming the first American world chess champion.", "The Second Cod War begins between the United Kingdom and Iceland.", "September 5–6 – Munich massacre: Eleven Israeli athletes at the 1972 Summer Olympics in Munich are murdered after eight members of the Arab terrorist group Black September invade the Olympic Village; five guerillas and one policeman are also killed in a failed hostage rescue.", "September 10 – The Brazilian driver Emerson Fittipaldi wins the Italian Grand Prix at Monza and becomes the youngest Formula One World Champion at the age of 25.", "September 14 – West Germany and Poland renew diplomatic relations.", "September 17 – Uganda announces that there are Tanzanian troops in its territory.", "September 18 – São Paulo Metro is inaugurated in Brazil.", "September 19 – A parcel bomb sent to the Israeli Embassy in London kills one diplomat.", "September 23 – Philippine president Ferdinand Marcos announces on national television the issuance of Proclamation No. 1081 placing the entire country under martial law. September 23: Martial law in the Philippines.", "September 24 – An F-86 fighter aircraft leaving an air show at Sacramento Executive Airport fails to become airborne and crashes into a Farrell's Ice Cream Parlour, killing 12 children and 11 adults.", "September 25 – 1972 Norwegian EC referendum: Norway rejects membership of the European Economic Community.", "September 28 – The Canadian national men's hockey team defeats the Soviet national ice hockey team in the eighth and final game of the 1972 Summit Series (French: La Série du Siècle, Russian: Суперсерия СССР — Канада), 6–5, to win the series 4–3–1.", "September 29 – Sino-Japanese relations: The Joint Communiqué of the Government of Japan and the Government of the People's Republic of China is signed in Beijing, which normalizes diplomatic relations with the People's Republic of China after breaking official ties with the Republic of China (Taiwan)."]}, {"Month No.": "10", "Month-Day(s)-Events": ["October – The government of former President of Somalia Mohamed Siad Barre formally introduces the Somali alphabet as Somalia's official writing script.", "October 1\nThe first publication reporting the production of a recombinant DNA molecule marks the birth of modern molecular biology methodology.\nAlex Comfort's bestselling manual The Joy of Sex is published.", "The first publication reporting the production of a recombinant DNA molecule marks the birth of modern molecular biology methodology.", "Alex Comfort's bestselling manual The Joy of Sex is published.", "October 2 – Denmark joins the European Community; the Faroe Islands stay out.", "October 5 – The United Reformed Church is founded out of the Congregational and Presbyterian Churches.", "October 6 – A train crash in Saltillo, Mexico, kills 208 people.", "October 8 – A major breakthrough occurs in the Paris peace talks between Henry Kissinger and Lê Đức Thọ.", "October 13 – Uruguayan Air Force Flight 571: A Fairchild FH-227D passenger aircraft transporting a rugby union team crashes at about 14,000 feet (4,300 m) in the Andes mountain range, near the Argentina/Chile border. Sixteen of the survivors are found alive December 20 but they have had to resort to cannibalism to survive.", "October 22 – The Oakland Athletics defeat the Cincinnati Reds four games to three to capture Major League Baseball's World Series. It is the Athletics' first championship since 1930, when the franchise was in Philadelphia.", "October 25 – Belgian Eddy Merckx sets a new world hour record in cycling in Mexico City.", "October 26 – A coup in the Republic of Dahomey (actually Benin) led by Mathieu Kérékou removed a civilian government (which had been headed by a triumvirate consisting of Ahomadégbé, Apithy and Maga).", "October 28 – The Airbus A300 flies for the first time."]}, {"Month No.": "11", "Month-Day(s)-Events": ["November\nAt a scientific meeting in Honolulu, Herbert Boyer and Stanley N. Cohen conceive the concept of recombinant DNA. They publish their results in November 1973 in PNAS. Separately in 1972, Paul Berg also recombines DNA in a test tube. Recombinant DNA technology has dramatically changed the field of biological sciences, especially biotechnology, and opened the door to genetically modified organisms.\nThe Nishitetsu Lions baseball club, part of the NPB's Pacific League, is sold to the Fukuoka Baseball Corporation, a subsidiary of Nishi-Nippon Railroad. The team is renamed the Taiheiyo Club Lions.", "At a scientific meeting in Honolulu, Herbert Boyer and Stanley N. Cohen conceive the concept of recombinant DNA. They publish their results in November 1973 in PNAS. Separately in 1972, Paul Berg also recombines DNA in a test tube. Recombinant DNA technology has dramatically changed the field of biological sciences, especially biotechnology, and opened the door to genetically modified organisms.", "The Nishitetsu Lions baseball club, part of the NPB's Pacific League, is sold to the Fukuoka Baseball Corporation, a subsidiary of Nishi-Nippon Railroad. The team is renamed the Taiheiyo Club Lions.", "November 7 – 1972 United States presidential election: Republican incumbent Richard Nixon defeats Democratic Senator George McGovern in a landslide (the election had the lowest voter turnout since 1948, with only 55 percent of the electorate voting).", "November 11 – Vietnam War – Vietnamization: The United States Army turns over the massive Long Binh military base to South Vietnam.", "November 14 – The Dow Jones Industrial Average closes above 1,000 (1,003.16) for the first time.", "November 16 – The United Nations Educational, Scientific and Cultural Organization adopts the Convention Concerning the Protection of the World Cultural and Natural Heritage", "November 19 – Seán Mac Stíofáin, a leader of the Provisional Irish Republican Army, is arrested in Dublin after giving an interview to RTÉ.", "November 28 – The last executions in Paris, France. Roger Bontems and Claude Buffet – the Clairvaux Mutineers – are guillotined at La Santé Prison by chief executioner André Obrecht. Bontems, found not guilty of murder by the court, was condemned as Buffet's accomplice . President Georges Pompidou, in private an abolitionist, upholds both death sentences in deference to French public opinion.", "November 29 – The \"tea house\" Mellow Yellow opens on the Amstel River in Amsterdam, pioneering the legal sale of cannabis in the Netherlands."]}, {"Month No.": "12", "Month-Day(s)-Events": ["December 2 – 1972 Australian federal election: The Labor Party led by Gough Whitlam defeats the Liberal/Country Coalition Government led by Prime Minister William McMahon. Consequently, Whitlam becomes the first Labor Prime Minister of Australia since the defeat of Ben Chifley in 1949. Whitlam would be sworn in on December 5th; his first action using executive power was to withdraw all Australian personnel from the Vietnam War. McMahon resigned from the Liberal leadership almost immediately; he would be replaced by outgoing Treasurer Billy Snedden.", "December 7\nApollo 17 (Gene Cernan, Ronald Evans, Harrison Schmitt), the last manned Moon mission to date, is launched and The Blue Marble photograph of the Earth is taken. The mission also includes five mice.\nImelda Marcos is stabbed and seriously wounded by an assailant; her bodyguards shoot the assailant.", "Apollo 17 (Gene Cernan, Ronald Evans, Harrison Schmitt), the last manned Moon mission to date, is launched and The Blue Marble photograph of the Earth is taken. The mission also includes five mice.", "Imelda Marcos is stabbed and seriously wounded by an assailant; her bodyguards shoot the assailant.", "December 8\nUnited Airlines Flight 553 crashes short of the runway, killing 43 of 61 passengers and two people on the ground. A day later, over $10,000 cash is found in the purse of Watergate conspirator Howard Hunt's wife, who was on board.\nInternational Human Rights Day is proclaimed by the United Nations.", "United Airlines Flight 553 crashes short of the runway, killing 43 of 61 passengers and two people on the ground. A day later, over $10,000 cash is found in the purse of Watergate conspirator Howard Hunt's wife, who was on board.", "International Human Rights Day is proclaimed by the United Nations.", "December 11 – Apollo 17 lands on the Moon.", "December 14 – Apollo program: Eugene Cernan is the last person to walk on the Moon, after he and Harrison Schmitt complete the third and final Extra-vehicular activity (EVA) of Apollo 17. This is currently the last manned mission to the Moon.", "December 15\nThe Commonwealth of Australia ordains equal pay for women.\nThe United Nations Environment Programme is established as a specialized agency of the United Nations.", "The Commonwealth of Australia ordains equal pay for women.", "The United Nations Environment Programme is established as a specialized agency of the United Nations.", "December 16\nThe Constitution of Bangladesh comes into effect.\nThe Portuguese army kills 400 Africans in Tete, Mozambique.", "The Constitution of Bangladesh comes into effect.", "The Portuguese army kills 400 Africans in Tete, Mozambique.", "December 19 – Apollo program: Apollo 17 returns to Earth, concluding the program of lunar exploration.", "December 21 – ZANLA troopers attack Altera Farm in north-east Rhodesia.", "December 22\nAustralia establishes diplomatic relations with China and East Germany.\nA peace delegation that includes singer-activist Joan Baez and human rights attorney Telford Taylor visit Hanoi to deliver Christmas mail to American prisoners of war (they will be caught in the Christmas bombing of North Vietnam).", "Australia establishes diplomatic relations with China and East Germany.", "A peace delegation that includes singer-activist Joan Baez and human rights attorney Telford Taylor visit Hanoi to deliver Christmas mail to American prisoners of war (they will be caught in the Christmas bombing of North Vietnam).", "December 23\nThe 6.2 Mw Nicaragua earthquake kills 5,000–11,000 people in the capital Managua. President Anastasio Somoza Debayle is later accused of not distributing millions of dollars worth of foreign aid.\nSwedish Prime minister Olof Palme compares the American bombings of North Vietnam to Nazi massacres. The U.S. breaks diplomatic contact with Sweden.\nBraathens SAFE Flight 239, also known as the Asker Accident: Aircraft crashed during approach to Oslo Airport, Fornebu, Norway. Forty people on board were killed.", "The 6.2 Mw Nicaragua earthquake kills 5,000–11,000 people in the capital Managua. President Anastasio Somoza Debayle is later accused of not distributing millions of dollars worth of foreign aid.", "Swedish Prime minister Olof Palme compares the American bombings of North Vietnam to Nazi massacres. The U.S. breaks diplomatic contact with Sweden.", "Braathens SAFE Flight 239, also known as the Asker Accident: Aircraft crashed during approach to Oslo Airport, Fornebu, Norway. Forty people on board were killed.", "December 28 – The bones of Martin Bormann are discovered in Berlin.", "December 29 – Eastern Air Lines Flight 401 crashes into the Everglades in Florida, killing 101 of 176 on board. It is the first hull-loss of a wide-body aircraft.", "December 31 – For the first and last time, a 2nd leap second is added (23:59:60) to a year, making 1972 366 days and two seconds long, the longest year ever within the context of UTC."]}, {"Month No.": "13", "Month-Day(s)-Events": ["Colombian looters find Ciudad Perdida but keep it a secret until the government reveals it in 1975.", "The Socialist Federal Republic of Yugoslavia bans the cultural organization Matica hrvatska, founded in 1842."]}]