[{"Month No.": "1", "Month-Day(s)-Events": ["January 4 – U.S. President Jimmy Carter proclaims a grain embargo against the USSR with the support of the European Commission.", "January 6 – Global Positioning System time epoch begins at 00:00 UTC.", "January 9 – In Saudi Arabia, 63 Islamist insurgents are beheaded for their part in the siege of the Great Mosque in Mecca in November 1979.", "January 14 – Indira Gandhi returns to power as Prime Minister of India.", "January 20 – At least 200 people are killed when the Corralejas Bullring collapses at Sincelejo, Colombia.", "January 21 – The London Gold Fixing hits its highest price ever of $843 per troy ounce ($2,249.50 in 2020 when adjusted for inflation).", "January 22 – Andrei Sakharov, Soviet scientist and human rights activist, is arrested in Moscow.", "January 26 – Israel and Egypt establish diplomatic relations.", "January 27 – Canadian Caper: Six United States diplomats, posing as Canadians, manage to escape from Tehran, Iran, as they board a flight to Zürich, Switzerland, on Swissair.", "January 31 – Burning of the Spanish Embassy in Guatemala: The Spanish Embassy in Guatemala is invaded and set on fire, killing 36 people. In the United States, it is dubbed \"Spain's own Tehran\"."]}, {"Month No.": "2", "Month-Day(s)-Events": ["February 2 – Abscam: FBI personnel target members of the Congress of the United States in a sting operation.", "February 2 – 3 – The New Mexico State Penitentiary riot takes place; 33 inmates are killed and more than 100 inmates injured.", "February 4 – Abolhassan Banisadr is sworn in as the first President of Iran after winning the January 25 presidential election.", "February 13 – The 1980 Winter Olympics open in Lake Placid, New York.", "February 15 – In Vanuatu, followers of John Frum's cargo cult on the island of Tanna declare secession as the nation of Tafea.", "February 16 – A total solar eclipse is seen in North Africa and West Asia. It was the 50th solar eclipse of Solar Saros 130.", "February 23 – Ayatollah Ruhollah Khomeini states that Iran's parliament will decide the fate of the American embassy hostages.", "February 25 – A coup in Suriname ousts the government of Henck Arron; leaders Dési Bouterse and Roy Horb replace it with a National Military Council.", "February 27 – M-19 guerrillas begin the Dominican embassy siege in Colombia, holding 60 people hostage, including 14 ambassadors."]}, {"Month No.": "3", "Month-Day(s)-Events": ["March 1\nThe Commonwealth Trade Union Council is established.\nThe Voyager 1 probe confirms the existence of Janus, a moon of Saturn.", "The Commonwealth Trade Union Council is established.", "The Voyager 1 probe confirms the existence of Janus, a moon of Saturn.", "March 3 - Pierre Trudeau returns to office as Prime Minister of Canada.", "March 4 – Robert Mugabe is elected Prime Minister of Zimbabwe.", "March 8 – The Soviet Union's first rock music festival starts.", "March 14 – LOT Polish Airlines Flight 007 crashes during an emergency landing near Warsaw, Poland, killing a 14-man American boxing team and 73 others.", "March 18 – Fifty people are killed at the Plesetsk Cosmodrome in Russia, when a Vostok-2M rocket explodes on its launch pad during a fueling operation.", "March 19 – 20 – The MV Mi Amigo, the ship housing pirate radio station Radio Caroline, sinks off the English coast (the station returns aboard a new ship in 1983).", "March 21 – U.S. President Jimmy Carter announces that the United States will boycott the 1980 Summer Olympics in Moscow because of the Soviet invasion of Afghanistan.", "March 26 – A mine lift cage at the Vaal Reefs gold mine in South Africa falls 1.9 kilometres (1.2 mi), killing 23 workers.", "March 27 – The Norwegian oil platform Alexander L. Kielland collapses in the North Sea, killing 123 of its crew of 212.", "March 28 – The Talpiot Tomb is discovered by construction workers in Jerusalem."]}, {"Month No.": "4", "Month-Day(s)-Events": ["April 1 – The Southern African Development Coordination Conference (SADCC) is formed in Lusaka, Zambia.", "April 2 – The St Pauls riot breaks out in Bristol.", "April 7 – The United States severs diplomatic relations with Iran and imposes economic sanctions, following the taking of American hostages on November 4, 1979.", "April 10 – In Lisbon, Portugal, the governments of Spain and the United Kingdom agree to reopen the border between Gibraltar and Spain in 1985, closed since 1969.", "April 12\n1980 Liberian coup d'état: Samuel K. Doe overthrows the government of Liberia in a violent coup d'état, assassinating President William Tolbert and 26 other people and ending over 130 years of democratic presidential succession in that country.\nTerry Fox begins his Marathon of Hope, a plan to run across Canada to raise money for cancer research, setting off from St. Johns, Newfoundland and running westward.", "1980 Liberian coup d'état: Samuel K. Doe overthrows the government of Liberia in a violent coup d'état, assassinating President William Tolbert and 26 other people and ending over 130 years of democratic presidential succession in that country.", "Terry Fox begins his Marathon of Hope, a plan to run across Canada to raise money for cancer research, setting off from St. Johns, Newfoundland and running westward.", "April 14 – Iron Maiden's debut self-titled album Iron Maiden is released in the U.K.", "April 18 – Zimbabwe gains de jure independence from the United Kingdom with Robert Mugabe as its first Prime Minister.", "April 24 – 25 – Operation Eagle Claw, a commando mission in Iran to rescue American embassy hostages, is aborted after mechanical problems ground the rescue helicopters. Eight United States troops are killed in a mid-air collision during the failed operation.", "April 25 – Dan-Air Flight 1008 crashes in Tenerife, killing all 146 occupants; at the time it was the worst air disaster involving a British-registered aircraft in terms of loss of life.", "April 26 – Louise and Charmian Faulkner disappear from outside their flat in St Kilda, Victoria, Australia.", "April 27 – The Dominican embassy siege in Colombia ends with all remaining hostages released after the guerrillas are allowed to escape to Cuba.", "April 30\nIranian Embassy siege: Six Iranian-born terrorists take over the Iranian embassy in London, England. SAS retakes the Embassy on May 5; one terrorist survives.\nQueen Juliana of the Netherlands abdicates and her daughter Beatrix accedes to the throne.", "Iranian Embassy siege: Six Iranian-born terrorists take over the Iranian embassy in London, England. SAS retakes the Embassy on May 5; one terrorist survives.", "Queen Juliana of the Netherlands abdicates and her daughter Beatrix accedes to the throne."]}, {"Month No.": "5", "Month-Day(s)-Events": ["May 1 – \"About that Urban Renaissance...\", an article by journalist Dan Rottenberg in Chicago, contains the first recorded use of the word \"yuppie\".", "May 2 – Referendum on system of government held in Nepal.", "May 4 – Yugoslav President Josip Broz Tito dies. The largest state funeral in history is organized, with state delegations from 128 different countries out of 154 UN members at the time.", "May 7 – Paul Geidel, convicted of second-degree murder in 1911, is released from prison in Beacon, New York, after 68 years and 245 days (the longest-ever time served by an inmate).", "May 8 – Global eradication of smallpox certified by the World Health Organization.", "May 9\nIn Florida, United States, the Liberian freighter Summit Venture hits the Sunshine Skyway Bridge over Tampa Bay. A 1,400 foot (430 m) section of the bridge collapses and 35 people (most in a bus) are killed.\nJames Alexander George Smith \"Jags\" McCartney the Turks and Caicos Islands' first chief minister, is killed in a plane crash over New Jersey.", "In Florida, United States, the Liberian freighter Summit Venture hits the Sunshine Skyway Bridge over Tampa Bay. A 1,400 foot (430 m) section of the bridge collapses and 35 people (most in a bus) are killed.", "James Alexander George Smith \"Jags\" McCartney the Turks and Caicos Islands' first chief minister, is killed in a plane crash over New Jersey.", "May 14 – The Sumpul River massacre occurs in Chalatenango, El Salvador.", "May 17 – Internal conflict in Peru: On the eve of presidential elections, Maoist guerrilla group Shining Path attacks a polling location in the town of Chuschi, Ayacucho.", "May 18 – The 1980 eruption of Mount St. Helens volcano in Washington (state) kills 57 and causes US$3 billion in damage.", "May 18 – 27 – Gwangju Uprising: Students in Gwangju, South Korea, begin demonstrations, calling for democratic reforms.", "May 20 – 1980 Quebec referendum: Voters in Quebec reject by a vote of 60%, a proposal to seek independence from Canada.", "May 22 – Pac-Man, the highest-earning arcade game of all time, is released in Japan.", "May 24\nThe International Court of Justice calls for the release of U.S. Embassy hostages in Tehran.\nThe New York Islanders win their first Stanley Cup, on a goal by Bobby Nystrom in Game 6 overtime of the 1980 Stanley Cup Finals over the Philadelphia Flyers.", "The International Court of Justice calls for the release of U.S. Embassy hostages in Tehran.", "The New York Islanders win their first Stanley Cup, on a goal by Bobby Nystrom in Game 6 overtime of the 1980 Stanley Cup Finals over the Philadelphia Flyers.", "May 25 – Indianapolis 500: Johnny Rutherford wins for a third time in car owner Jim Hall's revolutionary ground effect Chaparral car; the victory is Hall's second as an owner.", "May 26\nJohn Frum supporters in Vanuatu storm government offices on the island of Tanna. Vanuatu government troops land the next day and drive them away.\nIn South Korea, military government forces and pro-democracy protesters clash; 2,000 protesters die.", "John Frum supporters in Vanuatu storm government offices on the island of Tanna. Vanuatu government troops land the next day and drive them away.", "In South Korea, military government forces and pro-democracy protesters clash; 2,000 protesters die.", "May 28 – A fiery bus crash near the small village of Webb, Saskatchewan, Canada, claims 22 lives."]}, {"Month No.": "6", "Month-Day(s)-Events": ["June 1 – The first 24-hour news channel, Cable News Network (CNN) is launched.", "June 3 – 1980 Grand Island tornado outbreak: A series of deadly tornadoes strikes Grand Island, Nebraska, causing over $300m in damage, killing five people and injuring over 250.", "June 10 – Apartheid: The African National Congress in South Africa publishes a statement by their imprisoned leader Nelson Mandela.", "June 23 – September 6 – The 1980 United States heat wave claims 1,700 lives.", "June 23\nSanjay Gandhi, the politically influential son of prime minister Indira Gandhi, is killed in a plane crash.\nTim Berners-Lee begins work on ENQUIRE, the system that will eventually lead to the creation of the World Wide Web in autumn 1990.", "Sanjay Gandhi, the politically influential son of prime minister Indira Gandhi, is killed in a plane crash.", "Tim Berners-Lee begins work on ENQUIRE, the system that will eventually lead to the creation of the World Wide Web in autumn 1990.", "June 25 – A Muslim Brotherhood assassination attempt against Syrian president Hafez al-Assad fails. Assad retaliates by sending the army against them.", "June 27\nItavia Flight 870 crashes into the sea near Ustica island, Italy, killing all 81 people on board. The cause of the accident remains unclear.\nU.S. President Jimmy Carter signs Proclamation 4771, requiring 18- to 25-year-old males to register for a peacetime military draft, in response to the Soviet invasion of Afghanistan.", "Itavia Flight 870 crashes into the sea near Ustica island, Italy, killing all 81 people on board. The cause of the accident remains unclear.", "U.S. President Jimmy Carter signs Proclamation 4771, requiring 18- to 25-year-old males to register for a peacetime military draft, in response to the Soviet invasion of Afghanistan.", "June 29 – Vigdís Finnbogadóttir is elected President of Iceland, making her the first woman democratically elected as head of state."]}, {"Month No.": "7", "Month-Day(s)-Events": ["July 8 – A wave of strikes begins in Lublin, Poland.", "July 9 – Pope John Paul II visits Brazil; seven people are crushed to death in a crowd waiting to see him at afternoon Mass at the stadium in Fortaleza.", "July 16 – Former California Governor and actor Ronald Reagan is nominated for U.S. president, at the 1980 Republican National Convention in Detroit. Influenced by the Religious Right, the convention also drops its long-standing support for the Equal Rights Amendment, dismaying moderate Republicans.", "July 19 – Former Turkish Prime Minister Nihat Erim is killed by two gunmen in Istanbul, Turkey.", "July 19 – August 3 – The 1980 Summer Olympics are held in Moscow, Soviet Union. 82 countries boycott the Games, athletes from 16 of them participate under a neutral flag.", "July 25 – The album Back in Black is released by the Australian band AC/DC.", "July 27 – Mohammad Reza Pahlavi, deposed Shah of Iran, dies in Cairo.", "July 30\nVanuatu gains independence.\nIsrael's Knesset passes the Jerusalem Law.", "Vanuatu gains independence.", "Israel's Knesset passes the Jerusalem Law."]}, {"Month No.": "8", "Month-Day(s)-Events": ["August 1 – Vigdís Finnbogadóttir becomes the 4th President of Iceland, the world's first democratically directly elected female president.", "August 2 – Strage di Bologna: A terrorist bombing at the Bologna Centrale railway station in Italy kills 85 people and wounds more than 200."]}, {"Month No.": "9", "Month-Day(s)-Events": ["August 4 – Hurricane Allen (category 5) pounds Haiti, where it kills more than 200 people.", "August 7–31 – Lech Wałęsa leads the first of many strikes at the Gdańsk Shipyard in the Polish People's Republic.", "August 17 – In Australia, baby Azaria Chamberlain disappears from a campsite at Ayers Rock (Uluru), reportedly taken by a dingo.", "August 19 – In one of aviation's worst disasters, 301 people are killed when Saudia Flight 163 catches fire in Riyadh, Saudi Arabia.", "August 31 – Victory of the strike in Gdańsk Shipyard, Poland. The Gdańsk Agreement is signed, opening a way to start the first free (i.e. not state-controlled) trade union in the communist bloc, \"Solidarity\" (Solidarność)."]}, {"Month No.": "10", "Month-Day(s)-Events": ["September 1 – Terry Fox is forced to end his Marathon of Hope run outside of Thunder Bay, Ontario, Canada, after finding out that the cancer has spread to his lungs.", "September 2 – Ford Europe launches the Escort MK3, a new front-wheel drive hatchback.", "September 3 – Zimbabwe breaks diplomatic and consular relations with South Africa, even though it maintains a commercial mission in Johannesburg.", "September 5 – The Gotthard Road Tunnel opens in Switzerland as the world's longest highway tunnel at 16.3 kilometres (10.1 mi), stretching from Göschenen to Airolo beneath the Gotthard Pass.", "September 12 – Kenan Evren stages a military coup in Turkey. It stops political gang violence, but begins stronger state violence leading to the execution of many young activists.", "September 17 – After weeks of strikes at the Lenin Shipyard in Gdańsk, Poland, the nationwide independent trade union Solidarity is established.", "September 21 – Bülent Ulusu, ex admiral, forms the new government of Turkey (44th government, composed mostly of technocrats).", "September 22 – The command council of Iraq orders its army to \"deliver its fatal blow on Iranian military targets\", initiating the Iran–Iraq War.", "September 26\nOktoberfest bombing: 13 people are killed and 211 injured in a right-wing terror attack in Munich (West Germany).\nThe Mariel boatlift in Cuba officially ends.", "Oktoberfest bombing: 13 people are killed and 211 injured in a right-wing terror attack in Munich (West Germany).", "The Mariel boatlift in Cuba officially ends.", "September 30 – Digital Equipment Corporation, Intel and Xerox introduce the DIX standard for Ethernet, which is the first implementation outside of Xerox and the first to support 10 Mbit/s speeds."]}, {"Month No.": "11", "Month-Day(s)-Events": ["October 5\nThe Elisabeth blast furnace is demolished at Bilston Steelworks, marking the end of iron and steel production in the Black Country region of the UK.\nBritish Leyland launches its new Metro, a three-door entry-level hatchback which is designed as the eventual replacement for the Mini. It gives BL a long-awaited modern competitor for the likes of the Ford Fiesta and Vauxhall Chevette.", "The Elisabeth blast furnace is demolished at Bilston Steelworks, marking the end of iron and steel production in the Black Country region of the UK.", "British Leyland launches its new Metro, a three-door entry-level hatchback which is designed as the eventual replacement for the Mini. It gives BL a long-awaited modern competitor for the likes of the Ford Fiesta and Vauxhall Chevette.", "October 10 – The 7.1 Mw  El Asnam earthquake shakes northern Algeria with a maximum Mercalli intensity of X (Extreme), killing 2,633–5,000 and injuring 8,369–9,000.", "October 14\nThe Staggers Rail Act is enacted, deregulating American railroads.\nThe 6th Congress of the Workers' Party ended, having anointed North Korean President Kim Il-sung's son Kim Jong-il as his successor.", "The Staggers Rail Act is enacted, deregulating American railroads.", "The 6th Congress of the Workers' Party ended, having anointed North Korean President Kim Il-sung's son Kim Jong-il as his successor.", "October 15 – James Callaghan announces his resignation as leader of the British Labour Party.", "October 18 – 1980 Australian federal election: Malcolm Fraser's Liberal/National Country Coalition Government is re-elected with a substantially reduced majority, defeating the Labor Party led by Bill Hayden. The Government also loses control of the Senate, with the Australian Democrats winning the balance of power.", "October 20\nGreece rejoins the NATO military structure.\nIn continuous production since 1962, the last MG MGB roadster rolls off the assembly line at the Abingdon-on-Thames (England) factory, ending production for the MG Cars marque.", "Greece rejoins the NATO military structure.", "In continuous production since 1962, the last MG MGB roadster rolls off the assembly line at the Abingdon-on-Thames (England) factory, ending production for the MG Cars marque.", "October 21 – In Major League Baseball, The Philadelphia Phillies of the National League defeat the Kansas City Royals of the American League, 4–1, in Game Six of the World Series to win the championship.", "October 25 – Proceedings on the Hague Convention on the Civil Aspects of International Child Abduction conclude at The Hague.", "October 27 – Six Provisional Irish Republican Army prisoners in Maze prison in Northern Ireland refuse food and demand status as political prisoners; the hunger strike lasts until December.", "October 30 – El Salvador and Honduras sign a peace treaty to put the border dispute fought over in 1969's Football War before the International Court of Justice.", "October 31\nThe Polish government recognizes Solidarity.\nReza Pahlavi, eldest son of the Shah of Iran, proclaims himself the rightful successor to the Peacock Throne.", "The Polish government recognizes Solidarity.", "Reza Pahlavi, eldest son of the Shah of Iran, proclaims himself the rightful successor to the Peacock Throne."]}, {"Month No.": "12", "Month-Day(s)-Events": ["November 4 – 1980 United States presidential election: Republican challenger and former Governor Ronald Reagan of California defeats incumbent Democratic President Jimmy Carter and was elected the 40th President of the United States.", "November 10 – 12 – Voyager program: The NASA space probe Voyager I makes its closest approach to Saturn, when it flies within 77,000 miles (124,000 km) of the planet's cloud-tops and sends the first high resolution images of the world back to scientists on Earth.", "November 20 – The Gang of Four trial begins in China.", "November 21\nA fire at the MGM Grand Hotel and Casino on the Las Vegas Strip kills 85 people.\nA record number of viewers on this date (for an entertainment program) tune into the U.S. television show Dallas to learn who shot lead character J. R. Ewing. The \"Who shot J.R.?\" event is an international obsession.", "A fire at the MGM Grand Hotel and Casino on the Las Vegas Strip kills 85 people.", "A record number of viewers on this date (for an entertainment program) tune into the U.S. television show Dallas to learn who shot lead character J. R. Ewing. The \"Who shot J.R.?\" event is an international obsession.", "November 23 – The 6.9 Mw  Irpinia earthquake shakes southern Italy with a maximum Mercalli intensity of X (Extreme).  Officially, there were 2,483 people killed and 8,934 injured, though the deaths may have been as high as 4,900."]}, {"Month No.": "13", "Month-Day(s)-Events": ["December 2 – A missionary (Jean Donovan) and three Roman Catholic nuns (Maura Clarke, Ita Ford, Dorothy Kazel), all Americans, are murdered by a military death squad in El Salvador while doing charity work during that country's civil war.", "December 8 – Murder of John Lennon: Mark David Chapman is arrested following the murder of English musician John Lennon, formerly of the Beatles, outside his New York City apartment building, The Dakota.", "December 14 – Four people are murdered and four others are injured by two armed robbers at Bob's Big Boy on La Cienega Boulevard in Los Angeles, in what is one of the city's most brutal crimes ever.", "December 15 – The Academia de la Llingua Asturiana (Academy of the Asturian language) is created.", "December 16 – During a summit on the island of Bali, OPEC decides to raise the price of petroleum by 10%."]}]