[{"Month No.": "1", "Month-Day(s)-Events": ["January 3 – Flash Airlines Flight 604 crashes into the Red Sea off the coast of Egypt, killing all 148 aboard, making it one of the deadliest aviation accidents in Egyptian history at the time.", "January 4 – NASA's MER-A (Spirit) spacecraft lands on the surface of Mars.", "January 6 - Construction on the tallest man-made structure to date, the Burj Khalifa begins in Dubai UAE", "January 8 – The RMS Queen Mary 2, at the time the largest ocean liner ever built, is christened by its namesake's granddaughter, Queen Elizabeth II.", "January 25 – NASA's MER-B (Opportunity) spacecraft lands on the surface of Mars.", "January 26 – The MyDoom virus is first identified."]}, {"Month No.": "2", "Month-Day(s)-Events": ["February 4 – Mark Zuckerberg launches The Facebook, later renamed to Facebook, a social networking website for Harvard University students.", "February 26 – Macedonian president Boris Trajkovski is killed in a plane crash near Mostar, Bosnia and Herzegovina.", "February 29 – Haitian president Jean-Bertrand Aristide is overthrown in a coup d'état."]}, {"Month No.": "3", "Month-Day(s)-Events": ["March 2 – A series of bombings occur in Karbala, Iraq, killing over 140 Shia Muslims commemorating the Day of Ashura.", "March 7 – The 2004 Greek legislative election is held to elect all 300 members of the Hellenic Parliament and the New Democracy party, led by Kostas Karamanlis, won 165 out of 300 seats, ending over 11 years of rule by the PASOK party.", "March 11 – Al-Qaeda bombings on Cercanías trains in Madrid, Spain, kill at least 192 people.", "March 14 – The PSOE wins the election in Spain; José Luis Rodríguez Zapatero is elected Prime Minister of Spain, replacing José María Aznar.", "March 28 – Hurricane Catarina, the first ever recorded South Atlantic tropical cyclone, makes landfall in Santa Catarina, Brazil.", "March 29 – Bulgaria, Estonia, Latvia, Lithuania, Romania, Slovakia and Slovenia are admitted to NATO, the largest expansion of the organization."]}, {"Month No.": "4", "Month-Day(s)-Events": ["April 8 – The Humanitarian Ceasefire Agreement is signed by the Sudanese government and two rebel groups, in order to put a pause on the War in Darfur.", "April 17 – Israeli helicopters fire missiles at a convoy of vehicles in the Gaza Strip, killing Hamas leader Abdel Aziz al-Rantisi.", "April 24 – Referendums on the Annan Plan for Cyprus, which proposes to reunite the island, take place in both the Greek-controlled and the Turkish-controlled parts. Although the Turkish Cypriots vote in favour, the Greek Cypriots reject the proposal."]}, {"Month No.": "5", "Month-Day(s)-Events": ["May 1 – The European Union expands by 10 new member states: Cyprus, the Czech Republic, Estonia, Hungary, Latvia, Lithuania, Malta, Poland, Slovakia, and Slovenia.", "May 12–15 – The Eurovision Song Contest 2004 takes place in Istanbul, Turkey, and is won by Ukrainian entrant Ruslana with the song \"Wild Dances\"."]}, {"Month No.": "6", "Month-Day(s)-Events": ["June 1 – A United Nations peacekeeping mission in Haiti begins, the United Nations Stabilisation Mission in Haiti (MINUSTAH).", "June 4 – Marvin Heemeyer Destroyed 13 Buildings With the Killdozer, In Granby, Colorado. The Cause Of damage was estimated around $7 million dollars.", "June 8 – 2004 transit of Venus.", "June 12–July 4 – Portugal hosts the UEFA Euro 2004 football tournament, which is won by Greece.", "June 21 – In Mojave, California, United States, SpaceShipOne becomes the first privately funded spaceplane to achieve spaceflight.", "June 28 – The U.S.-led coalition occupying Iraq, the Coalition Provisional Authority (CPA), transfers sovereignty to the Iraqi Interim Government.", "June 30 – Preliminary hearings begin in Iraq in the trial of president Saddam Hussein, for war crimes and crimes against humanity."]}, {"Month No.": "7", "Month-Day(s)-Events": ["July 1 – The unpiloted Cassini–Huygens spacecraft arrives at Saturn.", "July 11 – The Russian Federation stops recognizing Soviet Union passports as legal identification."]}, {"Month No.": "8", "Month-Day(s)-Events": ["August 1 – A fire in the \"Ycua Bolaños-Botánico\" supermarket in Asunción, Paraguay kills around 400 people.", "August 3 – NASA's unpiloted MESSENGER spacecraft is launched, with its primary mission being the study of Mercury.", "August 12 – Lee Hsien Loong is sworn in as the third Prime Minister of Singapore.", "August 13–29 – The 2004 Summer Olympics are held in Athens, Greece.", "August 22 – Armed robbers steal Edvard Munch's The Scream, Madonna, and other paintings from the Munch Museum in Oslo, Norway.", "August 24 – After departing Domodedovo International Airport in Moscow, Volga-AviaExpress Flight 1303, a Tupolev Tu-134, explodes over Russia's Tula Oblast and crashes, killing all 43 people on board; minutes later, Siberia Airlines Flight 1047, a Tupolev Tu-154 departing the same airport, explodes over Rostov Oblast and crashes, killing all 46 on board. The Government of Russia declares the explosions to have been caused by female Chechen suicide bombers.", "August 29 – Michael Schumacher won his 7th and last World Championship with Scuderia Ferrari in F1"]}, {"Month No.": "9", "Month-Day(s)-Events": ["September 1 – Beslan school siege: Chechen rebels take 1,128 people, mostly children, hostage at a school in Beslan, Russia. The crisis ends when Russian security forces storm the building, resulting in more than 330 people being killed.", "September 9 – A car bomb of the Jemaah Islamiyah explodes at the Australian embassy in Jakarta, Indonesia, killing 9 people.", "September – At Mazara del Vallo in Sicily, 3-year-old Denise Pipitone is declared missing; the case is reopened in 2021."]}, {"Month No.": "10", "Month-Day(s)-Events": ["October 8 – Suicide bombers detonate two bombs at the Red Sea resort of Taba, Egypt, killing 34 people and injuring 171, mostly Israeli tourists.", "October 9 – 2004 Australian federal election: John Howard's Liberal/National Coalition Government is re-elected with an increased majority, defeating the Labor Party led by Mark Latham.", "October 19 – A team of explorers reach the bottom of Krubera Cave, the world's deepest cave, with a depth of 2,080 meters (6,824 feet).", "October 20 – Susilo Bambang Yudhoyono is sworn in as the 6th President of Indonesia, becoming the first directly elected president in Indonesia.", "October 27 – The Boston Red Sox win the World Series for the sixth time after completing a sweep of the St. Louis Cardinals. It was their first championship since 1918.", "October 29 – European heads of state sign in Rome the Treaty and Final Act, establishing the first European Constitution."]}, {"Month No.": "11", "Month-Day(s)-Events": ["November 2 – 2004 United States presidential election: George W. Bush is re-elected President of the United States, defeating his Democratic challenger John Kerry.", "November 5 – The Incredibles is released in the US.", "November 13 – The European Space Agency probe SMART-1 arrives at the Moon, becoming the first European satellite to fly to the Moon and orbit it.", "November 16 – NASA's hypersonic Scramjet breaks a record by reaching a velocity of about 7,000 mph (Mach 9.6) in an unpiloted experimental flight.", "November 19 – Nickelodeon's The SpongeBob SquarePants Movie, based of the cartoon of the same name is released, earning $9,559,752 on it's opening day in the United States, and then $85,417,988 on the weekend alone only behind National Treasure.", "November 22 – The Orange Revolution begins, following a disputed presidential election in Ukraine where Viktor Yanukovych won against Viktor Yushchenko amid accusations of electoral fraud. A revote results in Yushchenko being declared the winner."]}, {"Month No.": "12", "Month-Day(s)-Events": ["December 8 – Former Pantera guitarist Dimebag Darrell is murdered on stage, at the Alrosa Villa, in Columbus, Ohio.", "December 14 – The world's tallest bridge, the Millau Viaduct over the Tarn in the Massif Central mountains, France, is officially opened.", "December 21 – Iraqi insurgents attack a U.S. military base in the city of Mosul, killing 22 people.", "December 26 – The 9.1–9.3 Mw  Indian Ocean earthquake shakes northern Sumatra with a maximum Mercalli intensity of IX (Violent). One of the largest observed tsunamis follows, affecting coastal areas of Thailand, India, Sri Lanka, Somalia, the Maldives, Malaysia, Myanmar, Bangladesh, and Indonesia, killing over 200,000 people.", "December 27 – Astrophysicists from the Max Planck Institute for Extraterrestrial Physics in Garching near Munich measure the strongest burst from a magnetar. At 21:30:26 UT Earth is hit by a huge wave front of gamma and X-rays. It is the strongest flux of high-energetic gamma radiation measured so far.", "December 30 – A fire in the República Cromañón nightclub in Buenos Aires, Argentina kills 194.", "December 31 – Taipei 101, at the time the tallest skyscraper in the world, standing at a height of 1,670 feet (510 m), officially opens."]}, {"Month No.": "13", "Month-Day(s)-Events": ["Metrocable (Medellín) Line K opens, the first modern urban transit cable car.", "The term Semantic social networks is coined independently by Stephen Downes and Marco Neumann."]}]