[{"Month No.": "1", "Month-Day(s)-Events": ["January 1 – Cyprus and Malta adopt the euro currency.", "January 14 – At 19:04:39 UTC, the uncrewed MESSENGER space probe is at its closest approach during its first flyby of the planet Mercury.", "January 21\nStock markets around the world plunge amid growing fears of a U.S. Great Recession, fueled by the 2007 subprime mortgage crisis.\nOnline activist group Anonymous initiates Project Chanology, after a leaked interview of Tom Cruise by the Church of Scientology is published on YouTube, and the Church of Scientology issued a \"copyright infringement\" claim. In response, Anonymous sympathizers took to the streets to protest outside the church (after February 10), while the church's websites and centres were getting DoS attacks, phone line nukes, and black faxes.", "Stock markets around the world plunge amid growing fears of a U.S. Great Recession, fueled by the 2007 subprime mortgage crisis.", "Online activist group Anonymous initiates Project Chanology, after a leaked interview of Tom Cruise by the Church of Scientology is published on YouTube, and the Church of Scientology issued a \"copyright infringement\" claim. In response, Anonymous sympathizers took to the streets to protest outside the church (after February 10), while the church's websites and centres were getting DoS attacks, phone line nukes, and black faxes.", "January 24 – A peace deal is signed in Goma, Democratic Republic of the Congo, ending the Kivu conflict.", "February 17 – Kosovo formally declares independence from Serbia, to a mixed response from the international community.", "February 18 – WikiLeaks releases allegations of illegal activities carried out by the Cayman Islands branch of Swiss banking corporation Julius Baer; a subsequent lawsuit against WikiLeaks prompts a temporary suspension of the website, but uproar about violations of freedom of speech causes WikiLeaks to be brought back online."]}, {"Month No.": "2", "Month-Day(s)-Events": ["March 2 – Venezuela and Ecuador move troops to the Colombian border, following a Colombian raid against FARC guerrillas inside Ecuadorian territory, in which senior commander Raúl Reyes is killed.", "March 8 – Barisan National loses two-thirds majority, for the first time since 1969, to opposition during the 2008 Malaysian general election but still retains control of government. The coalition also loses majority control of five states to the opposition.", "March 9 – The first European Space Agency Automated Transfer Vehicle, a cargo spacecraft for the International Space Station, launches from Guiana Space Centre in French Guiana.", "March 19 – An Energy release of a Gamma-ray burst called the GRB 080319B is the brightest event ever recorded in the Universe.", "March 24 – Bhutan holds its first-ever general elections following the adoption of a new Constitution which changed the country from an absolute monarchy to a multiparty democracy.", "March 25 – African Union and Comoros forces invade the rebel-held island of Anjouan, returning the island to Comorian control."]}, {"Month No.": "3", "Month-Day(s)-Events": ["May 3 – Cyclone Nargis passes through Myanmar, killing more than 138,000 people.", "May 12 – An earthquake measuring 7.9 on the moment magnitude scale strikes Sichuan, China, killing an estimated 87,000 people.", "May 20–24 – The Eurovision Song Contest 2008 takes place in Belgrade, Serbia, and is won by Russian entrant Dima Bilan with the song \"Believe\".", "May 21\nManchester United wins their third European Cup after they beat Chelsea in the first all-English final in the history of the European Cup. Manchester United won the match 6–5 on penalties, following a 1–1 draw after extra time.\nThe Union of South American Nations, an intergovernmental organization between states in South America, is founded.\nThe International Court of Justice awards Middle Rocks to Malaysia and Pedra Branca to Singapore, ending a 29-year territorial dispute between the two countries.", "Manchester United wins their third European Cup after they beat Chelsea in the first all-English final in the history of the European Cup. Manchester United won the match 6–5 on penalties, following a 1–1 draw after extra time.", "The Union of South American Nations, an intergovernmental organization between states in South America, is founded.", "The International Court of Justice awards Middle Rocks to Malaysia and Pedra Branca to Singapore, ending a 29-year territorial dispute between the two countries.", "May 25 – NASA's uncrewed Phoenix spacecraft becomes the first to land on the northern polar region of Mars.", "May 28 – The Legislature Parliament of Nepal votes overwhelmingly in favor of abolishing the country's 240-year-old monarchy, turning the country into a republic.", "May 30 – International Convention on Cluster Munitions is adopted in Dublin.", "June 7–29 – Austria and Switzerland jointly host the UEFA Euro 2008 football tournament, which is won by Spain.", "June 11\nThe Fermi Gamma-ray Space Telescope is launched.\nCanadian Prime Minister Stephen Harper formally apologizes, on behalf of the Canadian government, to the country's First Nations for the Canadian Indian residential school system.", "The Fermi Gamma-ray Space Telescope is launched.", "Canadian Prime Minister Stephen Harper formally apologizes, on behalf of the Canadian government, to the country's First Nations for the Canadian Indian residential school system.", "June 14 – Expo 2008 opens in Zaragoza, Spain, lasting to September 14, with the topic \"Water and sustainable development\".", "June 21 Chia Kikov is declared 2008 champion after beating Eli Sdayeb in combat"]}, {"Month No.": "4", "Month-Day(s)-Events": ["July 2 – Íngrid Betancourt and 14 other hostages are rescued from FARC rebels by Colombian security forces.", "July 11 – South Korea suspends all trips to North Korea's Mount Kumgang after a 53-year-old South Korean tourist is shot and killed by a North Korean sentry.", "July 21 – Radovan Karadžić, the first president of the Republika Srpska, is arrested in Belgrade, Serbia, on allegations of war crimes, following a 12-year-long manhunt.", "August 1 – India and United States sign the historic Civil Nuclear deal.", "August 1 – Eleven mountaineers from international expeditions die on K2, the second-highest mountain on Earth, in the worst single accident in the history of K2 mountaineering.", "August 6 – President Sidi Ould Cheikh Abdallahi of Mauritania is deposed in a military coup d'état.", "August 7 – Georgia invades the breakaway state of South Ossetia, sparking a war with Russia as the latter intervenes in support of separatists in both South Ossetia and Abkhazia.", "August 8–24 – The 2008 Summer Olympics take place in Beijing, China.", "August 20 – Spanair Flight 5022 crashes at Madrid–Barajas Airport, killing 154 people on board"]}, {"Month No.": "5", "Month-Day(s)-Events": ["September 5 – Quentin Bryce becomes the first female Governor-General of Australia.", "September 10 – The proton beam is circulated for the first time in the Large Hadron Collider, the world's largest and highest-energy particle accelerator, located at CERN, near Geneva, under the Franco-Swiss border.", "September 15 – Stocks fall sharply Monday on a triptych of Wall Street woe: Lehman Brothers' bankruptcy filing, Merrill Lynch's acquisition by Bank of America, and AIG's unprecedented request for short-term financing from the Federal Reserve.", "September 20 – A suicide truck bomb explosion destroys the Marriott Hotel in Islamabad, Pakistan, killing at least 54 and injuring 266.", "September 28 – SpaceX Falcon 1 becomes the world's first privately developed space launch vehicle to successfully make orbit.", "October 3 – Global financial crisis: U.S. President George W. Bush signs the revised Emergency Economic Stabilization Act into law, creating a 700 billion dollar Treasury fund to purchase failing bank assets.", "October 6 – A controversial Peruvian tape regarding a Norwegian oil company causes the 2008 Peru oil scandal, sparking protests which cause Jorge de Castillo's resignation from office.", "October 21 – The Large Hadron Collider (LHC) is officially inaugurated at Geneva.", "October 22 – The Indian Space Research Organisation successfully launches the Chandrayaan-1 spacecraft on a lunar exploration mission."]}, {"Month No.": "6", "Month-Day(s)-Events": ["November 1 – Satoshi Nakamoto publishes \"Bitcoin: A Peer-to-Peer Electronic Cash System\".", "November 2 – In a race won by Brazilian driver Felipe Massa, British driver Lewis Hamilton ends in 5th place in 2008 Brazilian Grand Prix and becomes the first black driver to win the Formula One World Championship, and the second youngest driver to achieve the feat at the age of 23.", "November 4 – – 2008 United States presidential election: Democratic U.S. Senator Barack Obama defeats Republican candidate John McCain and is elected the 44th President of the United States, making him the first African-American to be elected to the office.", "November 19 – Claudia Castillo of Spain becomes the first person to have a successful trachea transplant using a tissue-engineered organ.", "November 26–29 – Members of Lashkar-e-Taiba carry out four days of coordinated bombing and shooting attacks across Mumbai, killing 164 people.", "December 10 – The Channel Island of Sark, a British Crown dependency, holds its first fully democratic elections under a new constitutional arrangement, becoming the last European territory to abolish feudalism.", "December 18 –  The International Criminal Tribunal for Rwanda finds Théoneste Bagosora and two other senior Rwandan army officers guilty of genocide, crimes against humanity and war crimes and sentences them to life imprisonment for their role in the Rwandan genocide.", "December 23 – A military coup d'état deposes the government of Guinea shortly after the death of longtime President Lansana Conté.", "December 27 – Israel invades the Gaza Strip, in response to rockets being fired into Israeli territory by Hamas, and due to weapons being smuggled into the area.", "December 31 – An extra leap second (23:59:60) is added to end the year. The last time this occurred was in 2005."]}, {"Month No.": "7", "Month-Day(s)-Events": ["European Certification and Qualification Association is founded.", "National Disaster Recovery Fund, a disaster management fund is established by the Government of Jamaica."]}, {"Month No.": "8", "Month-Day(s)-Events": ["April 16 – Princess Eléonore of Belgium", "June 3 – Harshaali Malhotra, Indian actress and model", "June 10 – Sara James, Polish singer and songwriter"]}, {"Month No.": "9", "Month-Day(s)-Events": ["January 2 – Galyani Vadhana, Princess of Naradhiwas and Princess of Thailand (b. 1923)", "January 3\nAleksandr Abdulov, Soviet/Russian actor (b. 1953)\nChoi Yo-sam, Korean boxer (b. 1972)", "Aleksandr Abdulov, Soviet/Russian actor (b. 1953)", "Choi Yo-sam, Korean boxer (b. 1972)", "January 7 – Philip Agee, American spy and writer (b. 1935)", "January 10\nChristopher Bowman, American figure skater (b. 1967)\nMaila Nurmi, Finnish-American actress and television personality (b. 1922)", "Christopher Bowman, American figure skater (b. 1967)", "Maila Nurmi, Finnish-American actress and television personality (b. 1922)", "January 11 – Edmund Hillary, New Zealand mountaineer, explorer, and philanthropist (b. 1919)", "January 14 – Judah Folkman, American medical scientist (b. 1933)", "January 15 – Brad Renfro, American actor (b. 1982)", "January 16 – Nikola Kljusev, first Prime Minister of Macedonia (b. 1927)", "January 17\nBobby Fischer, American chess grandmaster and former World Chess Champion (b. 1943)\nAllan Melvin, American actor (b. 1923)", "Bobby Fischer, American chess grandmaster and former World Chess Champion (b. 1943)", "Allan Melvin, American actor (b. 1923)", "January 18 – Lois Nettleton, American actress (b. 1927)", "January 19 – Suzanne Pleshette, American actress (b. 1937)", "January 21 – Marie Smith Jones, Native American speaker (b. 1918)", "January 22\nCao Văn Viên, South Vietnamese general and Chair of the South Vietnamese Joint General Staff (b. 1921)\nHeath Ledger, Australian actor (b. 1979)\nClaude Piron, Swiss linguist and psychologist (b. 1931)", "Cao Văn Viên, South Vietnamese general and Chair of the South Vietnamese Joint General Staff (b. 1921)", "Heath Ledger, Australian actor (b. 1979)", "Claude Piron, Swiss linguist and psychologist (b. 1931)", "January 25 – Aziz Sedky, 36th prime minister of Egypt (b. 1920)", "January 26 – George Habash, Palestinian politician (b. 1926)", "January 27\nGordon B. Hinckley, American Mormon leader (b. 1910)\nSuharto, 2nd President of Indonesia (b. 1921)", "Gordon B. Hinckley, American Mormon leader (b. 1910)", "Suharto, 2nd President of Indonesia (b. 1921)", "January 28 – Archbishop Christodoulos of Athens (b. 1939)", "January 29 – Margaret Truman, American singer and writer (b. 1924)", "January 30 – Marcial Maciel, Mexican Catholic priest (b. 1920)", "January 31 – František Čapek, Czechoslovakian canoeist (b. 1914)"]}, {"Month No.": "10", "Month-Day(s)-Events": ["February 2\nJoshua Lederberg, American Nobel molecular biologist (b. 1925)\nBarry Morse, English-Canadian actor (b. 1918)", "Joshua Lederberg, American Nobel molecular biologist (b. 1925)", "Barry Morse, English-Canadian actor (b. 1918)", "February 5 – Maharishi Mahesh Yogi, Indian spiritual leader (b. 1918)", "February 6 – John Alvin, American cinematic artist and painter (b. 1948)", "February 7 – Andrew Bertie, 78th Grand Master of the Order of Malta (b. 1929)", "February 9 – Baba Amte, Indian social activist (b. 1914)", "February 10 – Roy Scheider, American actor (b. 1932)", "February 11\nTom Lantos, Hungarian-American politician (b. 1928)\nAlfredo Reinado, East Timorese rebel (b. 1967)", "Tom Lantos, Hungarian-American politician (b. 1928)", "Alfredo Reinado, East Timorese rebel (b. 1967)", "February 12\nImad Mughniyah, Lebanese militant (b. 1962)\nBadri Patarkatsishvili, Georgian businessman and politician (b. 1955)", "Imad Mughniyah, Lebanese militant (b. 1962)", "Badri Patarkatsishvili, Georgian businessman and politician (b. 1955)", "February 13\nKon Ichikawa, Japanese film director (b. 1915)\nHenri Salvador, French singer (b. 1917)", "Kon Ichikawa, Japanese film director (b. 1915)", "Henri Salvador, French singer (b. 1917)", "February 16 – Brendan Hughes, Northern Irish paramilitary leader (b. 1948)", "February 18 – Alain Robbe-Grillet, French writer and filmmaker (b. 1922)", "February 19\nNatalia Bessmertnova, Russian ballerina (b. 1941)\nYegor Letov, Russian singer (b. 1964)", "Natalia Bessmertnova, Russian ballerina (b. 1941)", "Yegor Letov, Russian singer (b. 1964)", "February 23\nJanez Drnovšek, two-time prime minister and second president of Slovenia (b. 1950)\nPaul Frère, Belgian racing driver (b. 1917)", "Janez Drnovšek, two-time prime minister and second president of Slovenia (b. 1950)", "Paul Frère, Belgian racing driver (b. 1917)", "February 25 – Static Major, American musician (b. 1974)", "February 27\nWilliam F. Buckley Jr., American author and conservative commentator (b. 1925)\nIvan Rebroff, German singer (b. 1931)", "William F. Buckley Jr., American author and conservative commentator (b. 1925)", "Ivan Rebroff, German singer (b. 1931)"]}, {"Month No.": "11", "Month-Day(s)-Events": ["March 1 – Raúl Reyes, Colombian guerrilla (b. 1948)", "March 2\nSofiko Chiaureli, Georgian actress (b. 1937)\nJeff Healey, Canadian musician (b. 1966)", "Sofiko Chiaureli, Georgian actress (b. 1937)", "Jeff Healey, Canadian musician (b. 1966)", "March 3\nGiuseppe Di Stefano, Italian operatic tenor (b. 1921)\nNorman Smith, English singer and record producer (b. 1923)", "Giuseppe Di Stefano, Italian operatic tenor (b. 1921)", "Norman Smith, English singer and record producer (b. 1923)", "March 4 – Gary Gygax, American writer and game designer (b. 1938)", "March 5 – Joseph Weizenbaum, German-American author and computer scientist (b. 1923)", "March 6 – Peter Poreku Dery, Ghanaian cardinal (b. 1918)", "March 12 – Howard Metzenbaum, American politician (b. 1917)", "March 14 – Chiara Lubich, Italian Catholic activist (b. 1920)", "March 16\nBill Brown, Australian cricketer (b. 1912)\nIvan Dixon, American actor (b. 1931)", "Bill Brown, Australian cricketer (b. 1912)", "Ivan Dixon, American actor (b. 1931)", "March 18 – Anthony Minghella, English film director and screenwriter (b. 1954)", "March 19\nSir Arthur C. Clarke, English author, inventor, and futurist (b. 1917)\nHugo Claus, Flemish writer, painter, and film director (b. 1929)\nPaul Scofield, English actor (b. 1922)", "Sir Arthur C. Clarke, English author, inventor, and futurist (b. 1917)", "Hugo Claus, Flemish writer, painter, and film director (b. 1929)", "Paul Scofield, English actor (b. 1922)", "March 21 – Klaus Dinger, German musician (b. 1946)", "March 22 – Adolfo Suárez Rivera, Mexican cardinal (b. 1927)", "March 24\nNeil Aspinall, British record producer and business executive (b. 1942)\nRichard Widmark, American actor (b. 1914)", "Neil Aspinall, British record producer and business executive (b. 1942)", "Richard Widmark, American actor (b. 1914)", "March 26 – Manuel Marulanda, Colombian guerrilla (b. 1930)", "March 27 – Jean-Marie Balestre, French sports executive (b. 1921)", "March 30 – Dith Pran, Cambodian-American photojournalist (b. 1942)", "March 31 – Jules Dassin, American film director (b. 1911)"]}, {"Month No.": "12", "Month-Day(s)-Events": ["April 3 – Hrvoje Ćustić, Croatian footballer (b. 1983)", "April 5 – Charlton Heston, American actor (b. 1923)", "April 8 – Stanley Kamel, American actor (b. 1943)", "April 10 – Ernesto Corripio y Ahumada, Mexican cardinal (b. 1919)", "April 12 – Patrick Hillery, 6th President of Ireland (b. 1923)", "April 13 – John Archibald Wheeler, American theoretical physicist (b. 1911)", "April 14 – Ollie Johnston, American animator (b. 1912)", "April 15 – Benoît Lamy, Belgian motion picture writer and director (b. 1945)", "April 16 – Edward Norton Lorenz, American mathematician and meteorologist (b. 1917)", "April 17 – Aimé Césaire, French Martinican poet and politician (b. 1913)", "April 26 – Árpád Orbán, Hungarian footballer (b. 1938)", "April 29 – Albert Hofmann, Swiss chemist and writer (b. 1906)"]}, {"Month No.": "13", "Month-Day(s)-Events": ["May 1\nAnthony Mamo, 1st president of Malta (b. 1909)\nPhilipp von Boeselager, German Wehrmacht officer involved in the 20 July Plot (b. 1917)", "Anthony Mamo, 1st president of Malta (b. 1909)", "Philipp von Boeselager, German Wehrmacht officer involved in the 20 July Plot (b. 1917)", "May 3 – Leopoldo Calvo-Sotelo, Spanish prime minister (b. 1926)", "May 8\nEddy Arnold, American country music singer (b. 1918)\nFrançois Sterchele, Belgian footballer (b. 1982)", "Eddy Arnold, American country music singer (b. 1918)", "François Sterchele, Belgian footballer (b. 1982)", "May 10 – Leyla Gencer, Turkish soprano (b. 1928)", "May 11 – John Rutsey, Canadian musician (b. 1952)", "May 12\nRobert Rauschenberg, American pop artist (b. 1925)\nIrena Sendler, Polish humanitarian (b. 1910)", "Robert Rauschenberg, American pop artist (b. 1925)", "Irena Sendler, Polish humanitarian (b. 1910)", "May 13\nSaad Al-Salim Al-Sabah, fourth Emir of Kuwait (b. 1930)\nBernardin Gantin, Beninese cardinal (b. 1922)\nJohn Phillip Law, American actor (b. 1937)", "Saad Al-Salim Al-Sabah, fourth Emir of Kuwait (b. 1930)", "Bernardin Gantin, Beninese cardinal (b. 1922)", "John Phillip Law, American actor (b. 1937)", "May 15\nWillis Lamb, American physicist and Nobel laureate (b. 1913)\nTommy Burns, Scottish footballer and manager (b. 1956)", "Willis Lamb, American physicist and Nobel laureate (b. 1913)", "Tommy Burns, Scottish footballer and manager (b. 1956)", "May 19 – Vijay Tendulkar, Indian playwright (b. 1928)", "May 23 – Cornell Capa, Hungarian-American photographer (b. 1918)", "May 24 – Rob Knox, English actor (b. 1989)", "May 26\nSydney Pollack, American actor, director, and producer (b. 1934)\nKoloa Talake, seventh prime minister of Tuvalu (b. 1934)", "Sydney Pollack, American actor, director, and producer (b. 1934)", "Koloa Talake, seventh prime minister of Tuvalu (b. 1934)", "May 28 – Sven Davidson, Swedish tennis player (b. 1928)", "May 29\nLuc Bourdon, Canadian ice hockey defenceman (b. 1987)\nHarvey Korman, American actor and comedian (b. 1927)", "Luc Bourdon, Canadian ice hockey defenceman (b. 1987)", "Harvey Korman, American actor and comedian (b. 1927)", "May 30 – Boris Shakhlin, Soviet gymnast (b. 1932)"]}]