[{"Month No.": "1", "Month-Day(s)-Events": ["January 4 – The Cicada 3301 internet hunt begins", "January 12 – Violent protests occur in Bucharest, Romania, as two-day-old demonstrations continue against President Traian Băsescu's economic austerity measures. Clashes are reported in numerous Romanian cities between protesters and law enforcement officers.", "January 13 – The passenger cruise ship Costa Concordia runs aground off the coast of Italy, causing 32 deaths.", "January 23 – Iran–European Union relations: the European Union adopts an embargo against Iran in protest of its continued effort to enrich uranium."]}, {"Month No.": "2", "Month-Day(s)-Events": ["February 1 – Egypt's deadliest football incident known as the Port Said Stadium riot is sparked after local Port Said Al Masry fans attack supporters of Cairo-based team Al Ahly SC. The massacre results in 74 deaths: 72 Al Ahly fans, 1 Al Masry fan and 1 police officer. Most of the deaths are caused by stabbing, fans thrown off the stands and a stampede.", "February 19 – Iran suspends oil exports to Britain and France, following sanctions put in place by the European Union and the United States in January.", "February 21 – Greek government-debt crisis: Eurozone finance ministers reach an agreement on a second, €130-billion Greek bailout.", "February 27 – Yemeni President Ali Abdullah Saleh formally transfers power to Vice President Abdrabbuh Mansur Hadi, after a year of mass protests, ending his 33-year-long reign."]}, {"Month No.": "3", "Month-Day(s)-Events": ["March 4 – A series of explosions is reported at a munitions dump in Brazzaville, the capital of the Republic of the Congo, with at least 250 people dead.", "March 5 – Air date of KONY 2012 (viral documentary film) on YouTube", "March 12 – A coach carrying school pupils and teachers crashes while travelling through Sierre Tunnel on the A9 motorway in western Switzerland. Of the 52 people on board, 28 are killed, among them 22 children.", "March 13 – After 246 years since its first publication, the Encyclopædia Britannica discontinues its print edition.", "March 15 – Communist party chief of Chongqing Bo Xilai, well known for his neo-Maoist leanings and policies, is removed from his post after a large scandal involving the murder of British businessman Neil Heywood and an incident involving the Chongqing police chief Wang Lijun.", "March 22 – The President of Mali, Amadou Toumani Touré, is ousted in a coup d'état after mutinous soldiers attack government offices.", "March 22 – Pakistan wins the 2012 Asia Cup cricket tournament."]}, {"Month No.": "4", "Month-Day(s)-Events": ["April 6 – The National Movement for the Liberation of Azawad unilaterally declares the independence of Azawad from Mali.", "April 11 – An 8.6 earthquake strikes Indonesia triggering a small tsunami that hits the coast of Aceh.", "April 12 – Mutinous soldiers in Guinea-Bissau stage a coup d'état and take control of the capital city, Bissau. They arrest interim President Raimundo Pereira and leading presidential candidate Carlos Gomes Júnior in the midst of a presidential election campaign.", "April 13 – Kwangmyŏngsŏng-3, a North Korean Earth observation satellite, explodes shortly after launch. The United States and other countries had called the impending launch a violation of United Nations Security Council demands. The launch was planned to mark the centenary of the birth of Kim Il-sung, the founder of the republic.", "April 20 – Bhoja Air Flight 213 crashes near Rawalpindi, Pakistan, killing all 127 people on board.", "April 25 – Former Liberian President Charles Taylor is found guilty on 11 counts of aiding and abetting war crimes and crimes against humanity during the Sierra Leone Civil War."]}, {"Month No.": "5", "Month-Day(s)-Events": ["May 2 – A pastel version of The Scream, by the Norwegian painter Edvard Munch, sells for US$120 million in a New York City auction, setting a new world record for an auctioned work of art.", "May 6  – Legislative elections are held in Greece to elect all 300 members of the Hellenic Parliament and the New Democracy party led by Antonis Samaras, comes out as the largest party winning 108 out of 300 seats.", "May 7 – Vladimir Putin is elected President of Russia.", "May 12–August 12 – The 2012 World Expo takes place in Yeosu, South Korea.", "May 19 – Chelsea wins the 2011-12 UEFA Champions League held in Munich, Germany by beating the home side Bayern Munich in the final.", "May 20 – An annular solar eclipse visible from Asia and North America is the 58th solar eclipse from 73 solar eclipses of Solar Saros 128.", "May 22 – Tokyo Skytree, the tallest self-supporting tower in the world at 634 metres high, is opened to the public.", "May 22–26 – The Eurovision Song Contest 2012 takes place in Baku, Azerbaijan, and is won by Swedish entrant Loreen with the song \"Euphoria\"."]}, {"Month No.": "6", "Month-Day(s)-Events": ["June 5–6 – The century's second and last solar transit of Venus occurs. The next pair are predicted to occur in 2117 and 2125.", "June 6 – 2012 Middle East respiratory syndrome coronavirus outbreak first identified.", "June 7 – Morley and Dianella in Perth, Western Australia, have a once in a decade tornado.", "June 8–July 1 – Poland and Ukraine jointly host the UEFA Euro 2012 football tournament, which is won by Spain.", "June 17 – Snap legislative elections are held in Greece, following failure to form a government, to elect all 300 members of the Hellenic Parliament and the New Democracy party, led by Antonis Samaras, comes out as the largest party winning 129 out of 300 seats.", "June 18 – Shenzhou 9, a Chinese spacecraft carrying three Chinese astronauts, including the first-ever female, docks manually with orbiting module Tiangong-1, making this the third country, after the United States and Russia, successfully to perform the mission.", "June 21 – The Congress of Paraguay approves the impeachment of president Fernando Lugo.", "June 22 – Fernando Lugo is removed from power. Vice President Federico Franco becomes the new president of Paraguay.", "June 24 – Lonesome George, the last known individual of the Pinta Island tortoise subspecies, dies in Galápagos National Park, thus making the subspecies extinct.", "June 30 – Mohamed Morsi, a member of the Muslim Brotherhood, is elected 5th President of Egypt, the first elected democratically by the Egyptian people, sparking mixed reactions and protests throughout the country."]}, {"Month No.": "7", "Month-Day(s)-Events": ["July 4 – CERN announces the discovery of a new particle with properties consistent with the Higgs boson after experiments at the Large Hadron Collider.", "July 20 – 2012 Aurora, Colorado shooting: 12 people are killed and 58 are injured in a mass shooting at a movie theater in Aurora, Colorado. The shooter, James Holmes, opens fire on a crowd during a screening of The Dark Knight Rises.", "July 21 – Turkish adventurer Erden Eruç becomes the first person in history to complete a solo human-powered circumnavigation of the Earth.", "July 23 – The Solar storm of 2012 is an unusually large coronal mass ejection emitted by the Sun which barely misses the Earth by nine days. If it had hit, it would have caused up to US$2.6 trillion in damages to electrical equipment worldwide.", "July 27–August 12 – The 2012 Summer Olympics are held in London, England, United Kingdom.", "July 30–31 – In the worst power outage in world history, the 2012 India blackouts leave 620 million people without power."]}, {"Month No.": "8", "Month-Day(s)-Events": ["August 6 – Curiosity, the Mars Science Laboratory mission's rover, successfully lands on Mars.", "August 24 – The House of Representatives of Japan passes a resolution criticizing the President of South Korea Lee Myung-bak's visit to the disputed Liancourt Rocks.", "August 31 – Armenia severs diplomatic relations with Hungary, following the extradition to Azerbaijan and subsequent pardoning of Ramil Safarov, who was convicted of killing an Armenian soldier in Hungary in 2004. The move is also met with fierce criticism from other countries."]}, {"Month No.": "9", "Month-Day(s)-Events": ["September 7 – Canada officially cuts diplomatic ties with Iran by closing its embassy in Tehran, and orders the expulsion of Iranian diplomats from Ottawa, over support for Syria, nuclear plans and human rights abuses.", "September 11–27 – A series of terrorist attacks are directed against United States diplomatic missions worldwide, as well as diplomatic missions of Germany, Switzerland and the United Kingdom. In the US, opinions are divided over whether the attacks are a reaction to a YouTube trailer for the film Innocence of Muslims. In Libya, among the dead is US ambassador J. Christopher Stevens.", "September 22 – The United Kingdom informs the World Health Organization about a novel coronavirus case originating from Saudi Arabia."]}, {"Month No.": "10", "Month-Day(s)-Events": ["October 14 – Austrian skydiver Felix Baumgartner becomes the first person to break the sound barrier without any machine assistance, during a record space dive out of the Red Bull Stratos helium-filled balloon from 128,000 ft (24 miles (39 km)) over Roswell, New Mexico in the United States.", "October 16 – Seven paintings worth $25 million are stolen from the Kunsthal in Rotterdam, the Netherlands.", "October 22 – November 2 – Hurricane Sandy, the largest Atlantic hurricane on record (as measured by diameter, with tropical-storm-force winds spanning 900 miles (1,400 km)), wreaks havoc, resulting in 233 total deaths and $68.7 billion (2012 USD) damage.", "October 28 – Jorge Lorenzo becomes the World Champion of the 2012 Grand Prix motorcycle racing season."]}, {"Month No.": "11", "Month-Day(s)-Events": ["November 6 – 2012 United States presidential election: Barack Obama is reelected President of the United States, defeating his Republican challenger Mitt Romney.", "November 13 – A total solar eclipse occurs in parts of Australia and the South Pacific. It is the 45th of 72 solar eclipses of Solar Saros 133.", "November 14–21 – Israel launches Operation Pillar of Defense against the Palestinian-governed Gaza Strip, killing Hamas military chief Ahmed Jabari. In the following week 140 Palestinians and five Israelis are killed in an ensuing cycle of violence. A ceasefire between Israel and Hamas is announced by Egyptian Foreign Minister Mohamed Kamel Amr and US Secretary of State Hillary Clinton after the week-long escalation in hostilities in Southern Israel and the Gaza Strip.", "November 25–December 9 – Typhoon Bopha, known as \"Pablo\" in the Philippines, kills at least 1,067 with around 838 people missing. The typhoon causes considerable damage in the island of Mindanao.", "November 29 – The UN General Assembly approves a motion granting Palestine non-member observer state status."]}, {"Month No.": "12", "Month-Day(s)-Events": ["December 6 – The U.S. state of Washington becomes the first jurisdiction in the modern world officially to legalize the possession of cannabis for personal use.", "December 8 – The UN Climate Change Conference in Qatar agrees to extend the Kyoto Protocol until 2020.", "December 12 – North Korea successfully launches satellite Kwangmyongsong-3 Unit 2.", "December 12 is the last time in the 21st century that the month, day and final two digits of the year are the exact same (12/12/12). The next time this will happen will be on New Year’s Day in 2101 (01/01/01).", "December 14 – Sandy Hook Elementary School shooting: Twenty-eight people, including the gunman, are killed in Sandy Hook, Connecticut.", "December 17 – Spanish bank Grupo Santander announces the acquisition of the remaining 10% of Banesto it did not yet own, effectively absorbing it into Banco Santander.", "December 18 – At least 55 people drown after an overcrowded boat capsizes off the coast of Somalia.", "December 21 – Final year of the world as claimed by the Mayan calendar, ending on 12-21-12, stating that 2013 would not happen according to 2012 phenomenon."]}, {"Month No.": "13", "Month-Day(s)-Events": ["January 7 – Blue Ivy Carter, American singer", "January 24 – Princess Athena of Denmark", "February 23 – Princess Estelle, Duchess of Östergötland"]}]