[{"Month No.": "1", "Month-Day(s)-Events": ["January 3 – Following the fallout caused by the execution of Nimr al-Nimr, Saudi Arabia and several other countries end their diplomatic relations with Iran.", "January 8 – Joaquín Guzmán, widely regarded as the world's most powerful drug trafficker, is recaptured following his escape from a maximum-security prison in Mexico.", "January 12 – Ten people are killed and 15 wounded in a bombing near the Blue Mosque in Istanbul.", "January 16\nThe International Atomic Energy Agency announces that Iran has adequately dismantled its nuclear weapons program, allowing the United Nations to lift sanctions immediately.\n30 people are killed and 56 injured in terrorist attacks in Ouagadougou, Burkina Faso, targeting a hotel and a nearby restaurant. A siege occurs and 176 hostages are released afterwards, by government forces.\nIn the general election of the Republic of China (Taiwan), the Democratic Progressive Party, led by Tsai Ing-wen, secured a majority in the Legislative Yuan, resulting in the first majority by a non-KMT party and the first majority won by the DPP. Tsai become the 14th President for Taiwan, and also become the first female leader for China.", "The International Atomic Energy Agency announces that Iran has adequately dismantled its nuclear weapons program, allowing the United Nations to lift sanctions immediately.", "30 people are killed and 56 injured in terrorist attacks in Ouagadougou, Burkina Faso, targeting a hotel and a nearby restaurant. A siege occurs and 176 hostages are released afterwards, by government forces.", "In the general election of the Republic of China (Taiwan), the Democratic Progressive Party, led by Tsai Ing-wen, secured a majority in the Legislative Yuan, resulting in the first majority by a non-KMT party and the first majority won by the DPP. Tsai become the 14th President for Taiwan, and also become the first female leader for China.", "January 28 – The World Health Organization announces an outbreak of the Zika virus."]}, {"Month No.": "2", "Month-Day(s)-Events": ["February 7 – North Korea launches a reconnaissance satellite named Kwangmyŏngsŏng-4 into space, it is condemned internationally as a long-range ballistic missile test.", "February 12 – Pope Francis and Patriarch Kirill sign an Ecumenical Declaration in the first such meeting between leaders of the Catholic and Russian Orthodox Churches since their schism in 1054."]}, {"Month No.": "3", "Month-Day(s)-Events": ["March 14 – The ESA and Roscosmos launch the joint ExoMars Trace Gas Orbiter on a mission to Mars.", "March 21\nThe International Criminal Court finds former Congolese Vice President Jean-Pierre Bemba guilty of war crimes and crimes against humanity, the first time the ICC convicted someone of sexual violence.\nBarack Obama visits Cuba, marking the first time a sitting US president has visited the island nation since president Calvin Coolidge visited in 1928.", "The International Criminal Court finds former Congolese Vice President Jean-Pierre Bemba guilty of war crimes and crimes against humanity, the first time the ICC convicted someone of sexual violence.", "Barack Obama visits Cuba, marking the first time a sitting US president has visited the island nation since president Calvin Coolidge visited in 1928.", "March 22 – 2016 Brussels bombings: Suicide bombing attacks at Brussels' Zaventem airport and Maalbeek metro station kill 35 people and injure 300 more.", "March 24 – Ex-Bosnian Serb leader Radovan Karadžić is sentenced to 40 years in prison after being found guilty of genocide and crimes against humanity committed during the Bosnian War."]}, {"Month No.": "4", "Month-Day(s)-Events": ["April 1–5 – 2016 Nagorno-Karabakh clashes: Clashes occur along the Nagorno-Karabakh line of contact with the Artsakh Defense Army, backed by the Armenian Armed Forces, on one side and the Azerbaijani Armed Forces on the other. The US State Department estimates that a total of 350 people have been killed in the clashes, which have been defined as \"the worst\" since the 1994 ceasefire.", "April 3 – The International Consortium of Investigative Journalists (ICIJ) and the German newspaper Süddeutsche Zeitung publish a set of 11.5 million confidential documents from the Panamanian corporate Mossack Fonseca that provides detailed information on more than 214,000 offshore companies, including the identities of shareholders and directors including noted personalities and heads of state."]}, {"Month No.": "5", "Month-Day(s)-Events": ["May 9 – Rodrigo Duterte is elected the President of the Philippines.", "May 10–14 – The Eurovision Song Contest 2016 is held in Stockholm, Sweden, and is won by Ukrainian entrant Jamala with the song \"1944\".", "May 19 – EgyptAir Flight 804 crashes into the Mediterranean Sea en route from Paris to Cairo, killing all 66 people on board.", "May 20 – Tsai Ing-wen is sworn in as the President of the Republic of China (Taiwan).", "May 28 - Harambe was shot and killed at the Cincinnati Zoo and Botanical Garden and becoming a meme.", "May 30 – Former Chadian President Hissène Habré is sentenced to life in prison for crimes against humanity committed during his tenure from 1982 to 1990, the first time an African Union-backed court convicted a former ruler of a country within its jurisdiction."]}, {"Month No.": "6", "Month-Day(s)-Events": ["June 1 – The Gotthard Base Tunnel, the world's longest and deepest railway tunnel, is opened following two decades of construction work.", "June 10 – July 10 – France hosts the UEFA Euro 2016 football tournament, which is won by Portugal.", "June 12 – A gunman claiming allegiance to the Islamic State opens fire at a gay nightclub in Orlando, Florida, killing 49 people and injuring 53 others.", "June 23 – The United Kingdom votes in a referendum to leave the European Union.", "June 28 – 2016 Atatürk Airport attack: ISIL is suspected to be responsible for attacking Atatürk Airport in Istanbul, Turkey, killing 45 people and injuring around 230 others."]}, {"Month No.": "7", "Month-Day(s)-Events": ["July 1 – Latvia becomes the 35th member of the OECD.", "July 2 – 2016 Australian federal election: Malcolm Turnbull's Liberal/National Coalition Government is narrowly re-elected, defeating the Labor Party led by Bill Shorten.", "July 5 – NASA's Juno spacecraft enters orbit around Jupiter and begins a 20-month survey of the planet.", "July 6 – The augmented reality mobile game Pokémon Go is released, breaking numerous records in terms of sales and revenue.", "July 12 – The Philippines wins the arbitration case they filed at the Permanent Court of Arbitration regarding the legality of China's \"Nine-Dash Line\" claim over the South China Sea under the United Nations Convention on the Law of the Sea.", "July 14 – 2016 Nice truck attack: 86 people are killed and more than 400 others injured in a truck attack in Nice, France, during Bastille Day celebrations.", "July 15–16 – In Turkey, a faction within the Turkish Armed Forces that organized themselves as the Peace at Home Council, unsuccessfully stages a coup against the state institutions, resulting in the deaths of at least 240 people and triggering a series of unprecedented purges throughout the country.", "July 22 – The final videocassette recorder is manufactured by the Japanese company Funai.", "July 26 – Swiss Solar Impulse 2 becomes the first solar-powered aircraft to circumnavigate the Earth."]}, {"Month No.": "8", "Month-Day(s)-Events": ["August 5–21 – The 2016 Summer Olympics are held in Rio de Janeiro, Brazil, the first time in South America.", "August 24 – A 6.2 earthquake hits central Italy, killing 299 people.", "August 31 – The Brazilian Senate votes (61–20) to impeach the President of Brazil Dilma Rousseff. The Vice President of Brazil, Michel Temer, who had assumed the presidential powers and duties as Acting President of Brazil during Rousseff's suspension, takes office for the remainder of her term."]}, {"Month No.": "9", "Month-Day(s)-Events": ["September 1 – An annular solar eclipse was visible from Gabon, Congo, Democratic Republic of Congo, Tanzania, Mozambique and Madagascar.", "September 3 – The US and China, together responsible for 40% of the world's carbon emissions, both formally join the Paris global climate agreement."]}, {"Month No.": "10", "Month-Day(s)-Events": ["September 8 – NASA launches OSIRIS-REx, its first asteroid sample return mission. The probe will visit Bennu and is expected to return with samples in 2023.", "September 9 – The government of North Korea conducts its fifth and reportedly biggest nuclear test. World leaders condemn the act, with South Korea calling it \"maniacal recklessness\".", "September 28\nInternational investigators conclude that Malaysia Airlines Flight 17 was shot down by a Buk missile that came from an area controlled by pro-Russian rebels in eastern Ukraine.\nGlobal CO2 levels exceed 400 ppm at the time of year normally associated with minimum levels. A 400 ppm level is believed to be higher than anything experienced in human history.", "International investigators conclude that Malaysia Airlines Flight 17 was shot down by a Buk missile that came from an area controlled by pro-Russian rebels in eastern Ukraine.", "Global CO2 levels exceed 400 ppm at the time of year normally associated with minimum levels. A 400 ppm level is believed to be higher than anything experienced in human history.", "September 30 – Two paintings by Vincent van Gogh with a combined value of $100 million, Seascape at Scheveningen and Congregation Leaving the Reformed Church in Nuenen, are recovered after having been stolen on December 7, 2002 from the Van Gogh Museum in Amsterdam."]}, {"Month No.": "11", "Month-Day(s)-Events": ["October 7 – Three events that played a significant role in the 2016 United States presidential election all take place on the same afternoon: (1) U.S. intelligence agencies publicly accuse the Russian government of using computer hacking to interfere with the U.S. election process; (2) The Washington Post releases a videotape showing candidate Donald Trump privately bragging about sexual improprieties; (3) WikiLeaks releases thousands of private emails from inside the political campaign of candidate Hillary Clinton.", "October 13 – The Maldives announces its decision to withdraw from the Commonwealth of Nations.", "October 15 – 150 nations meet at the United Nations Environment Programme (UNEP) summit in Rwanda and agree to phase out hydrofluorocarbons (HFCs) as an amendment to the Montreal Protocol."]}, {"Month No.": "12", "Month-Day(s)-Events": ["November 2 – The Chicago Cubs win the World Series for the first time since 1908, ending the longest championship drought in American sports history.", "November 6 – The Government of India announced the demonetisation of certain banknotes, causing prolonged cash shortages in the weeks that followed and significant disruption throughout the economy.", "November 8 – 2016 United States presidential election: Businessman and television personality Donald Trump is elected the 45th President of the United States in a surprise victory against his opponent, former Secretary of State Hillary Clinton.", "November 18 – The remains of Philippine dictator Ferdinand Marcos are buried in a private ceremony at the Libingan ng mga Bayani prompting protests throughout the Philippines.", "November 24 – The Colombian government and the Revolutionary Armed Forces of Colombia—People's Army sign a revised peace deal, slowing the Colombian conflict.", "November 28 – LaMia Flight 2933 crashes into a mountain near Medellín, Colombia, killing 71 of the 77 people on board, including members of the Brazilian Chapecoense football squad."]}, {"Month No.": "13", "Month-Day(s)-Events": ["December 4 – A constitutional referendum is held in Italy, resulting in the resignation of the Prime Minister.", "December 19\nAndrei Karlov, the Russian ambassador to Turkey, is assassinated by an off-duty Turkish police officer at an art exhibition in Ankara.\nBerlin truck attack: A truck is deliberately driven into the Christmas market next to the Kaiser Wilhelm Memorial Church at Breitscheidplatz in Berlin, leaving 12 people dead and 56 others injured.", "Andrei Karlov, the Russian ambassador to Turkey, is assassinated by an off-duty Turkish police officer at an art exhibition in Ankara.", "Berlin truck attack: A truck is deliberately driven into the Christmas market next to the Kaiser Wilhelm Memorial Church at Breitscheidplatz in Berlin, leaving 12 people dead and 56 others injured.", "December 22 – A study finds the VSV-EBOV vaccine against the Ebola virus between 70 and 100% effective, and thus making it the first proven vaccine against the disease.", "December 23 – The United Nations Security Council adopts Resolution 2334 condemning \"Israeli settlements in Palestinian territories occupied since 1967\".", "December 25 – 2016 Russian Defence Ministry Tupolev Tu-154 crash: A Tupolev Tu-154 jetliner of the Russian Defence Ministry crashes into the Black Sea shortly after taking off from Sochi International Airport, Russia, while en route to Khmeimim Air Base, Syria. All 92 people on board, including 64 members of the Alexandrov Ensemble choir of the Russian Armed Forces, are killed.", "December 31 – Withdrawal of the majority of U.S. troops from Afghanistan after 15 years of war."]}]